Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: A clear separation between OTRS and the modules is necessary for proper developing. Particularly when using a git clone, a clear separation is crucial. In order to facilitate the OTRS access the files, links must be created. This is done by a script in the directory module tools repository.
hu: Egyértelmű szétválasztás szükséges az OTRS és a modulok között a megfelelő fejlesztéshez. Különösen egy git klón használatakor kritikus az egyértelmű szétválasztás. Annak érdekében, hogy megkönnyítse az OTRS-nek a fájlokhoz történő hozzáférést, linkeket kell létrehozni. Ez megtehető a könyvtármodul eszközök tárolójában lévő parancsfájllal.
zh_cn: OTRS和模块之间的明确分离对于正确开发是必要的。 特别是当使用git克隆时，明确的分离是至关重要的。 为了便于OTRS访问文件，必须创建链接。 这是通过模块工具存储库目录中的脚本完成的。

source: Example: linking the *Calendar* module:
hu: Példa: a *Naptár* modul hozzákapcsolása:
zh_cn: 示例：链接 *Calendar日历* 模块：

source: Whenever new files are added, they must be linked as described above.
hu: Amikor új fájlok kerülnek hozzáadásara, akkor azokat a fent bemutatott módon kell hozzákapcsolni.
zh_cn: 每当添加新文件时，必须如上所述链接它们。

source: As soon as the linking is completed, the system configuration must be rebuilt to register the module in OTRS. Additional SQL or Perl code from the module must also be executed.
hu: Amint a hozzákapcsolás befejeződött, újra kell építeni a rendszerbeállításokat a modul regisztrálásához az OTRS-be. A további SQL vagy Perl-kódot is végre kell hajtani a modulból.
zh_cn: 链接完成后，必须重建系统配置以在OTRS中注册模块。 还必须执行模块中的其它SQL或Perl代码。

source: To remove links from OTRS enter the following command:
hu: A kapcsolatoknak az OTRS-ből történő eltávolításához adja ki a következő parancsot:
zh_cn: 要从OTRS中删除链接，请输入以下命令：

source: OTRS Internals - How it Works
hu: OTRS belsőségek - hogyan működik
zh_cn: OTRS内部 - 如何工作

source: Config Mechanism
hu: Beállítási mechanizmus
zh_cn: 配置机制

source: OTRS comes with a dedicated mechanism to manage configuration options via a graphical interface (system configuration). This section describes how it works internally and how you can provide new configuration options or change existing default values.
hu: Az OTRS dedikált mechanizmussal érkezik a konfigurációs beállítások kezeléséhez egy grafikus felületen (rendszerbeállításokon) keresztül. Ez a szakasz azt írja le, hogy hogyan működik belsőleg, és hogyan adhat meg új konfigurációs beállításokat, vagy hogyan változtathatja meg a meglévő alapértelmezett értékeket.
zh_cn: OTRS带有专用机制，可通过图形界面（系统配置）管理配置选项。 本节介绍内部如何工作以及如何提供新配置选项或更改现有默认值。

source: ``Defaults.pm``: OTRS Default Configuration
hu: ``Defaults.pm``: az OTRS alapértelmezett beállításai
zh_cn: ``Defaults.pm``: OTRS 默认配置

source: The default configuration file of OTRS is ``Kernel/Config/Defaults.pm``. This file is needed for operation of freshly installed systems without a deployed XML configuration and should be left untouched as it is automatically updated on framework updates.
hu: Az OTRS alapértelmezett beállítófájlja a ``Kernel/Config/Defaults.pm``. Ez a fájl szükséges az üzembe állított XML-beállítások nélküli, frissen telepített rendszerek működéséhez, és a fájlt érintetlenül kell hagyni, mivel automatikusan frissítésre kerül a keretrendszer frissítéseikor.
zh_cn: OTRS的默认配置文件是 ``Kernel/Config/Defaults.pm``。 在没有部署的XML配置的情况下运行新安装的系统需要此文件，并且应该保持不变，因为它在框架更新时自动更新。

source: Automatically Generated Configuration Files
hu: Automatikusan előállított beállítófájlok
zh_cn: 自动生成的配置文件

source: In ``Kernel/Config/Files`` you can find some automatically generated configuration files:
hu: A ``Kernel/Config/Files`` mappában néhány automatikusan előállított beállítófájl található:
zh_cn: 在 ``Kernel/Config/Files`` 中，您可以找到一些自动生成的配置文件：

source: Perl cache of the XML configuration's current values (default or modified by user).
hu: Az XML beállítások aktuális értékeinek (alapértelmezett vagy a felhasználó által módosított) Perl gyorsítótára.
zh_cn: XML配置的当前值的Perl缓存（默认或由用户修改）。

source: Perl cache of ACL configuration from database.
hu: Az adatbázisból származó ACL beállítások Perl gyorsítótára.
zh_cn: 来自数据库的ACL配置的Perl缓存。

source: Perl cache of process management configuration from database.
hu: Az adatbázisból származó folyamatmenedzsment beállítások Perl gyorsítótára.
zh_cn: 来自数据库的流程管理配置的Perl缓存。

source: These files are a Perl representation of the current system configuration. They should never be manually changed as they are overwritten by OTRS.
hu: Ezek a fájlok az aktuális rendszerbeállítások Perl változatai. Sosem szabad kézzel megváltoztatni, mivel az OTRS felülírja azokat.
zh_cn: 这些文件是当前系统配置的Perl表示法。 永远不要手动更改它们，因为它们由OTRS覆盖。

source: XML Configuration Files
hu: XML beállítófájlok
zh_cn: XML配置文件

source: In OTRS, configuration options that the administrator can configure via system configuration are provided via XML files with a special format. To convert old XML's you can use the following command:
hu: Az OTRS-ben azok a beállítási lehetőségek, amelyeket az adminisztrátor a rendszerbeállításokon keresztül be tud állítani, különleges formátumban lévő XML-fájlokon keresztül biztosítottak. A régi XML-ek átalakításához használhatja a következő parancsot:
zh_cn: 在OTRS中，管理员可以通过系统配置配置的配置选项通过具有特殊格式的XML文件提供。 要转换旧XML，您可以使用以下命令：

source: The file ``Kernel/Config/Files/ZZZAAuto.pm`` is a cached Perl version of the XML that contains all settings with their current value. It can be (re-)generated with:
hu: A ``Kernel/Config/Files/ZZZAAuto.pm`` fájl az XML gyorsítótárazott Perl verziója, amely tartalmazza az összes beállítást azok aktuális értékeivel. Újra előállíthatók a következő paranccsal:
zh_cn: ``Kernel/Config/Files/ZZZAAuto.pm`` 文件是XML的缓存Perl版本，包含所有具有当前值的设置。 它可以这样（重新）生成：

source: Each XML config file has the following layout:
hu: Az egyes XML beállítófájloknak a következő elrendezésük van:
zh_cn: 每个XML配置文件都具有以下布局：

source: The global ``init`` attribute describes where the config options should be loaded. There are different levels available and will be loaded/overloaded in the following order:
hu: A globális ``init`` attribútum azt írja le, hogy honnan kell a beállítási lehetőségeket betölteni. Különböző szintek érhetők el, és a következő sorrendben lesznek betöltve/felülírva:
zh_cn: 全局``init``属性描述了应该加载配置选项的位置。 有不同级别可用，将按以下顺序加载/重载：

source: ``Framework`` (for framework settings e. g. session option)
hu: ``Framework`` (a keretrendszer beállításaihoz, például munkamenet beállítás)
zh_cn: ``Framework`` (用于框架设置，例如会话选项)

source: ``Application`` (for application settings e. g. ticket options)
hu: ``Application`` (az alkalmazás beállításaihoz, például jegybeállítások)
zh_cn: ``Application`` （用于应用程序设置，例如工单选项）

source: ``Config`` (for extensions to existing applications e. g. ITSM options)
hu: ``Config`` (kiterjesztésekhez a meglévő alkalmazásoknál, például ITSM beállítások)
zh_cn: ``Config`` （用于扩展现有应用程序，例如ITSM选项）

source: ``Changes`` (for custom development e. g. to overwrite framework or ticket options).
hu: ``Changes`` (egyéni fejlesztésekhez, például keretrendszer vagy jegybeállítások felülírásához).
zh_cn: ``Changes`` （用于自定义开发，例如覆盖框架或工单选项）。

source: The configuration items are written as ``Setting`` elements with a ``Description``, a ``Navigation`` group (for the tree-based navigation in the GUI) and the ``Value`` that it represents. Here's an example:
hu: A beállítási elemek ``Setting`` elemekként vannak írva egy ``Description`` leírással, egy ``Navigation`` csoporttal (a fa alapú navigációhoz a grafikus felhasználói felületen) és a ``Value`` értékkel, amely azt képviseli. Álljon itt egy példa:
zh_cn: 配置项被写为 ``Setting`` 元素，有一个 ``Description`` 、一个 ``Navigation`` 组（用于GUI中的基于树的导航）和它所代表的 ``Value`` 。 这是一个例子：

source: If this is set to 1, the configuration setting cannot be disabled.
hu: Ha ez 1 értékre van állítva, akkor a konfigurációs beállítást nem lehet letiltani.
zh_cn: 如果设置为1，则无法禁用配置设置。

source: Determines if the config setting is active (1) or inactive (0) by default.
hu: Meghatározza, hogy a konfigurációs beállítás alapértelmezetten be van kapcsolva (1) vagy ki van kapcsolva (0).
zh_cn: 确定默认情况下配置设置是激活（1）还是非激活（0）。

source: If the optional attribute ``ConfigLevel`` is set, the config variable might not be edited by the administrator, depending on his own config level. The config variable ``ConfigLevel`` sets the level of technical experience of the administrator. It can be *100 (Expert)*, *200 (Advanced)* or *300 (Beginner)*. As a guideline which config level should be given to an option, it is recommended that all options having to do with the configuration of external interaction, like Sendmail, LDAP, SOAP, and others should get a config level of at least *200 (Advanced)*.
hu: Ha az opcionális ``ConfigLevel`` attribútum be van állítva, akkor a beállítási változót esetleg nem szerkesztheti az adminisztrátor a saját beállítási szintjétől függően. A ``ConfigLevel`` beállítási változó állítja be az adminisztrátor szakmai tapasztalatának szintjét. Lehet *100 (Szakértő)*, *200 (Speciális)* vagy *300 (Kezdő)*. Iránymutatásként, hogy mely beállítási szintet kell egy lehetőséghez megadni, az az ajánlott, hogy az összes olyan lehetőségnek, amelyet külső interakció beállításával kell megtenni (mint például Sendmail, LDAP, SOAP és egyebek), legalább *200 (Speciális)* beállítási szintet kell kapnia.
zh_cn: 如果设置了可选属性 ``ConfigLevel``，则管理员可能无法编辑配置变量，具体取决于他自己的配置级别。 配置变量 ``ConfigLevel`` 设置管理员的技术经验水平。 它可以是 *100（专家）*， *200（高级）* 或 *300（初学者）*。 作为应该为选项提供配置级别的指导原则，建议所有与外部交互配置相关的选项（如Sendmail、LDAP、SOAP等）的配置级别至少应为 *200（高级）*。

source: If set to 1, the config setting is not shown in the GUI.
hu: Ha 1 értékre van állítva, akkor a konfigurációs beállítás nem jelenik meg a grafikus felhasználói felületen.
zh_cn: 如果设置为1，则GUI中不显示配置设置。

source: If set to 1, the config setting cannot be changed in the GUI.
hu: Ha 1 értékre van állítva, akkor a konfigurációs beállítást nem lehet megváltoztatni a grafikus felhasználói felületen.
zh_cn: 如果设置为1，则无法在GUI中更改配置设置。

source: If ``UserModificationPossible`` is set to ``1``, administrators can enable user modifications of this setting (in user preferences).
hu: Ha a ``UserModificationPossible`` ``1`` értékre van állítva, akkor az adminisztrátorok engedélyezhetik a beállítás felhasználói módosításait (a felhasználói beállításokban).
zh_cn: 如果 ``UserModificationPossible`` 设置为 ``1`` ，管理员可以启用用户修改此设置（在用户首选项中）。

source: If ``UserModificationActive`` is set to ``1``, user modifications of this setting is enabled (in user preferences). You should use this attribute together with ``UserModificationPossible``.
hu: Ha a ``UserModificationActive`` ``1`` értékre van állítva, akkor a beállítás felhasználói módosításai engedélyezve vannak (a felhasználói beállításokban). Ezt az attribútumot a ``UserModificationPossible`` attribútummal együtt kell használnia.
zh_cn: 如果 ``UserModificationActive`` 设置为 ``1``，则启用用户对此设置的修改（在用户首选项中）。 您应该将此属性与 ``UserModificationPossible`` 一起使用。

source: Use ``UserPreferencesGroup`` attribute to define under which group config variable belongs (in the ``UserPreferences`` screen). You should use this attribute together with ``UserModificationPossible``.
hu: Használja a ``UserPreferencesGroup`` attribútumot annak meghatározásához, hogy mely csoport alá tartozik a konfigurációs érték (a ``UserPreferences`` képernyőn). Ezt az attribútumot a ``UserModificationPossible`` attribútummal együtt kell használnia.
zh_cn: 使用 ``UserPreferencesGroup`` 属性来定义哪个组配置变量属于哪个（在 ``UserPreferences用户首选项`` 屏幕中）。 您应该将此属性与 ``UserModificationPossible`` 一起使用。

source: Guidelines for placing settings in the right navigation nodes:
hu: Iránymutatások a beállítások megfelelő navigációs csomópontokba való elhelyezéséhez:
zh_cn: 在右侧导航节点中放置设置的准则：

source: Only create new nodes if neccessary. Avoid nodes with only very few settings if possible.
hu: Csak akkor hozzon létre új csomópontot, ha szükséges. Kerülje a csak nagyon kevés beállítással rendelkező csomópontokat, ha lehetséges.
zh_cn: 只在必要时才创建新节点。 如果可能，请避免仅使用极少数设置的节点。

source: On the first tree level, no new nodes should be added.
hu: A fa első szintjén nem szabad új csomópontokat hozzáadni.
zh_cn: 在第一个树级别，不应添加新节点。

source: Don't place new settings in ``Core`` directly. This is reserved for a few important global settings.
hu: Ne tegyen új beállításokat a ``Core`` csomópontba közvetlenül. Ez néhány fontos globális beállításnak van fenntartva.
zh_cn: 不要直接在 ``Core`` 中放置新设置。 它保留用于一些重要的全局设置。

source: ``Core::*`` can take new groups that contain settings that cover the same topic (like ``Core::Email``) or relate to the same entity (like ``Core::Queue``).
hu: A ``Core::*`` kaphat új csoportokat, amelyek hasonló témát lefedő beállításokat tartalmaznak (például ``Core::Email``) vagy ugyanahhoz az entitáshoz kapcsolódnak (például ``Core::Queue``).
zh_cn: ``Core::*`` 可以采用包含相同主题设置的新组（如 ``Core::Email``）或与同一实体相关（如 ``Core::Queue``）。

source: All event handler registrations go to ``Core::Event``.
hu: Az összes eseménykezelő regisztráció a ``Core::Event`` csoportba kerüljön.
zh_cn: 所有事件处理程序注册都转到 ``Core::Event``。

source: Don't add new direct child nodes within ``Frontend``. Global front end settings go to ``Frontend::Base``, settings only affecting a part of the system go to the respective ``Admin``, ``Agent``, ``Customer`` or ``Public`` sub nodes.
hu: Ne adjon hozzá új közvetlen gyermekcsomópontokat a ``Frontend`` csomóponton belül. A globális előtétprogram beállítások a ``Frontend::Base`` csoportba kerüljenek, a csak a rendszer egy részét érintő beállítások a megfelelő ``Admin``, ``Agent``, ``Customer`` vagy ``Public`` alcsoportokba kerüljenek.
zh_cn: 不要在 ``Frontend`` 中添加新的直接子节点。 全局前端设置转到 ``Frontend::Base``，只影响系统一部分的设置转到相应的 ``Admin``、 ``Agent``、 ``Customer`` 或 ``Public`` 子节点。

source: Front end settings that only affect one screen should go to the relevant screen (``View``) node (create one if needed), for example ``AgentTicketZoom`` related settings go to ``Frontend::Agent::View::TicketZoom``. If there are module layers within one screen with groups of related settings, they would also go to a sub group here (e. g. ``Frontend::Agent::View::TicketZoom::MenuModule`` for all ticket zoom menu module registrations).
hu: Azok az előtétprogram beállítások, amelyek csak egy képernyőt érintenek, a kapcsolódó képernyő (``View``) csomópontjába (hozzon létre egyet, ha szükséges) kerüljenek. Például az ``AgentTicketZoom`` képernyőhöz kapcsolódó beállítások a ``Frontend::Agent::View::TicketZoom`` csoportba kerüljenek. Ha kapcsolódó beállítások csoportjaival rendelkező modulrétegek vannak egy képernyőn belül, akkor azok is kerülhetnek ide egy alcsoportba (például ``Frontend::Agent::View::TicketZoom::MenuModule`` az összes jegynagyítás menü modulregisztrációjához).
zh_cn: 只影响一个屏幕的前端设置应该转到相关的屏幕（``View``）节点（如果需要，创建一个），例如 ``AgentTicketZoom`` 相关的设置转到 ``Frontend::Agent::View::TicketZoom``。 如果一个屏幕中有模块层与相关设置组，他们也会到这里的子组（例如 ``Frontend::Agent::View::TicketZoom::MenuModule`` 用于所有工单详情菜单模块注册）。

source: All global loader settings go to ``Frontend::Base::Loader``, screen specific loader settings to ``Frontend::*::ModuleRegistration::Loader``.
hu: Az összes globális betöltő beállítások a ``Frontend::Base::Loader`` csoportba, a képernyőre jellemző betöltő beállítások a ``Frontend::*::ModuleRegistration::Loader`` csoportba kerüljenek.
zh_cn: 所有全局加载器设置都转到 ``Frontend::Base::Loader``，屏幕特定的加载器设置为 ``Frontend::*::ModuleRegistration::Loader``。

source: Structure of ``Value`` elements
hu: A ``Value`` elemek szerkezete
zh_cn: ``Value`` 元素的结构

source: ``Value`` elements hold the actual configuration data payload. They can contain single values, hashes or arrays.
hu: A ``Value`` elemek tartalmazzák a tényleges beállítási adatok hasznos terhét. Tartalmazhatnak önálló értékeket, kivonatokat vagy tömböket.
zh_cn: ``Value`` 元素保存实际的配置数据有效负载。 它们可以包含单个值、哈希或数组。

source: An ``Item`` element holds one piece of data. The optional ``ValueType`` attribute determines which kind of data and how it needs to be presented to the user in the GUI. If no ``ValueType`` is specified, it defaults to ``String``.
hu: Egy ``Item`` elem egyetlen adatot tartalmaz. Az elhagyható ``ValueType`` attribútum határozza meg, hogy milyen típusú adat, és hogyan kell megjeleníteni a felhasználónak a grafikus felületen. Ha nincs ``ValueType`` megadva, akkor alapértelmezetten ``String`` lesz.
zh_cn: 一个 ``Item`` 元素包含一个数据。 可选的 ``ValueType`` 属性确定哪种数据以及如何在GUI中向用户呈现它。 如果没有指定 ``ValueType``，则默认为 ``String``。

source: Please see :ref:`Value Types` for a definition of the different value types.
hu: Nézze meg az :ref:`Value Types` fejezetet a különböző értéktípusok meghatározásához.
zh_cn: 请参阅 :ref:`Value Types` ，了解不同值类型的定义。

source: With this config element arrays can be displayed.
hu: Ezzel a beállítási elemmel tömbök jeleníthetők meg.
zh_cn: 使用此配置元素可以显示数组。

source: With this config element hashes can be displayed.
hu: Ezzel a beállítási elemmel kivonatok jeleníthetők meg.
zh_cn: 使用此配置元素可以显示哈希值。

source: It's possible to have nested array/hash elements (like hash of arrays, array of hashes, array of hashes of arrays, etc.). Below is an example array of hashes.
hu: Lehetőség van egymásba ágyazott tömb vagy kivonat elemek meglétére is (mint például tömbök kivonata, kivonatok tömbje, tömbök kivonatainak tömbje, stb.). Lent van egy példa a kivonatok tömbjére.
zh_cn: 可以使用嵌套的数组/哈希元素（如数组哈希、哈希数组、数组哈希数组等）。 下面是哈希数组的示例。

source: Value Types
hu: Értéktípusok
zh_cn: 值类型

source: The XML config settings support various types of configuration variables.
hu: Az XML konfigurációs beállítások különféle típusú beállítási változókat támogatnak.
zh_cn: XML配置设置支持各种类型的配置变量。

source: A config element for numbers and single-line strings. Checking the validity with a regular expression is possible (optional). This is the default ``ValueType``.
hu: Egy beállítási elem számokhoz és egysoros karakterláncokhoz. Ellenőrizhető az érvényesség egy reguláris kifejezéssel, ha lehetséges (elhagyható). Ez az alapértelmezett ``ValueType``.
zh_cn: 用于数字和单行字符串的配置元素。 可以使用正则表达式检查有效性（可选）。 这是默认的 ``ValueType``。

source: The optional ``Translatable`` attribute marks this setting as translatable, which will cause it to be included in the OTRS translation files. This attribute can be placed on any tag (see also below).
hu: Az opcionális ``Translatable`` attribútum jelöli meg ezt a beállítást fordíthatóként, amely azt fogja eredményezni, hogy fel lesz véve az OTRS fordítási fájljaiba. Ezt az attribútumot bármely címkére el lehet helyezni (lásd lent is).
zh_cn: 可选的 ``Translatable`` 属性将此设置标记为可翻译，这将使其包含在OTRS翻译文件中。 此属性可以放在任何标记上（另请参见下文）。

source: A config element for passwords. It's still stored as plain text in the XML, but it's masked in the GUI.
hu: Egy beállítási elem jelszavakhoz. Továbbra is egyszerű szövegként van tárolva az XML-ben, de el van fedve a grafikus felhasználói felületen.
zh_cn: 用于密码的配置元素。 它仍然以纯文本形式存储在XML中，但它在GUI中被屏蔽。

source: A config element for Perl module. It has a ``ValueFilter`` attribute, which filters possible values for selection. In the example below, user can select Perl module ``Kernel::System::Log::SysLog`` or ``Kernel::System::Log::File``.
hu: Egy beállítási elem Perl-modulhoz. Rendelkezik egy ``ValueFilter`` attribútummal, amely szűri a lehetséges értékeket a kiválasztásnál. A lenti példában a felhasználó a ``Kernel::System::Log::SysLog`` vagy a ``Kernel::System::Log::File`` Perl-modult választhatja.
zh_cn: 用于Perl模块的配置元素。 它有一个 ``ValueFilter`` 属性，用于过滤可能的选择值。 在下面的示例中，用户可以选择Perl模块 ``Kernel::System::Log::SysLog`` 或 ``Kernel::System::Log::File``。

source: A config element for multiline text.
hu: Egy beállítási elem többsoros szöveghez.
zh_cn: 用于多行文本的配置元素。

source: This config element offers preset values as a pull-down menu. The ``SelectedID`` or ``SelectedValue`` attributes can pre-select a default value.
hu: Ez a beállítási elem előre beállított értékeket nyújt egy legördülő menüként. A ``SelectedID`` vagy a ``SelectedValue`` attribútumok előre kiválaszthatnak egy alapértelmezett értéket.
zh_cn: 此配置元素提供预设值作为下拉菜单。 ``SelectedID`` 或 ``SelectedValue`` 属性可以预先选择一个默认值。

source: This config element checkbox has two states: 0 or 1.
hu: Ennek a jelölőnégyzet beállítási elemnek két állapota van: 0 vagy 1.
zh_cn: 此配置元素复选框有两种状态：0或1。

source: This config element contains a date value.
hu: Ez a beállítási elem egy dátumértéket tartalmaz.
zh_cn: 此配置元素包含日期值。

source: This config element contains a date and time value.
hu: Ez a beállítási elem egy dátumot és egy időértéket tartalmaz.
zh_cn: 此配置元素包含日期时间值。

source: This config element contains a directory.
hu: Ez a beállítási elem egy könyvtárat tartalmaz.
zh_cn: 此配置元素包含一个目录。

source: This config element contains a file path.
hu: Ez a beállítási elem egy fájlútvonalat tartalmaz.
zh_cn: 此配置元素包含一个文件路径。

source: This config element contains a value of a particular entity. ``ValueEntityType`` attribute defines the entity type. Supported entities: ``DynamicField``, ``Queue``, ``Priority``, ``State`` and ``Type``. Consistency checks will ensure that only valid entities can be configured and that entities used in the configuration cannot be set to invalid. Also, when an entity is renamed, all referencing config settings will be updated.
hu: Ez a beállítási elem egy bizonyos entitás értékét tartalmazza. A ``ValueEntityType`` attribútum határozza meg az entitás típusát. Támogatott entitások: ``DynamicField``, ``Queue``, ``Priority``, ``State`` és ``Type``. A következetesség-ellenőrzések fogják biztosítani, hogy csak érvényes entitások legyenek beállíthatók, és hogy azok az entitások, amelyeket a beállításokban használnak, ne legyenek érvénytelenre állíthatók. Amikor egy entitást átneveznek, akkor az összes hivatkozó konfigurációs beállítás frissítve lesz.
zh_cn: 此配置元素包含特定实体的值。 ``ValueEntityType`` 属性定义实体类型。 支持的实体： ``DynamicField``、 ``Queue``、 ``Priority``、 ``State`` 和 ``Type``。 一致性检查将确保只能配置有效实体，并且配置中使用的实体不能设置为无效。 此外，重命名实体时，将更新所有引用配置设置。

source: This config element contains a time zone value.
hu: Ez a beállítási elem egy időzóna értéket tartalmaz.
zh_cn: 此配置元素包含时区值。

source: This config element contains definitions for vacation days which are repeating each year. Following attributes are mandatory: ``ValueMonth``, ``ValueDay``.
hu: Ez a beállítási elem meghatározásokat tartalmaz az olyan munkaszüneti napokhoz, amelyek minden évben ismétlődnek. A következő attribútumok kötelezőek: ``ValueMonth``, ``ValueDay``.
zh_cn: 此配置元素包含每年重复的休假日的定义。 以下属性是必填的：``ValueMonth``、``ValueDay``。

source: This config element contains definitions for vacation days which occur only once. Following attributes are mandatory: ``ValueMonth``, ``ValueDay`` and ``ValueYear``.
hu: Ez a beállítási elem meghatározásokat tartalmaz az olyan munkaszüneti napokhoz, amelyek csak egyszer fordulnak elő. A következő attribútumok kötelezőek: ``ValueMonth``, ``ValueDay`` és ``ValueYear``.
zh_cn: 此配置元素包含仅发生一次的休假日的定义。 以下属性是必填的：``ValueMonth``、``ValueDay`` 和 ``ValueYear``。

source: This config element contains definitions for working hours.
hu: Ez a beállítási elem meghatározásokat tartalmaz a munkaidőhöz.
zh_cn: 此配置元素包含工作时间的定义。

source: Front End Registration
hu: Előtétprogram regisztráció
zh_cn: 前端注册

source: Module registration for agent interface:
hu: Modul regisztráció az ügyintézői felülethez:
zh_cn: 服务人员界面的模块注册：

source: Default Item in Array and Hash
hu: Alapértelmezett elem tömbben és kivonatban
zh_cn: 数组和哈希中的默认项
