Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: If you want to create an OPM package (``.opm``) you need to create a spec file (``.sopm``) which includes the properties of the package.
hu: Ha egy OPM csomagot (``.opm``) szeretne létrehozni, akkor létre kell hoznia egy specifikációs fájl (``.sopm``), amely a csomag tulajdonságait tartalmazza.
zh_cn: 如果你想创建一个OPM包（``.opm``），你需要创建一个规范文件（``.sopm``），包含包的属性。

source: Package Spec File
hu: Csomagspecifikációs fájl
zh_cn: 包规范文件

source: The OPM package is XML based. You can create/edit the ``.sopm`` via a text or XML editor. It contains meta data, a file list and database options.
hu: Az OPM csomag XML alapú. A ``.sopm`` fájlt egy szöveg- vagy egy XML-szerkesztővel hozhatja létre és szerkesztheti. Ez metaadatokat, egy fájllistát és adatbázis-beállításokat tartalmaz.
zh_cn: OPM包是基于XML的。 您可以通过文本或XML编辑器创建/编辑该 ``.sopm`` 文件。 它包含元数据、文件列表和数据库选项。

source: The package name.
hu: A csomag neve.
zh_cn: 包名称。

source: The package version.
hu: A csomag verziója.
zh_cn: 包版本。

source: The targeted framework version (7.0.x means e.g. 7.0.1 or 7.0.2).
hu: A megcélzott keretrendszer verziója (a 7.0.x jelentése például 7.0.1 vagy 7.0.2).
zh_cn: 目标框架版本（7.0.x 表示 7.0.1 或 7.0.2之类）。

source: Can also be used several times.
hu: Több alkalommal is használható.
zh_cn: 也可以多次使用。

source: The package vendor.
hu: A csomag gyártója.
zh_cn: 包的提供商。

source: The vendor URL.
hu: A gyártó URL-e.
zh_cn: 提供商的URL。

source: The license of the package.
hu: A csomag licence.
zh_cn: 包的许可证。

source: The package change log.
hu: A csomag változásnaplója.
zh_cn: 包更改日志。

source: The package description in different languages.
hu: A csomag leírása különböző nyelveken.
zh_cn: 不同语言的包描述。

source: Package Actions
hu: Csomagműveletek
zh_cn: 包的操作

source: The possible actions for the package after installation. If one of these actions is not defined on the package, it will be considered as possible.
hu: A csomag lehetséges műveletei a telepítés után. Ha ezen műveletek valamelyike nincs meghatározva a csomagnál, akkor lehetségesként fogja tekinteni.
zh_cn: 安装后包的可能操作。 如果未在包中定义其中一个操作，则将被视为可能。

source: A special package action is ``PackageAllowDirectUpdate``. Only if it is defined on the package and set to true, a package can be upgraded from a lower major version (earlier than the last one) to the latest version. (e.g. a package for OTRS 5 updated to OTRS 7).
hu: Egy különleges csomagművelet a ``PackageAllowDirectUpdate``. Egy csomag csak akkor frissíthető egy alacsonyabb főverzióról (a legutolsónál korábbiról) a legutolsó verzióra (például egy OTRS 5-ös csomag frissítése OTRS 7-re), ha ez meg van határozva a csomagban és igazra van állítva.
zh_cn: 一个特殊的包操作是 ``PackageAllowDirectUpdate``。 只有在该包上定义并设置为true时，才能将该包从较低的主要版本（早于最后一个版本）升级到最新版本。 （例如，将OTRS 5的包更新到OTRS 7）。

source: This will be filled in automatically by OPM.
hu: Ezt az OPM automatikusan ki fogja tölteni.
zh_cn: 这将由OPM自动填写。

source: Packages that must be installed beforehand. If ``PackageRequired`` is used, a version of the required package must be specified.
hu: Csomagok, amelyeket előzetesen telepíteni kell. Ha a ``PackageRequired`` használatban van, akkor a szükséges csomag egy verzióját meg kell adni.
zh_cn: 必须事先安装的软件包。 如果使用 ``PackageRequired``，则必须指定所需包的版本。

source: Perl modules that must be installed beforehand.
hu: Perl-modulok, amelyeket előzetesen telepíteni kell.
zh_cn: 必须事先安装的Perl模块。

source: Required OS.
hu: A szükséges operációs rendszer.
zh_cn: 所需操作系统。

source: This is a list of files included in the package.
hu: Ez a csomagban lévő fájlok listája.
zh_cn: 这是包中包含的文件列表。

source: Database entries that have to be created when a package is installed.
hu: Adatbázis-bejegyzések, amelyeket létre kell hozni, amikor a csomagot telepítik.
zh_cn: 安装软件包时必须创建的数据库条目。

source: You also can choose ``<DatabaseInstall Type="post">`` or ``<DatabaseInstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<DatabaseInstall Type="post">`` vagy ``<DatabaseInstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<DatabaseInstall Type="post">`` 或 ``<DatabaseInstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Information on which actions have to be performed in case of an upgrade.
hu: Információk arról, hogy mely műveleteket kell végrehajtani egy frissítés esetén.
zh_cn: 有关升级软件包时必须执行哪些操作的信息。

source: Example if already installed package version is below 1.3.4 (e. g. 1.2.6), the defined action will be performed:
hu: Például ha egy korábban telepített csomag verziója 1.3.4 alatt van (mondjuk 1.2.6), akkor végre lesz hajtva a meghatározott művelet:
zh_cn: 例如，如果已安装的软件包版本低于1.3.4（例如1.2.6），则将执行定义的操作：

source: You also can choose ``<DatabaseUpgrade Type="post">`` or ``<DatabaseUpgrade Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<DatabaseUpgrade Type="post">`` vagy ``<DatabaseUpgrade Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<DatabaseUpgrade Type="post">`` 或 ``<DatabaseUpgrade Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Information on which actions have to be performed if the package is reinstalled.
hu: Információk arról, hogy mely műveleteket kell végrehajtani, ha a csomagot újratelepítik.
zh_cn: 有关安装软件包时必须执行哪些操作的信息。

source: You also can choose ``<DatabaseReinstall Type="post">`` or ``<DatabaseReinstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<DatabaseReinstall Type="post">`` vagy ``<DatabaseReinstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<DatabaseReinstall Type="post">`` 或 ``<DatabaseReinstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Actions to be performed on package uninstall.
hu: A végrehajtandó műveletek a csomag eltávolításakor.
zh_cn: 卸载软件包时要执行的操作。

source: You also can choose ``<DatabaseUninstall Type="post">`` or ``<DatabaseUninstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<DatabaseUninstall Type="post">`` vagy ``<DatabaseUninstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<DatabaseUninstall Type="post">`` 或 ``<DatabaseUninstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: To show a pre or post install introduction in installation dialog.
hu: Egy telepítés előtti vagy utáni bevezető megjelenítéséhez a telepítési párbeszédablakban.
zh_cn: 在安装对话框中显示安装前或安装后的介绍。

source: You can also use the ``Format`` attribute to define if you want to use ``html`` (which is default) or ``plain`` to use automatically a ``<pre></pre>`` tag when intro is shown (to keep the newlines and whitespace of the content).
hu: Használhatja a ``Format`` attribútumot is annak meghatározásához, hogy ``html`` (amely alapértelmezett) vagy ``plain`` (egyszerű szöveg) tartalmat szeretne használni. Az utóbbi automatikusan egy ``<pre></pre>`` címkét használ, amikor a bevezető megjelenik (a tartalom új sorai és üres karakterei megtartásához).
zh_cn: 您还可以使用 ``Format`` 属性来定义在显示介绍时是否要使用 ``html`` （默认值）或 ``plain`` 来自动使用 ``<pre> </pre>`` 标签（保留内容的换行符和空格）。

source: To show a pre or post uninstall introduction in uninstallation dialog.
hu: Egy eltávolítás előtti vagy utáni bevezető megjelenítéséhez az eltávolítási párbeszédablakban.
zh_cn: 在卸载对话框中显示卸载前或卸载后的介绍。

source: To show a pre or post reinstall introduction in re-installation dialog.
hu: Egy újratelepítés előtti vagy utáni bevezető megjelenítéséhez az újratelepítési párbeszédablakban.
zh_cn: 在重新安装对话框中显示重新安装前或重新安装后的介绍。

source: To show a pre or post upgrade introduction in upgrading dialog.
hu: Egy frissítés előtti vagy utáni bevezető megjelenítéséhez a frissítési párbeszédablakban.
zh_cn: 在升级对话框中显示升级前或升级后的介绍。

source: Perl code to be executed when the package is installed.
hu: A végrehajtandó Perl-kód, amikor a csomagot telepítik.
zh_cn: 安装包后要执行的Perl代码。

source: You also can choose ``<CodeInstall Type="post">`` or ``<CodeInstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<CodeInstall Type="post">`` vagy ``<CodeInstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<CodeInstall Type="post">`` 或 ``<CodeInstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Perl code to be executed when the package is uninstalled. On pre or post time of package uninstallation.
hu: A végrehajtandó Perl-kód, amikor a csomagot eltávolítják. A csomag eltávolításának előtti vagy utáni idejében.
zh_cn: 卸载软件包后要执行的Perl代码。 在卸载软件包之前或之后的时间。

source: You also can choose ``<CodeUninstall Type="post">`` or ``<CodeUninstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<CodeUninstall Type="post">`` vagy ``<CodeUninstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<CodeUninstall Type="post">`` 或 ``<CodeUninstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Perl code to be executed when the package is reinstalled.
hu: A végrehajtandó Perl-kód, amikor a csomagot újratelepítik.
zh_cn: 重新安装软件包后要执行的Perl代码。

source: You also can choose ``<CodeReinstall Type="post">`` or ``<CodeReinstall Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<CodeReinstall Type="post">`` vagy ``<CodeReinstall Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<CodeReinstall Type="post">`` 或 ``<CodeReinstall Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: Perl code to be executed when the package is upgraded (subject to ``version`` tag).
hu: A végrehajtandó Perl-kód, amikor a csomagot frissítik (a ``version`` címkétől függően).
zh_cn: 升级软件包后要执行的Perl代码（以 ``version`` 标签为准）。

source: You also can choose ``<CodeUpgrade Type="post">`` or ``<CodeUpgrade Type="pre">`` to define the time of execution separately (``post`` is default). For more info see :ref:`Package Life Cycle`.
hu: Választhat ``<CodeUpgrade Type="post">`` vagy ``<CodeUpgrade Type="pre">`` típust is a végrehajtás idejének külön-külön történő meghatározásához (a ``post`` az alapértelmezett). További információkért nézze meg a :ref:`Package Life Cycle` szakaszt.
zh_cn: 你还可以选择 ``<CodeUpgrade Type="post">`` 或 ``<CodeUpgrade Type="pre">`` 来分别定义执行时间（``post`` 是默认的）。 有关更多信息，请参阅 :ref:`Package Life Cycle`。

source: This tag signals that a package has been merged into another package. In this case the original package needs to be removed from the file system and the packages database, but all data must be kept.
hu: Ez a címke jelzi, hogy egy csomag egyesítve lett egy másik csomaggal. Ebben az esetben az eredeti csomagot el kell távolítani a fájlrendszerről és a csomagok adatbázisából, de az összes adatot meg kell tartani.
zh_cn: 此标记表示包已合并到另一个包中。 在这种情况下，需要从文件系统和包数据库中删除原始包，但必须保留所有数据。

source: Let's assume that ``PackageOne`` was merged into ``PackageTwo``. Then ``PackageTwo.sopm`` should contain this:
hu: Tegyük fel, hogy az ``ElsoCsomag`` egyesítve lett a ``MasodikCsomag`` nevű csomaggal. Ekkor a ``MasodikCsomag.sopm`` fájlnak ezt kell tartalmaznia:
zh_cn: 我们假设 ``PackageOne`` 被合并到 ``PackageTwo`` 中。 那么 ``PackageTwo.sopm`` 应该包含这个：

source: If ``PackageOne`` also contained database structures, we need to be sure that it was at the latest available version of the package to have a consistent state in the database after merging the package. The attribute ``TargetVersion`` does just this: it signifies the last known version of ``PackageOne`` at the time ``PackageTwo`` was created. This is mainly to stop the upgrade process if in the user's system a version of ``PackageOne`` was found that is *newer* than the one specified in ``TargetVersion`` as this could lead to problems.
hu: Ha az ``ElsoCsomag`` is tartalmaz adatbázis-szerkezetet, akkor meg kell győződnünk arról, hogy az a csomag legfrissebb elérhető verziójánál volt, hogy következetes állapot legyen az adatbázisban a csomag egyesítése után. A ``TargetVersion`` attribútum csak ennyi csinál: jelzi az ``ElsoCsomag`` utolsó ismert verzióját abban az időpontban, amikor a ``MasodikCsomag`` létrejött. Ez főleg azért van, hogy leállítsa a frissítési folyamatot, ha a felhasználó rendszerén megtalálható az ``ElsoCsomag`` egy olyan verziója, amely *újabb* a ``TargetVersion`` attribútumban megadottnál, mivel ekkor ez problémákhoz vezethet.
zh_cn: 如果 ``PackageOne`` 也包含数据库结构，我们需要确保它是在包的最新可用版本，以便在合并包后在数据库中具有一致状态。 ``TargetVersion`` 属性的作用：它表示在创建 ``PackageTwo`` 时 ``PackageOne`` 的最后一个已知版本。 这主要是为了在用户的系统中发现了一个 ``PackageOne`` 版本比 ``TargetVersion`` 中指定的版本 *更新* 时停止升级过程，因为这可能会导致问题。

source: Additionally it is possible to add required database and code upgrade tags for ``PackageOne`` to make sure that it gets properly upgraded to the ``TargetVersion`` *before* merging it - to avoid inconsistency problems. Here's how this could look like:
hu: Továbbá lehetőség van a szükséges adatbázis és kódfrissítési címkék hozzáadására az ``ElsoCsomag`` nevű csomagnál annak biztosításához, hogy az megfelelően kerül frissítésre a ``TargetVersion`` verzióra az egyesítés *előtt* - a következetlenségi problémák elkerüléséhez. Itt látható, hogy ennek hogyan kellene kinéznie:
zh_cn: 另外，可以为 ``PackageOne`` 添加所需的数据库和代码升级标签，以确保在 *合并之前* 将其正确升级到 ``TargetVersion`` - 以避免不一致问题。 这看起来是这样的：

source: As you can see the attribute ``Type="merge"`` needs to be set in this case. These sections will only be executed if a package merge is possible.
hu: Amint láthatja, ebben az esetben a ``Type="merge"`` attribútumot kell beállítani. Ezek a szakaszok csak akkor lesznek végrehajtva, ha lehetséges egy csomagegyesítés.
zh_cn: 正如您所看到的，在这种情况下需要设置属性 ``Type="merge"`` 。 只有在可以进行包合并时才会执行这些部分。

source: Package Conditions
hu: Csomagfeltételek
zh_cn: 软件包条件

source: ``IfPackage`` and ``IfNotPackage`` attributes can be added to the regular ``Database*`` and ``Code*`` sections. If they are present, the section will only be executed if another package is or is not in the local package repository.
hu: Az ``IfPackage`` and ``IfNotPackage``attribútumok hozzáadhatók a szabályos ``Database*`` és ``Code*`` szakaszokhoz. Ha ezek jelen vannak, akkor a szakasz csak akkor lesz végrehajtva, ha egy másik csomag létezik vagy nem létezik a helyi csomagtárolóban.
zh_cn: ``IfPackage`` 和 ``IfNotPackage`` 属性可以添加到常规 ``Database*`` 和 ``Code*`` 部分。 如果它们存在，则只有在本地软件包存储库中存在或不存在另一个软件包时才会执行该部分。

source: or
hu: vagy
zh_cn: or（或）

source: These attributes can be also set in the ``Database*`` and ``Code*`` sections inside the ``PackageMerge`` tags.
hu: Ezek az attribútumok beállíthatók a ``PackageMerge`` címkéken belüli ``Database*`` és ``Code*`` szakaszokban is.
zh_cn: 这些属性也可以在 ``PackageMerge`` 标签内的 ``Database*`` 和 ``Code*`` 部分设置。

source: Example .sopm
hu: Példa .sopm
zh_cn: .sopm示例

source: This is an example spec file looks with some of the above tags.
hu: Ez egy példa specifikációs fájl kinézete a fenti címkék egy részével.
zh_cn: 这是一个示例规范文件，包含一些上述标签。

source: Package Build
hu: Csomagösszeállítás
zh_cn: 构建软件包

source: To build an .opm package from the spec opm.
hu: Egy .opm csomag összeállításához a specifikációs opm fájlból.
zh_cn: 若要从opm规范文件构建.opm包。

source: Package Life Cycle
hu: Csomagéletciklus
zh_cn: 软件包生命周期

source: The following image shows you how the life cycle of a package installation, upgrade and uninstallation works in the back end step by step.
hu: A következő kép azt mutatja be lépésről lépésre, hogy egy csomag telepítési, frissítési vagy eltávolítási életciklusa hogyan működik a háttérprogramban.
zh_cn: 下图显示了软件包安装、升级和卸载的生命周期如何在后端逐步进行。

source: Package Management
hu: Csomagkezelés
zh_cn: 软件包管理

source: The OPM (OTRS Package Manager) is a mechanism to distribute software packages for the OTRS framework via HTTP, FTP or file upload.
hu: Az OPM (OTRS csomagkezelő) egy mechanizmus az OTRS keretrendszerhez való szoftvercsomagok terjesztésére HTTP-n, FTP-n vagy fájlfeltöltésen keresztül.
zh_cn: OPM（OTRS包管理器）是一种通过HTTP、FTP或文件上载为OTRS框架分发软件包的机制。

source: For example, the OTRS project offers OTRS modules like a calendar, a file manager or web mail in OTRS packages via online repositories on our FTP servers. The packages can be managed (install, upgrade and uninstall) via the admin interface.
hu: Például az OTRS projekt OTRS modulokat kínál OTRS csomagokban az internetes tárolókon vagy az FTP-kiszolgálóinkon keresztül, mint például naptár, fájlkezelő vagy webes levelező. A csomagok az adminisztrátori felületen keresztül kezelhetők (telepítés, frissítés vagy eltávolítás).
zh_cn: 例如，OTRS项目通过我们的FTP服务器上的在线软件仓库提供OTRS模块，如OTRS软件包中的日历、文件管理器或Web邮件。 可以通过管理员界面管理（安装、升级和卸载）软件包。

source: Package Distribution
hu: Csomagterjesztés
zh_cn: 软件包分发

source: If you want to create an OPM online repository, just tell the OTRS framework where the location is by activating the system configuration setting ``Package::RepositoryList`` and adding the new location there. Then you will have a new select option in the package manager.
hu: Ha egy internetes OPM tárolót szeretne létrehozni, akkor egyszerűen mondja meg az OTRS keretrendszernek a ``Package::RepositoryList`` rendszerbeállítási lehetőség bekapcsolásával, hogy hol van annak a helye, és adja meg az új helyet itt. Ezután egy új választási lehetősége lesz a csomagkezelőben.
zh_cn: 如果您想创建一个OPM在线软件仓库，只需通过激活系统配置设置 ``Package::RepositoryList`` 并在那里添加新位置，告诉OTRS框架该位置。 然后，您将在软件包管理器中有一个新的选择选项。

source: In your repository, create an index file for your OPM packages. OTRS just reads this index file and knows what packages are available.
hu: A tárolójában hozzon létre egy index fájlt az OPM csomagokhoz. Az OTRS egyszerűen beolvassa ezt az index fájlt, és tudni fogja, hogy mely csomagok érhetők el.
zh_cn: 在您的存储库中，为您的OPM软件包创建索引文件。 OTRS只读取此索引文件来获取可用的软件包。

source: Package Commands
hu: Csomagparancsok
zh_cn: 软件包命令

source: You can use the following OPM commands over the admin interface or over ``bin/otrs.Console.pl`` to manage admin jobs for OPM packages.
hu: A következő OPM parancsokat használhatja az adminisztrátori felületen vagy a ``bin/otrs.Console.pl`` parancsfájllal az adminisztrátori feladatok kezeléséhez az OPM csomagoknál.
zh_cn: 您可以通过管理员界面或 ``bin/otrs.Console.pl`` 来使用以下OPM命令来管理OPM软件包的管理任务。

source: Install
hu: Telepítés
zh_cn: 安装

source: Install OPM packages.
hu: OPM csomagok telepítése.
zh_cn: 安装OPM软件包。

source: CMD: ``bin/otrs.Console.pl Admin::Package::Install /path/to/package.opm``
hu: Parancssor: ``bin/otrs.Console.pl Admin::Package::Install /útvonal/ehhez/csomag.opm``

source: Uninstall
hu: Eltávolítás
zh_cn: 卸载

source: Uninstall OPM packages.
hu: OPM csomagok eltávolítása.
zh_cn: 卸载OPM软件包。

source: CMD: ``bin/otrs.Console.pl Admin::Package::Uninstall /path/to/package.opm``
hu: Parancssor: ``bin/otrs.Console.pl Admin::Package::Uninstall /útvonal/ehhez/csomag.opm``

source: Upgrade
hu: Frissítés
zh_cn: 升级

source: Upgrade OPM packages.
hu: OPM csomagok frissítése.
zh_cn: 升级OPM软件包。

source: CMD: ``bin/otrs.Console.pl Admin::Package::Upgrade /path/to/package.opm``
hu: Parancssor: ``bin/otrs.Console.pl Admin::Package::Upgrade /útvonal/ehhez/csomag.opm``

source: List
hu: Lista
zh_cn: 列表

source: List all OPM packages.
hu: Az összes OPM csomag felsorolása.
zh_cn: 列出所有的OPM软件包。

source: CMD: ``bin/otrs.Console.pl Admin::Package::List``
hu: Parancssor: ``bin/otrs.Console.pl Admin::Package::List``

source: Package Porting
hu: Csomagátírás
zh_cn: 软件包移植

source: With every new minor or major version of OTRS, you need to port your packages and make sure they still work with the OTRS API.
hu: Az OTRS minden új hibajavító vagy fő verziójával át kell írnia a csomagjait, és meg kell győződnie arról, hogy azok továbbra is működnek az OTRS API-val.
zh_cn: 对于每个新的次要或主要版本的OTRS，您需要移植软件包并确保它们仍然可以使用OTRS API。

source: This section lists changes that you need to examine when porting your package from OTRS 6 to 7.
hu: Ez a szakasz azokat a változtatásokat sorolja fel, amelyeket meg kell vizsgálnia, amikor átírja a csomagját az OTRS 6-ról 7-re.
zh_cn: 本节列出了将软件包从OTRS 6移植到7时需要检查的更改。

source: Sessions Always Require Cookies
hu: A munkamenetek mindig igénylik a sütiket
zh_cn: 会话始终需要Cookie

source: Starting from OTRS 7, `sessions always require cookies to be enabled <https://github.com/OTRS/otrs/commit/831aba1cfe6893d0633af6f18584216e89198072>`__. Therefore, the ``SessionIDCookie`` value was removed from ``LayoutObject``, :doc:`../how-it-works/templates` and JavaScript. It is no longer necessary to append session variables to URLs or HTTP request payloads.
hu: Az OTRS 7-től kezdve a `munkameneteknek mindig szükségük van az engedélyezett sütikre <https://github.com/OTRS/otrs/commit/831aba1cfe6893d0633af6f18584216e89198072>`__. Ennélfogva a ``SessionIDCookie`` értéke el lett távolítva a ``LayoutObject``, :doc:`../how-it-works/templates` és JavaScript kódokból. Többé nincs szükség a munkamenet-változók hozzáfűzésére az URL-eknél vagy a HTTP-kérések hasznos terhében.
zh_cn: 从OTRS 7开始，`会话总是要求启用cookie <https://github.com/OTRS/otrs/commit/831aba1cfe6893d0633af6f18584216e89198072>`__。 因此，``SessionIDCookie`` 值已从 ``LayoutObject`` 、:doc:`../how-it-works/templates` 和JavaScript中删除。 不再需要将会话变量附加到URL或HTTP请求负载。

source: The ``groups`` Table Was Renamed
hu: A ``groups`` tábla átnevezésre került
zh_cn: ``groups`` 表被重命名

source: Due to a change in MySQL 8, the table ``groups`` had to be renamed to ``groups_table``. If you use this table directly in any SQL statements, they will need to be adapted. For more information, see `bug#13866 <https://bugs.otrs.org/show_bug.cgi?id=13866>`__.
hu: A MySQL 8-ban végzett változtatás miatt a ``groups`` táblát át kellett nevezni ``groups_table`` nevűre. Ha használja ezt a táblát közvetlenül valamilyen SQL-lekérdezésekben, akkor azokat hozzá kell igazítani. További információkért nézze meg a `13866-os hibajegyet <https://bugs.otrs.org/show_bug.cgi?id=13866>`__.
zh_cn: 由于MySQL 8的变化， ``groups`` 表必须重命名为 ``groups_table``。 如果直接在任何SQL语句中使用此表，则需要对其进行调整。 有关更多信息，请参阅 `bug#13866 <https://bugs.otrs.org/show_bug.cgi?id=13866>`__。

source: New External Interface
hu: Új külső felület
zh_cn: 新的外部人员界面
