Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: For each HTML page generation, the loader will first take all configured CSS files from the ``default`` skin, and then for each file look if it is also available in a custom skin (if a custom skin is selected) and load them after the default files.
hu: Minden egyes HTML-oldal előállításához a betöltő először a ``default`` felszínből fogja az összes beállított CSS-fájlt venni, és ezután az egyes fájlok kinézetéhez, ha az egy egyéni felszínben is elérhető (ha egy egyéni felszín ki lett választva), majd betölti azokat az alapértelmezett fájlok után.
zh_cn: 对于每个HTML页面生成，加载器将首先从 ``default`` 皮肤中获取所有已配置的CSS文件，然后为每个文件查看它是否也在自定义皮肤中可用（如果选择了自定义皮肤）并在默认文件之后加载它们。

source: That means a) that CSS files in custom skins need to have the same names as in the default skins, and b) that a custom skin does not need to have all files of the default skin. That is the big advantage of loading the default skin first: a custom skin has all default CSS rules present and only needs to change those which should result in a different display. That can often be done in a single file, like in the example above.
hu: Ez azt jelenti, hogy az egyéni felszínekben lévő CSS-fájloknak ugyanolyan nevűeknek kell lenniük mint az alapértelmezett felszínekben, és hogy egy egyéni felszínnek nem kell az alapértelmezett felszín összes fájljával rendelkeznie. Ez a nagy előnye az alapértelmezett felszín elsőként való betöltésének: egy egyéni felszínben az összes alapértelmezett CSS-szabály jelen van, és csak azokat szükséges megváltoztatni, amelyeknek eltérő megjelenítést kell eredményezniük. Ez gyakran egyetlen fájllal elvégezhető, mint a fenti példában látható.
zh_cn: 这意味着a）自定义皮肤中的CSS文件需要与默认皮肤中的名称相同，并且b）自定义皮肤不需要具有默认皮肤的所有文件。 这是首先加载默认皮肤的一大优势：自定义皮肤具有所有默认的CSS规则，只需要更改应该导致不同显示的那些。 这通常可以在单个文件中完成，如上例所示。

source: Another effect of this is that you need to be careful to overwrite all default CSS rules in your custom skins that you want to change. Let's see an example:
hu: Ennek másik hatása, hogy figyelmesnek kell lennie az egyéni felszínekben lévő összes olyan alapértelmezett CSS-szabály felülírásánál, amelyeken változtatni szeretne. Nézzünk egy példát:
zh_cn: 这样做的另一个影响是，您需要小心覆盖要更改的自定义外观中的所有默认CSS规则。 我们来看一个例子：

source: This defines special headings inside of the ``.Header`` element as bold, black text. Now if you want to change that in your skin to another color and normal text, it is not enough to write this:
hu: Ez speciális címsorokat határoz meg a ``.Header`` elemen belül félkövér, fekete szöveggel. Ha most azt szeretné megváltoztatni, hogy a felszínben más színnel és normál szöveggel jelenjen meg, akkor nem elég ezt írni:
zh_cn: 这将 ``.Header`` 元素内部的特殊标题定义为粗体黑色文本。 现在，如果你想将皮肤中的颜色改为另一种颜色和普通文本，那么写这个是不够的：

source: Because the original rule for ``font-weight`` still applies. You need to override it explicitly:
hu: Ugyanis az eredeti ``font-weight`` szabály még mindig alkalmazva lesz. Határozottan felül kell írnia:
zh_cn: 因为 ``font-weight`` 的原始规则仍然适用。 您需要显式覆盖它：

source: Creating a New Skin
hu: Új felszín létrehozása
zh_cn: 创建一个新皮肤

source: In this section, we will be creating a new agent skin which replaces the default OTRS background color (white) with a custom company color (light grey) and the default logo by a custom one. Also we will configure that skin to be the one which all agents will see by default.
hu: Ebben a szakaszban egy új ügyintézői felszínt fogunk létrehozni, amely lecseréli az alapértelmezett (fehér) OTRS háttérszínt egy egyéni (világos szürke) vállalati színre és az alapértelmezett logót egy egyénire. Azt is be fogjuk állítani, hogy ez a felszín legyen az, amelyet az összes ügyintéző alapértelmezetten látni fog.
zh_cn: 在本节中，我们将创建一个新的服务人员皮肤，它使用自定义公司颜色（浅灰色）替换默认OTRS背景颜色（白色），并使用自定义Logo替换默认Logo（徽标）。 此外，我们将配置该皮肤为默认情况下所有服务人员将看到的皮肤。

source: There are only three simple steps we need to take to achieve this goal:
hu: Csak három egyszerű lépést kell megtennünk a cél eléréséhez:
zh_cn: 为实现这一目标，我们只需要采取三个简单的步骤：

source: create the skin files
hu: a felszínfájlok létrehozását
zh_cn: 创建皮肤文件

source: configure the new logo and
hu: az új logó beállítását és
zh_cn: 配置新的Logo

source: make the skin known to the OTRS system
hu: a felszín megismertetését az OTRS rendszerrel
zh_cn: 让OTRS系统知道该皮肤

source: Let's start by creating the files needed for our new skin. First of all, we need to create a new folder for this skin (we'll call it ``custom``). This folder will be ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/custom``.
hu: Kezdjük az új felszínünkhöz szükséges fájlok létrehozásával. Először is létre kell hoznunk egy új mappát ehhez a felszínhez (ezt ``custom`` néven fogjuk hívni). Ez a mappa a következő lesz: ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/custom``.
zh_cn: 让我们从创建新皮肤所需的文件开始。 首先，我们需要为这个皮肤创建一个新文件夹（我们称之为 ``custom``）。 该文件夹将是 ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/custom``。

source: In there, we need to place the new CSS file in a new directory ``css`` which defines the new skin's appearance. We'll call it ``Core.Default.css``. Remember that it must have the same name as one of the files in the default skin. This is the code needed for the CSS file:
hu: Ebben el kell helyeznünk az új CSS-fájlt egy új ``css`` könyvtárban, amely az új felszín megjelenését fogja meghatározni. Ezt ``Core.Default.css`` néven fogjuk hívni (emlékezzen arra, hogy ugyanolyan névvel kell rendelkeznie mint az alapértelmezett felszínben lévő fájlok egyike). Ez a CSS-fájlhoz szükséges kód:
zh_cn: 在那里，我们需要将新的CSS文件放在一个新目录 ``css`` 中，它定义了新皮肤的外观。 我们称之为 ``Core.Default.css``。 请记住，它必须与默认外观中的一个文件具有相同的名称。 这是CSS文件所需的代码：

source: Now follows the second step, adding a new logo and making the new skin known to the OTRS system. For this, we first need to place our custom logo (e.g. ``logo.png``) in a new directory (e.g. ``img``) in our skin directory. Then we need to create a new configuration file ``$OTRS_HOME/Kernel/Config/Files/XML/CustomSkin.xml``, which will contain the needed settings as follows:
hu: Most következik a második lépés egy új logó hozzáadásával, és az új felszín megismertetésével az OTRS rendszer számára. Ehhez először el kell helyeznünk az egyéni logónkat (például ``logo.png``) egy új könyvtárban (például ``img``) a saját felszín könyvtárunkban. Ezután létre kell hoznunk egy új ``$OTRS_HOME/Kernel/Config/Files/XML/CustomSkin.xml`` beállítófájlt, amely tartalmazni fogja a szükséges beállításokat az alábbiak szerint:
zh_cn: 接下来是第二步，添加一个新Logo并使OTRS系统知道该新皮肤。 为此，我们首先需要将我们的自定义logo（例如 ``logo.png``）放在我们的皮肤目录中的新目录（例如 ``img``）中。 然后我们需要创建一个新的配置文件 ``$OTRS_HOME/Kernel/Config/Files/XML/CustomSkin.xml``，它将包含所需的设置，如下所示：

source: To make this configuration active, we need to navigate to the system configuration module in the admin area of OTRS. Alternatively, you can run the script:
hu: A beállítás aktívvá tételéhez el kell navigálnunk az OTRS adminisztrációs területén lévő rendszerbeállítás modulra. Alternatív esetben lefuttathatja a következő parancsfájlt:
zh_cn: 要使此配置处于活动状态，我们需要导航到OTRS系统管理区域中的系统配置模块。 或者，您可以运行脚本：

source: This will regenerate the Perl cache of the XML configuration files, so that our new skin is now known and can be selected in the system. To make it the default skin that new agents see before they made their own skin selection, edit the system configuration setting ``Loader::Agent::DefaultSelectedSkin`` and set it to *custom*.
hu: Ez újra elő fogja állítani az XML beállítófájlok Perl gyorsítótárát azért, hogy az új felszínünk most már ismert legyen, és kiválasztható legyen a rendszeren. Ennek alapértelmezett felszínné tételéhez, amelyet az új ügyintézők azelőtt láthatnak, mielőtt a saját felszínválasztásukat megtennék, szerkessze a ``Loader::Agent::DefaultSelectedSkin`` rendszerbeállítási paramétert, és állítsa *custom* értékre.
zh_cn: 这将重新生成XML配置文件的Perl缓存，以便我们的新皮肤为系统所知并可在系统中选择。 要使它成为服务人员在进行自己的皮肤选择之前看到的默认皮肤，请编辑系统配置设置 ``Loader::Agent::DefaultSelectedSkin`` 并将其设置为 *custom*。

source: In conclusion: to create a new skin in OTRS, we had to place the new logo file, and create one CSS and one XML file, resulting in three new files:
hu: Következtetésképpen: egy új felszín létrehozásához az OTRS-ben el kellett helyeznünk az új logófájlt, és létre kellett hoznunk egy CSS-fájlt és egy XML-fájlt, amely három új fájlt eredményezett:
zh_cn: 总之：要在OTRS中创建一个新的皮肤，我们必须放置新的徽标文件，并创建一个CSS和一个XML文件，从而产生三个新文件：

source: Templating Mechanism
hu: Sablonozó mechanizmus
zh_cn: 模板机制

source: Internally, OTRS uses a templating mechanism to dynamically generate its HTML pages (and other content), while keeping the program logic (Perl) and the presentation (HTML) separate. Typically, a front end module will use an own template file, pass some data to it and return the rendered result to the user.
hu: Belsőleg az OTRS egy sablonozó mechanizmust használ a HTML oldalak (és egyéb tartalom) dinamikus előállításához, miközben szétválasztva tartja a program logikáját (Perl) és a megjelenítést (HTML). Tipikusan egy előtétprogram modul egy saját sablonfájlt fog használni, át fog adni néhány adatot annak, és vissza fogja adni a megjelenített eredményt a felhasználónak.
zh_cn: OTRS在内部使用模板机制动态生成其HTML页面（和其它内容），同时保持程序逻辑（Perl）和呈现（HTML）分离。 通常，前端模块将使用自己的模板文件，将一些数据传递给它并将渲染的结果返回给用户。

source: The template files are located at ``$OTRS_HOME/Kernel/Output/HTML/Standard/*.tt``.
hu: A sablonfájlok itt találhatók: ``$OTRS_HOME/Kernel/Output/HTML/Standard/*.tt``.
zh_cn: 模板文件位于 ``$OTRS_HOME/Kernel/Output/HTML/Standard/*.tt``。

source: OTRS relies on `the Template::Toolkit rendering engine <http://www.template-toolkit.org/>`__. The full Template::Toolkit syntax can be used in OTRS templates. This section describes some example use cases and OTRS extensions to the Template::Toolkit syntax.
hu: Az OTRS a `Template::Toolkit megjelenítő motorra <http://www.template-toolkit.org/>`__ támaszkodik. A teljes Template::Toolkit szintaxis használható az OTRS sablonokban. Ez a szakasz néhány példa használati esetet és OTRS kiterjesztést mutat be a Template::Toolkit szintaxishoz.
zh_cn: OTRS依赖于 `Template::Toolkit渲染引擎 <http://www.template-toolkit.org/>`__。 可以在OTRS模板中使用完整的Template::Toolkit语法。 本节介绍一些示例用例和Template::Toolkit语法的OTRS扩展。

source: Template Commands
hu: Sablonparancsok
zh_cn: 模板命令

source: Inserting Dynamic Data
hu: Dinamikus adatok beszúrása
zh_cn: 插入动态数据

source: In templates, dynamic data must be inserted, quoted etc. This section lists the relevant commands to do that.
hu: A sablonokba dinamikus adatokat kell beszúrni, idézni, stb. Ez a szakasz sorolja fel a fontos parancsokat ennek elvégzéséhez.
zh_cn: 在模板中，必须插入动态数据、引用等。本节列出了执行此操作的相关命令。

source: If data parameters are given to the templates by the application module, these data can be output to the template. ``[% Data.Name %]`` is the most simple, but also most dangerous one. It will insert the data parameter whose name is ``Name`` into the template as it is, without further processing.
hu: Ha az alkalmazásmodul adatparamétereket ad meg a sablonoknak, akkor ezeket az adatokat ki lehet íratni a sablonra. A ``[% Data.Name %]`` a legegyszerűbb, de a legveszélyesebb is. Azt az adatparamétert fogja további feldolgozás nélkül beszúrni a sablonba úgy ahogy van, amely neve ``Name``.
zh_cn: 如果应用程序模块将数据参数提供给模板，则这些数据可以输出到模板。``[%data.name%]`` 是最简单但也是最危险的。它将把名为 ``Name`` 的数据参数按原样插入到模板中，而无需进一步处理。

source: Because of the missing HTML quoting, this can result in security problems. Never output data that was input by a user without quoting in HTML context. The user could - for example - just insert a ``<script>`` tag, and it would be output on the HTML page generated by OTRS.
hu: A hiányzó HTML idézés miatt ez biztonsági problémákat eredményezhet. Sose írasson ki olyan adatokat, amelyeket egy felhasználó adott meg, anélkül, hogy idézné azokat a HTML környezetben. A felhasználó például egyszerűen beszúrhat egy ``<script>`` címkét, és az kiíródhat az OTRS által előállított HTML oldalon.
zh_cn: 由于缺少HTML引用，这可能导致安全问题。 永远不要输出用户输入的数据而不在HTML上下文中引用。 例如，用户可以只插入一个 ``<script>`` 标签，它将在OTRS生成的HTML页面上输出。

source: Whenever possible, use ``[% Data.Name | html %]`` (in HTML) or ``[% Data.Name | uri %]`` (in links) instead.
hu: Amikor csak lehetséges, használjon ``[% Data.Name | html %]`` (HTML-ben) vagy ``[% Data.Name | uri %]`` (hivatkozásokban) paramétert helyette.
zh_cn: 尽可能使用 ``[％Data.Name | html％]`` （在HTML中）或 ``[％Data.Name | uri％]`` （在链接中）。

source: Example: Whenever we generate HTML in the application, we need to output it to the template without HTML quoting, like ``<select>`` elements, which are generated by the function ``Layout::BuildSelection()`` in OTRS.
hu: Példa: Amikor HTML kimenetet állítunk elő az alkalmazásban, akkor HTML idézés nélkül kell kiíratnunk azt a sablonba, mint például a ``<select>`` elemeket, amelyeket a ``Layout::BuildSelection()`` függvény állít elő az OTRS-ben.
zh_cn: 示例：每当我们在应用程序中生成HTML时，我们需要将其输出到模板而不使用HTML引用，例如 ``<select>`` 元素，这些元素由OTRS中的 ``Layout::BuildSelection()`` 函数生成。

source: If you have data entries with complex names containing special characters, you cannot use the dot (``.``) notation to access this data. Use ``item()`` instead: ``[% Data.item('Complex-name') %]``.
hu: Ha speciális karaktereket tartalmazó, összetett nevű adatbejegyzései vannak, akkor nem használhatja a pont (``.``) jelölést az adathoz való hozzáféréshez. Az ``item()`` függvényt használja helyette: ``[% Data.item('Összetett-név') %]``.
zh_cn: 如果您的数据条目包含包含特殊字符的复杂名称，则不能使用点（``.``）表示法来访问此数据。 使用 ``item()`` 代替： ``[% Data.item('Complex-name') %]``。

source: This command has the same function as the previous one, but it performs HTML quoting on the data as it is inserted to the template.
hu: Ennek a parancsnak ugyanaz a funkciója mint az előzőnek, de HTML idézést hajt végre az adatokon, amint beszúrásra kerülnek a sablonba.
zh_cn: 此命令与前一个命令具有相同的功能，但它在插入模板时对数据执行HTML引用。

source: It's also possible specify a maximum length for the value. If, for example, you just want to show 8 characters of a variable (result will be *SomeName[...]*), use the following:
hu: Lehetséges az érték legnagyobb hosszának megadása is. Ha például egy változónak csak 9 karakterét szeretné megjeleníteni (az eredmény *ValamiNév[...]* lesz), akkor használja a következőt:
zh_cn: 也可以指定值的最大长度。 例如，如果您只想显示变量的8个字符（结果将是 *SomeName[...]*），请使用以下命令：

source: This command performs `URL encoding <http://en.wikipedia.org/wiki/Percent-encoding>`__ on the data as it is inserted to the template. This should be used to output single parameter names or values of URLs, to prevent security problems. It cannot be used for complete URLs because it will also mask ``=``, for example.
hu: Ez a parancs `URL-kódolást <http://en.wikipedia.org/wiki/Percent-encoding>`__ hajt végre az adatokon, amint az beszúrásra kerül a sablonba. Ezt kell használni az URL-ek egyedülálló paraméternevei vagy értékei kiíratásánál a biztonsági problémák megakadályozásához. Nem használható teljes URL-eknél, mert ki fogja maszkolni például az ``=`` karaktert is.
zh_cn: 此命令在插入模板时对数据执行 `URL编码 <http://en.wikipedia.org/wiki/Percent-encoding>`__。 这应该用于输出单个参数名称或URL值，以防止出现安全问题。 它不能用于完整的URL，因为它也会掩盖 ``=``。

source: This command outputs a string or another data structure as a JavaScript JSON string.
hu: Ez a parancs JavaScript JSON szövegként írat ki egy szöveget vagy más adatszerkezetet.
zh_cn: 此命令将字符串或其它数据结构输出为JavaScript JSON字符串。

source: Please note that the filter notation will only work for simple strings. To output complex data as JSON, please use it as a function:
hu: Vegye figyelembe, hogy a szűrőjelölés csak egyszerű szövegeknél fog működni. Összetett adatok JSON szövegként való kiíratásához függvényként használja azt:
zh_cn: 请注意，过滤符号仅适用于简单字符串。 要将复杂数据输出为JSON，请将其用作函数：

source: Inserts environment variables provided by the ``LayoutObject``. Some examples:
hu: A ``LayoutObject`` által szolgáltatott környezeti változókat szúrja be. Néhány példa:
zh_cn: 插入由 ``LayoutObject`` 提供的环境变量。 一些例子：

source: Some other common predefined variables are:
hu: Néhány egyéb gyakori előre meghatározott változó:
zh_cn: 其它一些常见的预定义变量是：

source: ``[% Env("Action") %]``: the current action
hu: ``[% Env("Action") %]``: a jelenlegi művelet
zh_cn: ``[% Env("Action") %]``: 当前操作

source: ``[% Env("Baselink") %]``: the baselink, e. g. ``index.pl?SessionID=...``
hu: ``[% Env("Baselink") %]``: az alaphivatkozás, például ``index.pl?SessionID=...``
zh_cn: ``[% Env("Baselink") %]``: 基链接，如 ``index.pl?SessionID=...``

source: ``[% Env("CGIHandle") %]``: the current CGI handle e. g. ``index.pl``
hu: ``[% Env("CGIHandle") %]``: a jelenlegi CGI-kezelő, például ``index.pl``
zh_cn: ``[% Env("CGIHandle") %]``: 当前CGI句柄，如 ``index.pl``

source: ``[% Env("SessionID") %]``: the current session id
hu: ``[% Env("SessionID") %]``: a jelenlegi munkamenet-azonosító
zh_cn: ``[% Env("SessionID") %]``: 当前会话ID

source: ``[% Env("Time") %]``: the current time e. g. *Thu Dec 27 16:00:55 2001*
hu: ``[% Env("Time") %]``: a jelenlegi idő, például *Thu Dec 27 16:00:55 2001*
zh_cn: ``[% Env("Time") %]``: 当前时间，如 *Thu Dec 27 16:00:55 2001*

source: ``[% Env("UserFullname") %]``: e. g. Dirk Seiffert
hu: ``[% Env("UserFullname") %]``: például Kovács János
zh_cn: ``[% Env("UserFullname") %]``: 用户全名，如 Dirk Seiffert

source: ``[% Env("UserIsGroup[admin]") %]``: Yes
hu: ``[% Env("UserIsGroup[admin]") %]``: igen
zh_cn: ``[% Env("UserIsGroup[admin]") %]``: 用户是admin组成员

source: ``[% Env("UserIsGroup[users]") %]``: Yes, user groups (useful for own links)
hu: ``[% Env("UserIsGroup[users]") %]``: igen, felhasználócsoportok (hasznos saját hivatkozásoknál)
zh_cn: ``[% Env("UserIsGroup[users]") %]``: 用户是users组成员（对自己的链接有用）

source: ``[% Env("UserLogin") %]``: e. g. mgg@x11.org
hu: ``[% Env("UserLogin") %]``: például mgg@x11.org
zh_cn: ``[% Env("UserLogin") %]``: 用户登录名，如 mgg@x11.org

source: Don't forget to add the ``| html`` filter where appropriate.
hu: Ne felejtse el a ``| html`` szűrőt hozzáadni, ahol az helyénvaló.
zh_cn: 别忘了添加适当的 ``| html`` 过滤器。

source: Inserts configuration variables into the template. Let's see an example ``Kernel/Config.pm``:
hu: Beállítási változókat szúr be a sablonba. Nézzünk egy példa ``Kernel/Config.pm`` fájlt:
zh_cn: 将配置变量插入模板。 让我们看一个示例 ``Kernel/Config.pm``：

source: To output values from it in the template, use:
hu: Változók kiíratásához ebből fájlból a sablonba a következőt használja:
zh_cn: 要在模板中输出它的值，请使用：

source: Because of the missing HTML quoting, this can result in security problems.
hu: A hiányzó HTML idézés miatt ez biztonsági problémákat eredményezhet.
zh_cn: 由于缺少HTML引用，这可能导致安全问题。

source: Localization Commands
hu: Honosítási parancsok
zh_cn: 本地化命令

source: Translates a string into the current user's selected language. If no translation is found, the original string will be used.
hu: Lefordít egy szöveget a felhasználó által kiválasztott jelenlegi nyelve. Ha nem található fordítás, akkor az eredeti szöveget fogja használni.
zh_cn: 将字符串转换为当前用户的选定语言。 如果未找到翻译，将使用原始字符串。

source: You can also translate dynamic data by using ``Translate`` as a filter:
hu: Lefordíthat dinamikus adatokat is a ``Translate`` szűrőként való használatával:
zh_cn: 您还可以使用 ``Translate`` 作为过滤器来翻译动态数据：

source: You can also specify one or more parameters (``%s``) inside of the string which should be replaced with dynamic data:
hu: Egy vagy több paramétert (``%s``) is megadhat a szövegen belül, amelyeket dinamikus adatokkal kell kicserélni:
zh_cn: 您还可以在字符串内指定一个或多个参数（``％s``），这些参数应替换为动态数据：

source: Strings in JavaScript can be translated and processed with the JSON filter.
hu: A JavaScriptben lévő szövegek is lefordíthatók és feldolgozhatók a JSON szűrővel.
zh_cn: JavaScript中的字符串可以使用JSON过滤器进行翻译和处理。

source: Outputs data according to the current language/locale.
hu: Kiírja az adatokat a jelenlegi nyelv vagy területi beállítás szerint.
zh_cn: 根据当前语言/区域设置输出数据。

source: In different cultural areas, different convention for date and time formatting are used. For example, what is the 01.02.2010 in Germany, would be 02/01/2010 in the USA. ``[% Localize() %]`` abstracts this away from the templates. Let's see an example:
hu: Különböző kulturális területeken különböző egyezményt használnak a dátum és idő formázásához. Például ami Németországban 01.02.2010 formátum, annak az USA-ban 02/01/2010 formátumban kellene lennie. A ``[% Localize() %]`` függvény elvonatkoztatja ezt a sablontól. Nézzünk egy példát:
zh_cn: 在不同的文化区域中，使用不同的日期和时间格式约定。 例如，在德国是01.02.2010，而在美国是02/01/2010。 ``[% Localize() %]`` 从模板中抽象出来。 我们来看一个例子：

source: First, the data is inserted from the application module with ``Data``. Here always an ISO UTC timestamp (2010-06-09 15:45:41) must be passed as data to ``[% Localize() %]``. Then it will be output it according to the date/time definition of the current locale.
hu: Először is az adatok a ``Data`` segítségével kerülnek beszúrásra az alkalmazásmodulból. Itt mindig egy ISO UTC időbéleget (2010-06-09 15:45:41) kell átadni adatként a ``[% Localize() %]`` függvénynek. Ezután lesz kiíratva a jelenlegi területi beállítás dátum és idő meghatározása szerint.
zh_cn: 首先，使用 ``Data`` 从应用程序模块插入数据。 这里始终必须将ISO UTC时间戳（2010-06-09 15:45:41）作为数据传递给 ``[% Localize() %]``。 然后根据当前语言环境的日期/时间定义输出它。

source: The data passed to ``[% Localize() %]`` must be UTC. If a time zone offset is specified for the current agent, it will be applied to the UTC timestamp before the output is generated.
hu: A ``[% Localize() %]`` függvénynek átadott adatoknak UTC formátumban kell lenniük. Ha időzóna-eltolás van meghatározva a jelenlegi ügyintézőnél, akkor az alkalmazva lesz az UTC időbélyegen a kimenet előállítása előtt.
zh_cn: 传递给 ``[% Localize() %]`` 的数据必须是UTC。 如果为当前服务人员指定了时区偏移量，则会在生成输出之前将其应用于UTC时间戳。

source: There are different possible date/time output formats: ``TimeLong`` (full date/time), ``TimeShort`` (no seconds) and ``Date`` (no time).
hu: Különböző lehetséges dátum és idő kimeneti formátumok léteznek: ``TimeLong`` (teljes dátum és idő), ``TimeShort`` (nincsenek másodpercek) és ``Date`` (nincs idő).
zh_cn: 有不同的日期/时间输出格式：``TimeLong`` （完整日期/时间）、``TimeShort`` （没有秒）和``Date``（没有时间）。

source: Also the output of human readable file sizes is available as an option ``Localize('Filesize')`` (just pass the raw file size in bytes).
hu: Ember által olvasható fájlméretek kimenete is elérhető lehetőségként ``Localize('Filesize')`` (egyszerűen adja át a nyers fájlméretet bájtokban).
zh_cn: 此外，人类可读文件大小的输出可用``Localize('Filesize')`` （只传递原始文件大小，以字节为单位）选项设置。

source: Replaces placeholders (``%s``) in strings with passed parameters.
hu: Kicseréli a helykitöltőket (``%s``) a szövegekben az átadott paraméterekre.
zh_cn: 用传递的参数替换字符串中的占位符（``％s``）。

source: In certain cases, you might want to insert HTML code in translations, instead of placeholders. On the other hand, you also need to take care of sanitization, since translated strings should not be trusted as-is. For this, you can first translate the string, pass it through the HTML filter and finally replace placeholders with static (safe) HTML code.
hu: Bizonyos esetekben érdemes lehet HTML kódot beszúrni a fordításokba a helykitöltők helyett. Másrészt viszont gondoskodnia kellfertőtlenítésről, mivel a lefordított szövegekben nem szabad megbízni úgy, ahogy vannak. Ehhez először fordítsa le a szöveget, küldje át a HTML szűrőn, és végül cserélje ki a helykitöltőket statikus (biztonságos) HTML kóddal.
zh_cn: 在某些情况下，您可能希望在翻译中插入HTML代码，而不是占位符。 另一方面，您还需要处理清理，因为翻译的字符串不应该被原样信任。 为此，您可以先转换字符串，将其传递给HTML过滤器，最后用静态（安全）HTML代码替换占位符。

source: Number of parameters to ``ReplacePlaceholders()`` filter should match number of placeholders in the original string.
hu: A ``ReplacePlaceholders()`` szűrőnek átadott paraméterek számának meg kell egyeznie az eredeti szövegben lévő helykitöltők számával.
zh_cn: ``ReplacePlaceholders()`` 过滤器的参数数量应与原始字符串中的占位符数相匹配。
