Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: The new XML structure allows us to create complex structures. Therefore we need ``DefaultItem`` entries to describe the structure of the array/hash. If it's not provided, system considers that you want simple array/hash with scalar values. ``DefaultItem`` is used as a template when adding new elements, so it can contain additional attributes, like ``ValueType``, and it can define default values.
hu: Az új XML szerkezet lehetővé teszi számunkra az összetett szerkezetek létrehozását. Ennélfogva szükségünk van alapértelmezett ``DefaultItem`` bejegyzésekre a tömb vagy kivonat szerkezetének leírásához. Ha ez nincs megadva, akkor a rendszer úgy tekinti, hogy egyszerű tömböt vagy kivonatot szeretne skalár értékekkel. A ``DefaultItem`` használható sablonként, amikor új elemeket adunk hozzá, így tartalmazhat további attribútumokat, mint például a ``ValueType``, és meghatározhat alapértelmezett értékeket.
zh_cn: 新的XML结构允许我们创建复杂的结构。 因此，我们需要 ``DefaultItem`` 条目来描述数组/哈希的结构。 如果未提供，系统会认为您需要具有标量值的简单数组/散列。 ``DefaultItem`` 在添加新元素时用作模板，因此它可以包含其它属性如 ``ValueType``，并且可以定义默认值。

source: Here are few examples:
hu: Itt van néhány példa:
zh_cn: 这里有些例子：

source: Array of Array with ``Select`` Items
hu: Tömb tömbje ``Select`` elemekkel
zh_cn: 带有 ``Select`` 项的嵌套数组

source: Hash of Hash with ``Date`` Items
hu: Kivonat kivonata ``Date`` elemekkel
zh_cn: 包含``Date`` 项的嵌套哈希

source: Accessing Config Options at Runtime
hu: Hozzáférés a beállítási lehetőségekhez futási időben
zh_cn: 在运行时访问配置选项

source: You can read and write (for one request) the config options via the core module ``Kernel::Config``.
hu: Olvashatja és írhatja (egy kérésnél) a beállítási lehetőségeket a ``Kernel::Config`` alapmodulon keresztül.
zh_cn: 您可以通过核心模块 ``Kernel::Config`` 读取和写入（一次请求）配置选项。

source: If you want to read a config option:
hu: Ha egy beállítási lehetőséget szeretne olvasni:
zh_cn: 如果要读取配置选项：

source: If you want to change a config option at runtime and just for this one request/process:
hu: Ha meg szeretne változtatni egy beállítási lehetőséget futási időben, és csak ennél az egy kérésnél/folyamatnál:
zh_cn: 如果要在运行时更改配置选项，只需一个请求/进程：

source: Database Mechanism
hu: Adatbázis mechanizmus
zh_cn: 数据库机制

source: OTRS comes with a database layer that supports different databases.
hu: Az OTRS olyan adatbázis réteggel érkezik, amely különböző adatbázisokat támogat.
zh_cn: OTRS附带了一个支持不同数据库的数据库层。

source: The database layer ``Kernel::System::DB`` has two input options: *SQL* and *XML*.
hu: Az adatbázis rétegnek (``Kernel::System::DB``) két bemeneti lehetősége van: *SQL* és *XML*.
zh_cn: 数据库层 ``Kernel::System::DB`` 有两个输入选项：*SQL* 和 *XML*。

source: The SQL interface should be used for normal database actions (``SELECT``, ``INSERT``, ``UPDATE``, etc.). It can be used like a normal Perl DBI interface.
hu: Az SQL felületet kell használni a normál adatbázis-műveleteknél (``SELECT``, ``INSERT``, ``UPDATE``, stb.). Úgy használható mint egy normál Perl DBI felület.
zh_cn: SQL接口应该用于正常的数据库操作（``SELECT``、``INSERT``、``UPDATE`` 等）。 它可以像普通的Perl DBI接口一样使用。

source: INSERT/UPDATE/DELETE statements
hu: INSERT/UPDATE/DELETE utasítások
zh_cn: INSERT/UPDATE/DELETE 语句

source: SELECT statement
hu: SELECT utasítás
zh_cn: SELECT 语句

source: Take care to use ``Limit`` as param and not in the SQL string because not all databases support ``LIMIT`` in SQL strings.
hu: Vigyázzon arra, hogy a ``Limit`` megadását paraméterként használja, és ne az SQL karakterláncban, mert nem minden adatbázis támogatja a ``LIMIT`` kulcsszót az SQL karakterláncokban.
zh_cn: 注意使用 ``Limit`` 作为参数而不是SQL字符串，因为并非所有数据库都支持SQL字符串中的 ``LIMIT``。

source: Use the ``Bind`` attribute where ever you can, especially for long statements. If you use ``Bind`` you do not need the function ``Quote()``.
hu: Használja a ``Bind`` attribútumot, ahol csak tudja, különösen a hosszú utasításoknál. Ha a ``Bind`` attribútumot használja, akkor nincs szükség a ``Quote()`` függvényre.
zh_cn: 尽可能使用 ``Bind`` 属性，特别是对于长语句。 如果使用 ``Bind``，则不需要 ``Quote()`` 函数。

source: String:
hu: Szöveg:
zh_cn: String（字符串）：

source: Integer:
hu: Egész:
zh_cn: Integer（整数）：

source: Number:
hu: Szám:
zh_cn: Number（数字）：

source: Please use the ``Bind`` attribute instead of ``Quote()`` where ever you can.
hu: A ``Bind`` attribútumot használja a ``Quote()`` függvény helyett, ahol csak tudja.
zh_cn: 请尽可能使用 ``Bind`` 属性而不是 ``Quote()`` 。

source: The XML interface should be used for ``INSERT``, ``CREATE TABLE``, ``DROP TABLE`` and ``ALTER TABLE``. As this syntax is different from database to database, using it makes sure that you write applications that can be used in all of them.
hu: Az XML felületet kell használni ``INSERT``, ``CREATE TABLE``, ``DROP TABLE`` és ``ALTER TABLE`` utasításoknál. Mivel ez a szintaxis adatbázisról adatbázisra eltérő, ezért ennek használata gondoskodik arról, hogy olyan alkalmazásokat írjon, amelyek az összesnél használhatók.
zh_cn: XML接口应该用于 ``INSERT``、``CREATE TABLE``、``DROP TABLE`` 和 ``ALTER TABLE``。 由于此语法在数据库与数据库之间不同，因此使用它可确保编写可在所有这些数据库中使用的应用程序。

source: Possible data types are: ``BIGINT``, ``SMALLINT``, ``INTEGER``, ``VARCHAR`` (Size=1-1000000), ``DATE`` (format: yyyy-mm-dd hh:mm:ss) and ``LONGBLOB``.
hu: A lehetséges adattípusok a következők: ``BIGINT``, ``SMALLINT``, ``INTEGER``, ``VARCHAR`` (méret = 1-1000000), ``DATE`` (formátum: yyyy-mm-dd hh:mm:ss) és ``LONGBLOB``.
zh_cn: 可能的数据类型有：``BIGINT``、``SMALLINT``、``INTEGER``、``VARCHAR`` （长度为 1-1000000），``DATE`` （格式：yyyy-mm-dd hh:mm:ss）和 ``LONGBLOB``。

source: ``LONGBLOB`` columns need special treatment. Their content needs to be base64 transcoded if the database driver does not support the feature ``DirectBlob``. Please see the following example:
hu: A ``LONGBLOB`` oszlopok különleges bánásmódot igényelnek. A tartalmukat base64-re kell átkódolni, ha az adatbázis-meghajtó nem támogatja a ``DirectBlob`` funkciót. Nézze meg a következő példát:
zh_cn: ``LONGBLOB`` 列需要特殊处理。 如果数据库驱动程序不支持 ``DirectBlob`` 功能，则它们的内容需要进行base64转码。 请参阅以下示例：

source: Similarly, when reading from such a column, the content must not automatically be decoded as UTF-8 by passing the ``Encode => 0`` flag to ``Prepare()``:
hu: Hasonlóan, amikor egy ilyen oszlopból olvas, akkor a tartalmat tilos automatikusan UTF-8-ként visszaalakítani az ``Encode => 0`` jelző átadásával a ``Prepare()`` függvénynek:
zh_cn: 类似地，当从这样的列读取时，通过将 ``Encode => 0`` 标志传递给 ``Prepare()``，内容不能自动解码为UTF-8：

source: The following shows an example of add, change and drop columns.
hu: A következő az oszlopok hozzáadásának, megváltoztatásának és eldobásának példáját jeleníti meg.
zh_cn: 以下显示了添加、更改和删除列的示例。

source: The next shows an example how to rename a table.
hu: A következő egy olyan példát jelenít meg, hogy hogyan nevezhető át egy tábla.
zh_cn: 下一个示例显示了如何重命名一个表。

source: Code to Process XML
hu: Kód az XML feldolgozásához
zh_cn: 处理XML的代码

source: Database Drivers
hu: Adatbázis-meghajtók
zh_cn: 数据库驱动程序

source: The database drivers are located under ``$OTRS_HOME/Kernel/System/DB/*.pm``.
hu: Az adatbázis-meghajtók az ``$OTRS_HOME/Kernel/System/DB/*.pm`` alatt találhatók.
zh_cn: 数据库驱动程序位于 ``$OTRS_HOME/Kernel/System/DB/*.pm`` 下。

source: Supported Databases
hu: Támogatott adatbázisok
zh_cn: 支持的数据库

source: Microsoft SQL Server (only for external database connections, not as OTRS database)
hu: Microsoft SQL Server (csak külső adatbázis-kapcsolatokhoz, nem OTRS adatbázisként)
zh_cn: Microsoft SQL Server (仅用于外部数据库连接，而不是OTRS数据库)

source: Date and Time
hu: Dátum és idő
zh_cn: 日期和时间

source: OTRS comes with its own package to handle date and time which ensures correct calculation and storage of date and time.
hu: Az OTRS saját csomaggal érkezik a dátum és idő kezeléséhez, amely a dátum és idő helyes kiszámítását és tárolását biztosítja.
zh_cn: OTRS自带软件包来处理日期和时间，确保正确计算和存储日期和时间。

source: Introduction
hu: Bevezetés
zh_cn: 介绍

source: Date and time are represented by an object of ``Kernel::System::DateTime``. Every ``DateTime`` object holds its own date, time and time zone information. In contrast to the now deprecated ``Kernel::System::Time`` package, this means that you can and should create a ``DateTime`` object for every date/time you want to use.
hu: A dátum és idő egy ``Kernel::System::DateTime`` objektummal van ábrázolva. Minden ``DateTime`` objektum tartalmazza a saját dátumát, idejét és időzóna információját. A mostanra elavult ``Kernel::System::Time`` csomaggal szemben ez azt jelenti, hogy létrehozhat és létre kell hoznia egy ``DateTime`` objektumot minden egyes dátumhoz vagy időhöz, amelyet használni szeretne.
zh_cn: 日期和时间由一个 ``Kernel::System::DateTime`` 的对象表示。 每个 ``DateTime`` 对象都有自己的日期、时间和时区信息。 与现在已弃用的 ``Kernel::System::Time`` 包相比，这意味着你可以而且应该为你想要使用的每个日期/时间创建一个 ``DateTime`` 对象。

source: Creation of a ``DateTime`` Object
hu: Egy ``DateTime`` objektum létrehozása
zh_cn: 创建一个 ``DateTime`` 对象

source: The object manager of OTRS has been extended by a ``Create`` method to support packages for which more than one instance can be created:
hu: Az OTRS objektumkezelője kibővítésre került egy ``Create`` metódussal, hogy támogassa azokat a csomagokat, amelyekhez egynél több példány hozható létre:
zh_cn: OTRS的对象管理器已经通过 ``Create`` 方法进行了扩展，以支持可以为其创建多个实例的软件包：

source: The example above will create a ``DateTime`` object for the current date and time in time zone *Europe/Berlin*. There are more options to create a ``DateTime`` object (time components, string, timestamp, cloning), see POD of ``Kernel::System::DateTime``.
hu: A fenti példa létrehoz egy ``DateTime`` objektumot a jelenlegi dátumhoz és időhöz az *Európa/Berlin* időzónában. További lehetőségek is vannak egy ``DateTime`` objektum létrehozására (időösszetevők, szövegek, időbélyegek, klónozás), nézze meg a ``Kernel::System::DateTime`` POD-ját.
zh_cn: 上面的例子将为 *Europe/Berlin* 时区的当前日期和时间创建一个 ``DateTime`` 对象。 有更多选项来创建 ``DateTime`` 对象（时间组件、字符串、时间戳、克隆），请参阅 ``Kernel::System::DateTime`` 的POD（Perl在线文档）。

source: You will get an error if you try to retrieve a ``DateTime`` object via ``$Kernel::OM->Get('Kernel::System::DateTime')``.
hu: Hibát fog kapni, ha megpróbál egy ``DateTime`` objektumot lekérni a ``$Kernel::OM->Get('Kernel::System::DateTime')`` használatával.
zh_cn: 如果您尝试通过 ``$Kernel::OM->Get('Kernel::System::DateTime')`` 取回一个 ``DateTime`` 对象，将会出错。

source: Time Zones
hu: Időzónák
zh_cn: 时区

source: Time offsets in hours (+2, -10, etc.) have been replaced by time zones (Europe/Berlin, America/New_York, etc.). The conversion between time zones is completely encapsulated within a ``DateTime`` object. If you want to convert to another time zone, simply use the following code:
hu: Az órákban lévő időeltolások (+2, -10, stb.) le lettek cserélve az időzónákkal (Európa/Berlin, Amerika/New_York, stb.). Az időzónák közti átalakítások teljes mértékben a ``DateTime`` objektumon belül vannak megvalósítva. Ha egy másik időzónára szeretne átalakítani, akkor egyszerűen használja a következő kódot:
zh_cn: 以小时（+ 2，-10等）为单位的时间偏移已被时区（Europe/Berlin、 America/New_York等）取代。 时区之间的转换完全封装在 ``DateTime`` 对象中。 如果要转换为其它时区，只需使用以下代码：

source: There is a system configuration option ``OTRSTimeZone``. This setting defines the time zone that OTRS uses internally to store date and time within the database.
hu: Van egy új ``OTRSTimeZone`` rendszerbeállítási lehetőség. Ez a beállítás határozza meg azt az időzónát, amelyet az OTRS belsőleg használ a dátum és az idő tárolásához az adatbázison belül.
zh_cn: 有一个系统配置选项 ``OTRSTimeZone``。 此设置定义OTRS内部用于在数据库中存储日期和时间的时区。

source: You have to ensure to convert a ``DateTime`` object to the OTRS time zone before it gets stored in the database (there's a convenient method for this: ``ToOTRSTimeZone()``). An exception could be that you explicitly want a database column to hold a date/time in a specific time zone. But be aware that the database itself won't provide time zone information by itself when retrieving it.
hu: Biztosítania kell, hogy egy ``DateTime`` objektum át legyen alakítva az OTRS időzónájára, mielőtt az eltárolásra kerülne az adatbázisba (van egy kényelmes módszer erre: ``ToOTRSTimeZone()``). Kivétel lehet, hogy ha kifejezetten egy olyan adatbázisoszlopot szeretne, amely egy dátum/idő értéket tárol egy bizonyos időzónában. Ne feledje azonban, hogy maga az adatbázis önmagában nem fog időzóna-információkat biztosítani, amikor lekérik azt.
zh_cn: 你必须确保将 ``DateTime`` 对象转换为OTRS时区，然后才能将它存储到数据库中（有一种方便的方法： ``ToOTRSTimeZone()``）。 例外情况可能是您明确希望数据库列在特定时区中保存日期/时间。 但请注意，数据库本身在检索时不会自行提供时区信息。

source: ``TimeZoneList()`` of ``Kernel::System::DateTime`` provides a list of available time zones.
hu: A ``Kernel::System::DateTime`` ``TimeZoneList()`` metódusa biztosítja az elérhető időzónák listáját.
zh_cn: ``Kernel::System::DateTime`` 的 ``TimeZoneList()`` 提供了一个可用的时区列表。

source: Method Summary
hu: Metódus összefoglaló
zh_cn: 方法摘要

source: The ``Kernel::System::DateTime`` package provides the following methods (this is only a selection, see source code for details).
hu: A ``Kernel::System::DateTime`` csomag biztosítja a következő metódusokat (ez csak egy kiválasztás, a részletekért nézze meg a forráskódot).
zh_cn: ``Kernel::System::DateTime`` 包提供了以下方法（这只是一个选择，详见源代码）。

source: Object Creation Methods
hu: Objektumlétrehozási metódusok
zh_cn: 对象创建方法

source: A ``DateTime`` object can be created either via the object manager's ``Create()`` method or by cloning another ``DateTime`` object with its ``Clone()`` method.
hu: Egy ``DateTime`` objektum létrehozható az objektumkezelő ``Create()`` metódusával vagy egy másik ``DateTime`` objektum leklónozásával a ``Clone()`` metódusának használatával.
zh_cn: 可以通过对象管理器的 ``Create()`` 方法创建 ``DateTime`` 对象，或者用 ``Clone()`` 方法克隆另一个 ``DateTime`` 对象。

source: Get Method
hu: Lekérő metódus
zh_cn: Get方法

source: With ``Get()`` all data of a ``DateTime`` object will be returned as a hash (date and time components including day name, etc. as well as time zone).
hu: A ``Get()`` metódussal egy ``DateTime`` objektum összes adata vissza lesz adva kivonatként (dátum és idő összetevők, beleértve a nap nevét, stb., valamint az időzónát).
zh_cn: 使用 ``Get()``，``DateTime`` 对象的所有数据都将作为哈希返回（日期和时间组件包括日期名称等，以及时区）。

source: Set Method
hu: Beállító metódus
zh_cn: Set方法

source: With ``Set()`` you can either change certain components of the ``DateTime`` object (year, month, day, hour, minute, second) or you can set a date and time based on a given string (*2016-05-24 23:04:12*). Note that you cannot change the time zone with this method.
hu: A ``Set()`` metódussal megváltoztathatja a ``DateTime`` objektum bizonyos összetevőit (év, hónap, nap, óra, perc, másodperc) vagy beállíthat egy dátumot és időt egy adott szöveg alapján (*2016-05-24 23:04:12*). Ne feledje, hogy nem tudja megváltoztatni az időzónát ezzel a metódussal.
zh_cn: 使用 ``Set()``，您可以更改 ``DateTime`` 对象的某些组件（年、月、日、小时、分钟、秒），也可以根据给定的字符串设置日期和时间（*2016-05-24 23:04:12*）。 请注意，您无法使用此方法更改时区。

source: Time Zone Methods
hu: Időzóna metódusok
zh_cn: 时区方法

source: To change the time zone of a ``DateTime`` object use method ``ToTimeZone()`` or as a shortcut for converting to OTRS time zone ``ToOTRSTimeZone()``.
hu: Egy ``DateTime`` objektum időzónájának megváltoztatásához használja a ``ToTimeZone()`` metódust vagy egyszerűsítésként a ``ToOTRSTimeZone()`` metódust az OTRS időzóna átalakításához.
zh_cn: 要更改 ``DateTime`` 对象的时区，请使用 ``ToOTRSTimeZone()`` 方法或作为转换为OTRS时区 ``ToOTRSTimeZone()`` 的快捷方式。

source: To retrieve the configured OTRS time zone or user default time zone, always use method ``OTRSTimeZoneGet()`` or ``UserDefaultTimeZoneGet()``. Never retrieve these manually via ``Kernel::Config``.
hu: A beállított OTRS időzóna vagy a felhasználó alapértelmezett időzónájának lekéréséhez mindig az ``OTRSTimeZoneGet()`` vagy a ``UserDefaultTimeZoneGet()`` metódusokat használja. Sose kérje le ezeket kézzel a ``Kernel::Config`` használatával.
zh_cn: 要检索配置的OTRS时区或用户默认时区，请始终使用方法 ``OTRSTimeZoneGet()`` 或 ``UserDefaultTimeZoneGet()`` 。 永远不要通过 ``Kernel::Config`` 手动检索它们。

source: Comparison Operators And Methods
hu: Összehasonlító operátorok és metódusok
zh_cn: 比较操作符和方法

source: ``Kernel::System::DateTime`` uses operator overloading for comparisons. So you can simply compare two ``DateTime`` objects with <, <=, ==, !=, >= and >. ``Compare()`` is usable in Perl's sort context as it returns -1, 0 or 1.
hu: A ``Kernel::System::DateTime`` operátortúlterhelést használ az összehasonlításhoz. Így egyszerűen összehasonlíthat két ``DateTime`` objektumot a <, <=, ==, !=, >= és > operátorokkal. A ``Compare()`` metódus használható a Perl rendezési környezetében, mivel -1, 0 vagy 1 a visszatérési értéke.
zh_cn: ``Kernel::System::DateTime`` 使用运算符重载进行比较。 所以你可以简单地将两个 ``DateTime`` 对象与<、<=、==、！=、> =和>进行比较。 ``Compare()`` 在Perl的排序上下文中可用，因为它返回-1、0或1。

source: Deprecated Package ``Kernel::System::Time``
hu: Elavult ``Kernel::System::Time`` csomag
zh_cn: 弃用的包 ``Kernel::System::Time``

source: The now deprecated package ``Kernel::System::Time`` has been extended to fully support time zones instead of time offsets. This has been done to ensure that existing code works without (bigger) changes.
hu: A mostanra elavult ``Kernel::System::Time`` csomag ki lett bővítve, hogy teljesen támogassa az időzónákat az időeltolások helyett. Ez azért történt, hogy biztosítsa a meglévő kód működését (nagyobb) módosítások nélkül.
zh_cn: 现已弃用的包 ``Kernel::System::Time`` 已经扩展到完全支持时区而不是时间偏移。 这样做是为了确保现有代码在没有（更大）更改的情况下工作。

source: However, there is a case in which you have to change existing code. If you have code that uses the old time offsets to calculate a new date/time or a difference, you have to migrate this code to use the new ``DateTime`` object.
hu: Azonban van egy eset, amikor meg kell változtatnia a meglévő kódot. Ha olyan kódja van, amely a régi időeltolásokat használja egy új dátum és idő kiszámításához vagy különbségéhez, akkor át kell költöztetnie ezt a kódot, hogy az új ``DateTime`` objektumot használja.
zh_cn: 但是，有一种情况需要更改现有代码。 如果您有使用旧时偏移量来计算新日期/时间或差异的代码，则必须迁移此代码以使用新的 ``DateTime`` 对象。

source: Example (old code):
hu: Példa (régi kód):
zh_cn: 示例（旧代码）：

source: Example (new code):
hu: Példa (új kód):
zh_cn: 示例（新代码）：

source: The CSS and JavaScript Loader
hu: A CSS és JavaScript betöltő
zh_cn: CSS和JavaScript加载器

source: The CSS and JavaScript code in OTRS grew to a large amount. To be able to satisfy both development concerns (good maintainability by a large number of separate files) and performance issues (making few HTTP requests and serving minified content without unnecessary whitespace and documentation) had to be addressed. To achieve these goals, the loader was invented.
hu: Az OTRS-ben lévő CSS és JavaScript kód hatalmas mennyiségre nőtt. Hogy képes legyen kielégíteni mind a fejlesztői szempontokat (jó karbantarthatóság különálló fájlok nagy mennyiségével), mind a teljesítmény problémákat (kevés HTTP-kérés megtétele és minimalizált tartalom kiszolgálása felesleges üres karakterek és dokumentáció nélkül), foglalkozni kellett ezzel. A célok eléréséhez kitalálták a betöltőt.
zh_cn: OTRS中的CSS和JavaScript代码增长很多。 必须解决能够满足开发问题（大量单独文件的良好可维护性）和性能问题（少量HTTP请求和提供缩小内容而没有不必要的空白和文档）的问题。 为了实现这些目标，发明了装载机。

source: How it works
hu: Hogyan működik
zh_cn: 它如何运作

source: To put it simple, the loader:
hu: Leegyszerűsítve, a betöltő:
zh_cn: 简单来说，加载器：

source: determines for each request precisely which CSS and JavaScript files are needed at the client side by the current application module
hu: minden egyes kérésnél pontosan meghatározza, hogy mely CSS és JavaScript fájlok szükségesek a kliens oldalhoz a jelenlegi alkalmazásmodulnál
zh_cn: 为每个请求确定当前应用程序模块在客户端需要哪些CSS和JavaScript文件

source: collects all the relevant data
hu: összegyűjti az összes ide vonatkozó adatot
zh_cn: 收集所有相关数据

source: minifies the data, removing unnecessary whitespace and documentation
hu: minimalizálja az adatokat a felesleges üres karakterek és dokumentáció eltávolításával
zh_cn: 删除不必要的空格和文档来缩小数据

source: serves it to the client in only a few HTTP requests instead of many individual ones, allowing the client to cache these snippets in the browser cache
hu: kiszolgálja a kliens oldalnak mindössze néhány HTTP-kérésben a sok egyedüli helyett, lehetővé téve a kliensnek, hogy a gyorstárazza ezeket a töredékeket a böngésző gyorsítótárába
zh_cn: 仅在少数HTTP请求中为客户端提供服务而不是许多单独的HTTP请求，允许客户端将这些片段缓存在浏览器缓存中

source: performs these tasks in a highly performing way, utilizing the caching mechanisms of OTRS
hu: végrehajtja ezeket a feladatokat egy jól teljesítő módon az OTRS gyorsítótárazó mechanizmusait használva
zh_cn: 利用OTRS的缓存机制，以高性能的方式执行这些任务

source: Of course, there is a little bit more detailed involved, but this should suffice as a first overview.
hu: Természetesen van egy kicsivel részletesebb magyarázat is, de ennek elegendőnek kell lennie első áttekintésként.
zh_cn: 当然，还有一些更详细的内容，但这应该足以作为首次概览。

source: Basic Operation
hu: Alapvető működés
zh_cn: 基本操作

source: With the configuration settings ``Loader::Enabled::CSS`` and ``Loader::Enabled::JavaScript``, the loader can be turned on and off for CSS and JavaScript, respectively (it is on by default).
hu: A ``Loader::Enabled::CSS`` és a ``Loader::Enabled::JavaScript`` konfigurációs beállításokkal kapcsolható be és ki a betöltő a CSS-t és a JavaScriptet illetőleg (alapértelmezetten be van kapcsolva).
zh_cn: 使用配置设置 ``Loader::Enabled::CSS`` 和 ``Loader::Enabled::JavaScript``，可以分别为CSS和JavaScript打开和关闭加载器（默认情况下它处于启用状态）。

source: Because of rendering problems in Internet Explorer, the loader cannot be turned off for CSS files for this client browser (config setting will be overridden). Up to version 8, Internet Explorer cannot handle more than 32 CSS files on a page.
hu: Az Internet Explorer böngészőben lévő megjelenítési problémák miatt a betöltőt nem lehet kikapcsolni a CSS-fájlokhoz ennél a kliens böngészőnél (a konfigurációs beállítás felül lesz bírálva). A 8-as verzióig az Internet Explorer nem tud 32 CSS-fájlnál többet kezelni egy oldalon.
zh_cn: 由于Internet Explorer中的渲染问题，无法为此客户端浏览器的CSS文件关闭加载器（将覆盖配置设置）。 Internet Explorer 8之前均无法处理超过32个CSS文件的页面。

source: To learn about how the loader works, please turn it off in your OTRS installation with the aforementioned configuration settings. Now look at the source code of the application module that you are currently using in this OTRS system (after a reload, of course). You will see that there are many CSS files loaded in the ``<head>`` section of the page, and many JavaScript files at the bottom of the page, just before the closing ``</body>`` element.
hu: Ha többet szeretne megtudni arról, hogy a betöltő hogyan működik, akkor kapcsolja ki az OTRS telepítésében a fent említett konfigurációs beállításokkal. Most nézze meg annak az alkalmazásmodulnak a forráskódját, amelyet jelenleg használ ezen az OTRS rendszeren (természetesen egy újratöltés után). Látni fogja, hogy számos CSS-fájl töltődött be az oldal ``<head>`` szakaszában, és sok JavaScript fájl van az oldal alján közvetlenül a lezáró ``</body>`` elem előtt.
zh_cn: 要了解加载器的工作原理，请使用上述配置设置在OTRS安装中将其关闭。 现在查看您当前在此OTRS系统中使用的应用程序模块的源代码（当然，在重新加载之后）。 您将看到页面的 ``<head>`` 部分中加载了许多CSS文件，页面底部有许多JavaScript文件，就在闭合 ``</body>`` 元素之前。

source: Having the content like this in many individual files with a readable formatting makes the development much easier, and even possible at all. However, this has the disadvantage of a large number of HTTP requests (network latency has a big effect) and unnecessary content (whitespace and documentation) which needs to be transferred to the client.
hu: Ehhez hasonlóan számos egyedülálló fájlban lévő olvashatóan formázott tartalom megléte sokkal egyszerűbbé teszi a fejlesztést, és akár egyáltalán lehetségessé téve azt. Azonban ennek megvan az a hátránya, hogy nagyszámú TTP-kérést (a hálózati késleltetésnek nagy hatása van) és felesleges tartalmakat (üres karaktereket és dokumentációt) szükséges átvinni a kliensnek.
zh_cn: 在具有可读格式的许多单个文件中具有这样的内容使得开发更容易，甚至可能。 但是，这具有大量HTTP请求（网络延迟具有很大影响）和需要传输到客户端的不必要内容（空白和说明文档）的缺点。
