Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: The existing customer (``customer.pl``) and public (``public.pl``) interfaces were replaced by a new REST backend (``Kernel/WebApp``) and a modern Vue.js based front end application. This means that all related code has to be ported and/or rewritten.
hu: A meglévő ügyfél (``customer.pl``) és nyilvános (``public.pl``) felületeket leváltotta egy új REST háttérprogram (``Kernel/WebApp``) és egy modern Vue.js alapú előtétprogram alkalmazás. Ez azt jelenti, hogy az összes ehhez kapcsolódó kódot át kell írni és/vagy újra kell írni.
zh_cn: 现有的客户（``customer.pl``）和公共（``public.pl``）界面被新的REST后端（``Kernel/WebApp``）和现代的基于Vue.js的前端应用程序所取代。 这意味着必须移植和/或重写所有相关代码。

source: There is one special case for public front end modules that don't serve an HTML application. These can be ported rather easily to the new REST back end (see also `the REST API docs <https://doc.otrs.com/doc/api/otrs/7.0/REST/>`__). See for example ``Kernel/WebApp/Controller/API/Public/Package/Repository.pm``. This example also shows how endpoints can support both new REST-like URLs and the legacy URLs based on the ``/otrs/customer.pl?Action=MyAction`` routes at the same time.
hu: Van egy különleges eset a nyilvános előtétprogram-moduloknál, amely nem szolgál ki HTML alkalmazást. Ezt viszonylag könnyen át lehet írni az új REST háttérprogramra (nézze meg a `REST API dokumentációját <https://doc.otrs.com/doc/api/otrs/7.0/REST/>`__). Nézze meg például a ``Kernel/WebApp/Controller/API/Public/Package/Repository.pm`` fájlt. Ez a példa azt is bemutatja, hogy a végpontok hogyan támogathatják mindkét új REST-szerű URL-t, de ugyanakkor az örökölt ``/otrs/customer.pl?Action=MyAction`` alapú URL útvonalakat is.
zh_cn: 对于不提供HTML应用程序的公共前端模块，有一种特殊情况。 这些可以很容易地移植到新的REST后端（另请参阅 `REST API文档 <https://doc.otrs.com/doc/api/otrs/7.0/REST/>`__）。 例如，参见 ``Kernel/WebApp/Controller/API/Public/Package/Repository.pm``。 此示例还显示了端点如何同时支持新的REST类URL和基于 ``/otrs/customer.pl?Action=MyAction`` 路由的旧URL。

source: For some important URLs in the customer interface that are linked from legacy systems, redirect controllers may need to be provided to make sure the old URLs keep working.
hu: Az ügyfélfelületen lévő néhány fontos URL-hez, amelyek örökölt rendszerekből vannak hivatkozva, átirányítási vezérlőket kellene létrehozni annak biztosításához, hogy a régi URL-ek továbbra is működjenek.
zh_cn: 对于从旧系统链接的客户界面中的一些重要URL，可能需要提供重定向控制器以确保旧URL继续工作。

source: Changes in Process Management
hu: Változtatások a folyamatkezelésben
zh_cn: 流程管理中的更改

source: The migration script ``scripts/DBUpdate-to-7.pl`` will upgrade all processes that are already in the database. Manual action is only needed to make use of any new features that OTRS 7 provides.
hu: A ``scripts/DBUpdate-to-7.pl`` költöztető parancsfájl frissíteni fogja az összes folyamatot, amelyek már az adatbázisban vannak. Kézi művelet csak akkor szükséges, ha használni szeretne valamilyen új funkciót, amelyet az OTRS 7 nyújt.
zh_cn: 迁移脚本 ``scripts/DBUpdate-to-7.pl`` 将升级数据库中已有的所有流程。 只有使用OTRS 7提供的任何新功能才需要手动操作。

source: New Activity Types
hu: Új tevékenységtípusok
zh_cn: 新的活动类型

source: Since OTRS 7 is capable of managing more activity types, all existing activities now become *User Task* activities. To update a task definition on a YAML file, please add ``Type: UserTask`` with the same indentation as ``Name`` or ``ID``.
hu: Mivel az OTRS 7 több tevékenységtípust képes kezelni, az összes meglévő tevékenység mostantól *felhasználói feladat* tevékenységgé vált. Egy feladatmeghatározás frissítéséhez a YAML-fájlban adja hozzá a ``Type: UserTask`` bejegyzést ugyanolyan behúzással, mint amilyen a ``Name`` vagy ``ID`` sornak van.
zh_cn: 由于OTRS 7能够管理更多活动类型，因此所有现有活动现在都成为*用户任务*活动。 要更新YAML文件上的任务定义，请添加 ``Type: UserTask``，其缩写与 ``Name`` 或 ``ID`` 相同。

source: Renamed Process Management Components
hu: Átnevezett folyamatkezelés összetevők
zh_cn: 重命名流程管理组件

source: ``Transition`` to ``SequenceFlow``
hu: ``Transition`` átnevezve erre: ``SequenceFlow``
zh_cn: ``Transition（转换）`` 变为 ``SequenceFlow（序列流）``

source: This process component was renamed to be more aligned with BPMN. Files, classes and methods has been renamed accordingly. Customized files needs to be updated following the new conventions.
hu: Ezt a folyamatösszetevőt azért nevezték át, hogy jobban igazodjon a BPMN-hez. A fájlokat, osztályokat és metódusokat is eszerint nevezték át. A személyre szabott fájlokat frissíteni kell az új egyezmény követéséhez.
zh_cn: 此流程组件已重命名为与BPMN更加一致。 相应地重命名了文件、类和方法。 需要根据新约定更新自定义文件。

source: ``TransitionAction`` to ``SequenceFlowAction``
hu: ``TransitionAction`` átnevezve erre: ``SequenceFlowAction``
zh_cn: ``TransitionAction（转换操作）`` 变为 ``SequenceFlowAction（序列流操作）``

source: This process component does not exists in BPMN but has to be also renamed to be consistent with the other changes. Files, classes and methods has been renamed accordingly. Customized files needs to be updated following the new conventions.
hu: Ezt a folyamatösszetevő nem létezik a BPMN-ben, de ezt is át kell nevezni, hogy következetes legyen az egyéb változtatásokkal. A fájlokat, osztályokat és metódusokat is eszerint nevezték át. A személyre szabott fájlokat frissíteni kell az új egyezmény követéséhez.
zh_cn: 此流程组件在BPMN中不存在，但也必须重命名为与其他更改一致。 相应地重命名了文件、类和方法。 需要根据新约定更新自定义文件。

source: ``TransitionActionModules`` to ``ProcessManagementModules``
hu: ``TransitionActionModules`` átnevezve erre: ``ProcessManagementModules``
zh_cn: ``TransitionActionModules（转换操作模块）`` 变为 ``ProcessManagementModules（流程管理模块）``

source: These process components are not only used by *Sequence Flow Actions* but also for *Script Tasks* activities and has been moved from ``Kernel/System/ProcessManagement/TransitionAction`` to ``Kernel/System/ProcessManagement/Modules``.
hu: Ezeket a folyamatösszetevőket nem csak a *szekvenciafolyam-műveletek* használják, hanem a *vezérelt feladatok* tevékenységei is, és át lettek helyezve a ``Kernel/System/ProcessManagement/TransitionAction`` mappából a ``Kernel/System/ProcessManagement/Modules`` mappába.
zh_cn: 这些流程组件不仅用于 *序列流操作*，还用于 *脚本任务* 活动，并且已经从 ``Kernel/System/ProcessManagement/TransitionAction`` 转移到 ``Kernel/System/ProcessManagement/Modules``。

source: The new process management modules can offer more field types and options to present the parameters to the process designer. Please follow the instructions in the :doc:`../how-to-extend-otrs/otrs-module-layers/process-management-modules` documentation to learn more about this new feature and how to improve existing modules.
hu: Az új folyamatkezelés-modulok több mezőtípust és lehetőséget nyújtanak a paraméterek megjelenítéshez a folyamattervező számára. Kövesse a :doc:`../how-to-extend-otrs/otrs-module-layers/process-management-modules` dokumentációban leírt utasításokat, hogy többet tudjon meg erről az új funkcióról, és hogy a meglévő modulokat hogyan lehet továbbfejleszteni.
zh_cn: 新的流程管理模块可以提供更多的字段类型和选项，以向流程设计者提供参数。 请按照 :doc:`../how-to-extend-otrs/otrs-module-layers/process-management-modules` 文档中的说明进行操作，以了解有关此新功能以及如何改进现有模块的更多信息。

source: It is needed to update any shipped process definitions to use the new name schema.
hu: Az összes szállított folyamatmeghatározást frissíteni kell az új névséma használatához.
zh_cn: 需要更新任何已发布的流程定义以使用新的名称方案。

source: Replace ``Transition`` with ``SequenceFlow``.
hu: ``Transition`` cseréje erre: ``SequenceFlow``.
zh_cn: 用 ``SequenceFlow`` 替换 ``Transition``。

source: Replace ``Transitions`` with ``SequenceFlows``.
hu: ``Transitions`` cseréje erre: ``SequenceFlows``.
zh_cn: 用 ``SequenceFlows`` 替换 ``Transitions``。

source: Replace ``TransitionAction`` with ``SequenceFlowAction``.
hu: ``TransitionAction`` cseréje erre: ``SequenceFlowAction``.
zh_cn: 用 ``SequenceFlowAction`` 替换 ``TransitionAction`` 。

source: Replace ``TransitionActions`` with ``SequenceFlowActions``.
hu: ``TransitionActions`` cseréje erre: ``SequenceFlowActions``.
zh_cn: 用 ``SequenceFlowActions`` 替换 ``TransitionActions`` 。

source: Remove ``Kernel::System::ProcessManagement::TransitionAction`` from the ``Module:`` on all ``SequenceFlowAction``. For example: ``Module: Kernel::System::ProcessManagement::TransitionAction::TicketLockSet`` should become ``Module: TicketLockSet``.
hu: A ``Kernel::System::ProcessManagement::TransitionAction`` eltávolítása a ``Module:`` szakaszból az összes ``SequenceFlowAction`` esetén. Például a ``Module: Kernel::System::ProcessManagement::TransitionAction::TicketLockSet`` a következő legyen: ``Module: TicketLockSet``.
zh_cn: 从所有 ``SequenceFlowAction`` 上的 ``Module:`` 中删除 ``Kernel::System::ProcessManagement::TransitionAction`` 。 例如： ``Module: Kernel::System::ProcessManagement::TransitionAction::TicketLockSet`` 应该变成 ``Module: TicketLockSet`` 。

source: Changes in the ``LayoutObject``
hu: Változtatások a ``LayoutObject`` objektumban
zh_cn: ``LayoutObject`` 中的变化

source: There are changes in ``Kernel/Output/HTML/Layout.pm`` which are necessary to properly render content using Mojolicious real-time web framework.
hu: Változtatások történtek a ``Kernel/Output/HTML/Layout.pm`` fájlban, amelyek ahhoz szükségesek, hogy a tartalom megfelelően jelenjen meg a Mojolicious valós idejű webes keretrendszer használatával.
zh_cn: ``Kernel/Output/HTML/Layout.pm`` 中有一些变化，这些变化是使用Mojolicious实时Web框架正确渲染内容所必需的。

source: Not Shown/Empty Tables in Screens
hu: Nem megjelenített vagy üres táblázatok a képernyőkön
zh_cn: 屏幕中未显示表格或空白的表格

source: Please make sure to check every screen which produces table-like output (e. g. ``Kernel/Modules/AgentTicketStatusView.pm``). If the list of e. g. tickets is empty or even not shown at all, check if the parameter ``Output => 1`` is used in creating the output for the page.
hu: Győződjön meg arról, hogy ellenőrzött-e minden olyan képernyőt, amely táblázatszerű kimenetet állít elő (például ``Kernel/Modules/AgentTicketStatusView.pm``). Ha például a jegyek listája üres vagy akár egyáltalán nem jelenik meg, ellenőrizze, hogy az ``Output => 1`` paraméter használatban van-e az oldal kimenetének létrehozásakor.
zh_cn: 请确保检查每个产生表格式输出的屏幕（例如 ``Kernel/Modules/AgentTicketStatusView.pm``）。 如果列表（如工单列表）是空的甚至根本没有显示，检查在创建页面的输出时是否使用了参数 ``Output => 1`` 。

source: Encoding Issues in Legacy Front End Modules
hu: Kódolási problémák az örökölt előtétprogram-modulokban
zh_cn: 传统前端模块中的编码问题

source: If you are getting into trouble with broken characters like umlauts, it could be that the content which is meant to be shown is rendered by the ``Print()`` method. To fix this, please switch the code from using the ``Print()`` method to the normal way of returning the complete response from the front end module.
hu: Ha problémája lenne a sérült karakterekkel, például az umlautokkal vagy ékezetekkel, akkor előfordulhat, hogy a megjelenítendő tartalmat a ``Print()`` metódus jeleníti meg. Ennek javításához váltson át a kódban a ``Print()`` metódus használatáról az előtétprogram-modulból érkező teljes válasz visszaadásának normál módszerére.
zh_cn: 如果你遇到像（日耳曼语系中的）元音变音这样的破碎字符的问题，可能是因为要显示的内容是由 ``Print()`` 方法渲染的。 要解决此问题，请将代码从使用 ``Print()`` 方法切换到从前端模块返回完整响应的常规方法。

source: OTRS Developer Manual
hu: OTRS fejlesztői kézikönyv
zh_cn: OTRS开发者手册

source: This work is copyrighted by OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.
hu: Ez a mű az OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Németország szerzői joga alatt áll.
zh_cn: 此作品的版权归 OTRS AG 所有 (https://otrs.com) ，德国（法兰克福） 上乌瑟尔Zimmersmühlenweg 路11号，61440。

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the `GNU website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.
hu: Engedélyt adunk Önnek a jelen dokumentum sokszorosítására, terjesztésére és/vagy módosítására a Free Software Foundation által kiadott GNU Free Documentation License 1.3-as, vagy bármely azt követő verziójának feltételei alapján. Nincs Nem Változtatható szakasz, nincs Címlapszöveg, nincs Hátlapszöveg. A jelen licenc egy példányát a `GNU weboldalán <https://www.gnu.org/licenses/fdl-1.3.txt>`__ találja.
zh_cn: 根据GNU自由文档许可证1.3版或自由软件基金会发布的任何更新版本的条款，允许复制、分发和/或修改本文档; 没有不变的部分，没有封面文本，也没有封底文本。 许可证的副本可以在 `GNU网站 <https://www.gnu.org/licenses/fdl-1.3.txt>`__ 找到。

source: `OTRSCodePolicy <https://github.com/OTRS/otrscodepolicy>`__
zh_cn: `OTRS代码策略 <https://github.com/OTRS/otrscodepolicy>`__

source: Prio => Warning
zh_cn: Prio => Warning（优先级设为警告）

source: PriorityID => 3
zh_cn: PriorityID => 3（优先级ID设置为3）

source: Rich Text
zh_cn: 富文本
