Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: This section should include the module name, `` - `` as separator and a brief description of the module purpose.
hu: Ennek a szakasznak kell tartalmaznia a modul nevét, a `` - `` karaktert elválasztóként és a modul céljának rövid leírását.
zh_cn: 本部分应包括模块名称，`` - `` 作为分隔符和模块目的的简要说明。

source: ``SYNOPSIS`` section
hu: A ``SYNOPSIS`` szakasz
zh_cn: ``SYNOPSIS`` 部分

source: This section should give a short usage example of commonly used module functions.
hu: Ennek a szakasznak a gyakran használt modulfüggvények rövid használati példáját kell adnia.
zh_cn: 本部分应提供常用模块功能的简短用法示例。

source: Usage of this section is optional.
hu: A szakasz használata elhagyható.
zh_cn: 使用此部分是可选的。

source: ``DESCRIPTION`` section
hu: A ``DESCRIPTION`` szakasz
zh_cn: ``DESCRIPTION`` 部分

source: This section should give more in-depth information about the module if deemed necessary (instead of having a long ``NAME`` section).
hu: Ennek a szakasznak mélyebb információkat kell adnia a modullal kapcsolatban, ha szükségesnek tekintik (egy hosszú ``NAME`` szakasz megléte helyett).
zh_cn: 如果认为有必要，本部分应该提供有关模块的更多深入信息（而不是有个很长的 ``NAME`` 部分）。

source: ``PUBLIC INTERFACE`` section
hu: A ``PUBLIC INTERFACE`` szakasz
zh_cn: ``PUBLIC INTERFACE`` 部分

source: This section marks the begin of all functions that are part of the API and therefore meant to be used by other modules.
hu: Ez a szakasz jelöli az összes olyan függvény kezdetét, amely az API része, és ennélfogva egyéb modulok használni kívánják.
zh_cn: 本部分标记了作为API一部分的所有函数的开头，因此意味着由其它模块使用。

source: ``PRIVATE FUNCTIONS`` section
hu: A ``PRIVATE FUNCTIONS`` szakasz
zh_cn: ``PRIVATE FUNCTIONS`` 部分

source: This section marks the begin of private functions.
hu: Ez a szakasz jelzi a privát függvények kezdetét.
zh_cn: 本部分标志着私有函数的开始。

source: Functions below are not part of the API, to be used only within the module and therefore not considered stable.
hu: A lenti függvények nem részei az API-nak, csak a modulon belül használhatók, és ennélfogva nem tekinthetők stabilnak.
zh_cn: 以下函数不是API的一部分，仅在模块中使用，因此不被认为是稳定的。

source: It is advisable to use this section whenever one or more private functions exist.
hu: Javasolt ennek a szakasznak a használata, amikor egy vagy több privát függvény létezik.
zh_cn: 只要存在一个或多个私有函数，建议使用此部分。

source: Documenting Subroutines
hu: Szubrutinok dokumentálása
zh_cn: 记录子程序

source: Subroutines should always be documented. The documentation contains a general description about what the subroutine does, a sample subroutine call and what the subroutine returns. It should be in this order. A sample documentation looks like this:
hu: A szubrutinokat mindig dokumentálni kell. A dokumentum tartalmaz egy általános leírást arról, hogy mit csinál a szubrutin, egy minta szubrutinhívást, és hogy mit ad vissza a szubrutin. Ezeknek ebben a sorrendben kell lenniük. Egy minta dokumentáció így néz ki:
zh_cn: 应始终记录子程序文档。 该文档包含有关子程序的作用、示例子程序调用以及子程序返回的内容的一般说明。 它应该按此顺序排列。 示例文档如下所示：

source: You can copy and paste a ``Data::Dumper`` output for the return values.
hu: Lemásolhat és beilleszthet egy ``Data::Dumper`` kimenetet a visszatérési értékekhez.
zh_cn: 您可以复制并粘贴 ``Data::Dumper`` 输出作为返回值。

source: Code Comments in Perl
hu: Kódmagyarázatok Perlben
zh_cn: Perl中的代码注释

source: In general, you should try to write your code as readable and self-explaining as possible. Don't write a comment to explain what obvious code does, this is unnecessary duplication. Good comments should explain **why** there is some code, possible side effects and anything that might be special or unusually complicated about the code.
hu: Általánosságban meg kell próbálni olvashatóan és önmagát magyarázóan írni a kódot, amennyire csak lehetséges. Ne írjon megjegyzést annak magyarázásához, hogy a nyilvánvaló kód mit csinál, mert az szükségtelen megkettőzés. A jó megjegyzéseknek azt kell elmagyarázniuk, hogy **miért** van valami a kódban, mik a lehetséges mellékhatások és bármi egyéb, amely különleges lehet vagy szokatlanul bonyolult a kóddal kapcsolatban.
zh_cn: 通常，您应该尝试将代码编写为可读和自我解释。 不要写注释来解释明显代码的作用，这是不必要的重复。 好的注释应该解释 **为什么** 有一些代码、可能的副作用以及任何可能特殊或异常复杂的代码。

source: Please adhere to the following guidelines:
hu: Ragaszkodjon a következő irányelvekhez:
zh_cn: 请遵守以下准则：

source: Make the code so readable that comments are not needed, if possible.
hu: Tegye a kódot annyira olvashatóvá, hogy ne legyen szükség magyarázatra, ha ez lehetséges.
zh_cn: 如果可能的话，使代码具有可读性，以便不需要注释。

source: It's always preferable to write code so that it is very readable and self-explaining, for example with precise variable and function names.
hu: Mindig vonzóbb a kódot úgy írni, hogy nagyon olvasható és önmagát magyarázó legyen, például pontos változónevekkel és függvénynevekkel.
zh_cn: 编写非常易读和自我解释的代码总是比较好，例如使用精确的变量和函数名称。

source: Don't say what the code says (DRY -> Don't repeat yourself).
hu: Ne mondja el, amit a kód is elmond (DRY: Don`t Repeat Yourself – Ne ismételd önmagad).
zh_cn: 不要说代码所说的（不要重复）。

source: Don't repeat (obvious) code in the comments.
hu: Ne ismételjen (nyilvánvaló) kódot a magyarázatokban.
zh_cn: 不要在注释中重复（明显的）代码。

source: Document **why** the code is there, not how it works.
hu: Azt dokumentálja, hogy a kód **miért** van ott, és ne azt, hogy hogyan működik.
zh_cn: 记录代码 **为什么** 在那里，而不是它的工作方式。

source: Usually, code comments should explain the *purpose* of code, not how it works in detail. There might be exceptions for specially complicated code, but in this case also a refactoring to make it more readable could be commendable.
hu: Általában a kódmagyarázatoknak a kód *célját* kellene elmagyarázniuk, és nem azt, hogy részletesen hogyan működik. Lehetnek kivételek különösen bonyolult kódnál, de ebben az esetben egy átszerkesztés lenne dicséretes, hogy olvashatóbb legyen.
zh_cn: 通常，代码注释应该解释代码的 *目的*，而不是它的详细工作原理。 特殊复杂代码可能有例外，但在这种情况下，重构以使其更具可读性可能是值得称道的。

source: Document pitfalls.
hu: Dokumentálja a buktatókat.
zh_cn: 记录陷阱。

source: Everything that is unclear, tricky or that puzzled you during development should be documented.
hu: Mindent dokumentálni kell, ami nem világos, furfangos vagy amit összerakott a fejlesztés során.
zh_cn: 在开发过程中，所有不清楚、棘手或困扰您的事情都应该记录下来。

source: Use full-line sentence-style comments to document algorithm paragraphs.
hu: Használjon teljes soros mondatszerű magyarázatokat az algoritmus bekezdéseinek dokumentálásához.
zh_cn: 使用整行句子样式注释来记录算法段落。

source: Always use full sentences (uppercase first letter and final period). Subsequent lines of a sentence should be indented.
hu: Mindig teljes mondatokat használjon (első betűt nagybetűvel írva és központozással). Egy mondat következő sorait be kell húzni.
zh_cn: 始终使用完整句子（大写第一个字母和最后一个句点）。 句子的后续行应缩进。

source: Use short end-of-line comments to add detail information.
hu: Használjon rövid sorvégi magyarázatokat a részletes információk hozzáadásához.
zh_cn: 使用简短的行尾注释添加详细信息。

source: These can either be a complete sentence (capital first letter and period) or just a phrase (lowercase first letter and no period).
hu: Ez lehet vagy teljes mondat (nagy kezdőbetű és központozás), vagy csak egy kifejezés (kis kezdőbetű és nincs központozás).
zh_cn: 这些可以是一个完整的句子（大写首字母和句点），也可以只是一个短语（小写首字母和无句点）。

source: Declaration of SQL Statements
hu: SQL-utasítások deklarációja
zh_cn: SQL语句的声明

source: If there is no chance for changing the SQL statement, it should be used in the ``Prepare`` function. The reason for this is, that the SQL statement and the bind parameters are closer to each other.
hu: Ha nincs esély az SQL-utasítás megváltoztatására, akkor azt a ``Prepare`` függvényben kell használni. Ennek az az oka, hogy az SQL-utasítás és a kötési paraméterek közelebb vannak egymáshoz.
zh_cn: 如果没有机会更改SQL语句，则应在 ``Prepare`` 函数中使用它。 原因是，SQL语句和绑定参数彼此更接近。

source: The SQL statement should be written as one nicely indented string without concatenation like this:
hu: Az SQL-utasítást egy összefűzések nélküli, pontosan behúzott szövegként kell megírni úgy, mint például ezt:
zh_cn: SQL语句应该写成一个缩进良好的字符串，没有连接，如下所示：

source: This is easy to read and modify, and the whitespace can be handled well by our supported DBMSs. For auto-generated SQL code (like in ``TicketSearch``), this indentation is not necessary.
hu: Ezt könnyű olvasni és módosítani, és az üres karaktereket jól tudják kezelni a támogatott DBMS-ek. Az automatikusan előállított SQL-kódnál (mint a ``TicketSearch`` modulban) ez a behúzás nem szükséges.
zh_cn: 这样很容易阅读和修改，我们支持的DBMS可以很好地处理空白。 对于自动生成的SQL代码（如 ``TicketSearch`` ），此缩进不是必需的。

source: Returning on Errors
hu: Visszatérés hibák esetén
zh_cn: 出错时返回

source: Whenever you use database functions you should handle errors. If anything goes wrong, return from subroutine:
hu: Valahányszor adatbázis-függvényeket használ, kezelnie kell a hibákat. Ha valami elromlik, az visszakerül a szubrutinból:
zh_cn: 无论何时使用数据库函数，都应该处理错误。如果出现任何错误，请从子程序返回：

source: Using Limit
hu: Korlát használata
zh_cn: 使用Limit

source: Use ``Limit => 1`` if you expect just one row to be returned.
hu: Használja a ``Limit => 1`` korlátozást, ha csak egyetlen sort vár visszatérésként.
zh_cn: 如果你希望只返回一行，使用 ``Limit => 1`` 。

source: Using the ``while`` loop
hu: A ``while`` ciklus használata
zh_cn: 使用 ``while`` 循环

source: Always use the ``while`` loop, even when you expect one row to be returned, as some databases do not release the statement handle and this can lead to weird bugs.
hu: Mindig használja a ``while`` ciklust még akkor is, ha csak egyetlen sort vár visszatérésként, mivel néhány adatbázis nem szabadítja fel az utasításleírót, és ez furcsa hibákhoz vezethet.
zh_cn: 总是使用 ``while`` 循环，即使你期望返回一行，因为一些数据库不释放语句句柄，这可能导致奇怪的错误。

source: All JavaScript is loaded in all browsers (no browser hacks in the template files). The code is responsible to decide if it has to skip or execute certain parts of itself only in certain browsers.
hu: Az összes JavaScript betöltődik minden böngészőben (nincsenek böngésző trükközések a sablonfájlokban). A kód felelős annak eldöntéséért, hogy ki kell hagynia vagy végre kell hajtania saját magának bizonyos részeit az egyes böngészőkben.
zh_cn: 在所有的浏览器中所有的JavaScript都会加载（模板文件中没有浏览器入侵）。代码负责决定是否必须跳过或仅在某些浏览器中执行其自身的某些部分。

source: Directory Structure
hu: Könyvtárszerkezet
zh_cn: 目录结构

source: Directory structure inside the ``var/httpd/htdocs/js/`` folder:
hu: Könyvtárszerkezet a ``var/httpd/htdocs/js/`` mappán belül:
zh_cn: ``var/httpd/htdocs/js/`` 文件夹内的目录结构：

source: Thirdparty Code
hu: Harmadik féltől származó kód
zh_cn: 第三方代码

source: Every thirdparty module gets its own subdirectory: *module name-version number* (e.g. ckeditor-4.7.0, jquery-3.2.1). Inside of that, file names should not have a version number or postfix included (wrong: ``jquery/jquery-3.2.1.min.js``, right: ``jquery-3.2.1/jquery.js``).
hu: Minden harmadik féltől származó modul saját alkönyvtárat kap: *modulnév-verziószám* (például ckeditor-4.7.0, jquery-3.2.1). Ezen belül a fájlneveknek nem kell verziószámot vagy előtagot tartalmaznia (hibás: ``jquery/jquery-3.2.1.min.js``, helyes: ``jquery-3.2.1/jquery.js``).
zh_cn: 每个第三方模块都有自己的子目录： *模块名称-版本号* （例如，ckeditor-4.7.0、jquery-3.2.1）。其中，文件名不应包含版本号或后缀（错误： ``jquery/jquery-3.2.1.min.js`` ，正确： ``jquery-3.2.1/jquery.js`` ）。

source: JavaScript Variables
hu: JavaScript változók
zh_cn: JavaScript变量

source: Variable names should be CamelCase, just like in Perl.
hu: A változóneveket CamelCase jelölésrendszerben kell írni, akárcsak a Perlben.
zh_cn: 变量名应该使用骆驼拼写法，就像在Perl中一样。

source: Variables that hold a jQuery object should start with ``$``, for example: ``$Tooltip``.
hu: A jQuery objektumot tartalmazó változókat ``$`` karakterrel kell kezdeni, például: ``$Tooltip``.
zh_cn: 保存jQuery对象的变量应以 ``$`` 开头，例如： ``$Tooltip`` 。

source: Functions
hu: Függvények
zh_cn: 函数

source: Function names should be CamelCase, just like in Perl.
hu: A függvényneveket CamelCase jelölésrendszerben kell írni, akárcsak a Perlben.
zh_cn: 函数名应该使用骆驼拼写法，就像在Perl中一样。

source: Namespaces
hu: Névterek
zh_cn: 命名空间

source: Code Comments in JavaScript
hu: Kódmagyarázatok JavaScriptben
zh_cn: JavaScript中的代码注释

source: The :ref:`Code Comments in Perl` also apply to JavaScript.
hu: A :ref:`Code Comments in Perl` szakaszban leírtak a JavaScriptre is vonatkoznak.
zh_cn: :ref:`Code Comments in Perl` 也适用于javascript。

source: Single line comments are done with ``//``.
hu: Egysoros megjegyzéseket ``//`` karakterekkel kell készíteni.
zh_cn: 单行注释用 ``//`` 完成。

source: Longer comments are done with ``/* ... */``.
hu: Hosszabb megjegyzéseket ``/* ... */`` karakterekkel kell készíteni.
zh_cn: 使用 ``/ * ... */`` 进行更长的注释。

source: If you comment out parts of your JavaScript code, only use ``//`` because ``/* ... */`` can cause problems with regular expressions in the code.
hu: Ha megjegyzésre állítja a JavaScript kód egyes részeit, akkor csak a ``//`` karaktereket használja, ugyanis a ``/* ... */`` használata problémákat okozhat a reguláris kifejezéseknél a kódban.
zh_cn: 如果你注释掉JavaScript代码的一部分，只使用 ``//`` ，因为 ``/* ... */`` 会导致代码中的正则表达式出现问题。

source: Event Handling
hu: Eseménykezelés
zh_cn: 事件处理

source: Always use ``$.on()`` instead of the event-shorthand methods of jQuery for better readability (wrong: ``$SomeObject.click(...)``, right: ``$SomeObject.on('click', ...``).
hu: Mindig az ``$.on()`` függvényt használja a jQuery rövidített nevű eseménymetódusai helyett a jobb olvashatóságért (hibás: ``$SomeObject.click(...)``, helyes: ``$SomeObject.on('click', ...``).
zh_cn: 总是使用 ``$.on()`` 代替jQuery的事件简写方法以获得更好的可读性（错误： ``$SomeObject.click(...)`` ，正确： ``$SomeObject.on('click', ...``)）。

source: If you ``$.on()`` events, make sure to ``$.off()`` them beforehand, to make sure that events will not be bound twice, should the code be executed another time.
hu: Ha eseményeket köt az ``$.on()`` függvénnyel, akkor győződjön meg arról, hogy korábban leválasztotta azokat az ``$.off()`` használatával annak biztosításához, hogy az események ne legyenek kétszer kötve, ne kelljen a kódot még egy alkalommal végrehajtani.
zh_cn: 如果你 ``$.on()`` 事件，请确保事先 ``$.off()`` 它们，以确保如果代码再次执行，事件不会绑定两次。

source: Make sure to use ``$.on()`` with namespacing, such as ``$.on('click.<Name>')``.
hu: Győződjön meg arról, hogy az ``$.on()`` függvényt névtérrel használja-e, mint például ``$.on('click.<Name>')``.
zh_cn: 确保在命名空间中使用 ``$.on()`` ，比如 ``$.on('click.<Name>')`` 。

source: Use HTML 5 notation. Don't use self-closing tags for non-void elements (such as ``div``, ``span``, etc.).
hu: Használjon HTML 5 jelölést. Ne használjon önmagát lezáró címkéket nem üres elemeknél (mint például ``div``, ``span``, stb.).
zh_cn: 使用HTML 5表示法。 不要将自闭合标签用于非空元素（例如 ``div`` 、 ``span`` 等）。

source: Use proper intendation. Elements which contain other non-void child elements should not be on the same level as their children.
hu: Használjon megfelelő behúzást. Azok az elemek, amelyek egyéb, nem üres gyermekelemet tartalmaznak, nem lehetnek ugyanazon a szinten, mint a gyermekeik.
zh_cn: 使用正确的缩进。 包含其它非空子元素的元素不应与子元素处于同一级别。

source: Don't use HTML elements for layout reasons (e.g. using ``br`` elements for adding space to the top or bottom of other elements). Use the proper CSS classes instead.
hu: Ne használjon HTML elemeket elrendezési okokból (például ``br`` elemek használata más elemek fölé vagy alá történő további térköz adásához). Használja helyette a megfelelő CSS osztályokat.
zh_cn: 不要出于布局原因使用HTML元素（例如，使用 ``br`` 元素为其它元素的顶部或底部添加空间）。 请改用适当的CSS类。

source: Don't use inline CSS. All CSS should either be added by using predefined classes or (if necessary) using JavaScript (e.g. for showing/hiding elements).
hu: Ne használjon beágyazott CSS-t. Az összes CSS-t vagy az előre meghatározott osztályokkal, vagy (ha szükséges) JavaScript használatával kell hozzáadni (például elemek megjelenítéséhez vagy elrejtéséhez).
zh_cn: 不要使用内联CSS。 所有的CSS应该使用预定义的类或者（如果需要的话）使用JavaScript来添加（例如用于显示/隐藏元素）。

source: Don't use JavaScript in templates. All needed JavaScript should be part of the proper library for a certain front end module or of a proper global library. If you need to pass JavaScript data to the front end, use ``$LayoutObject->AddJSData()``.
hu: Ne használjon JavaScriptet a sablonokban. Az összes szükséges JavaScriptnek egy bizonyos előtétprogram-modul megfelelő programkönyvtára részének, vagy egy megfelelő globális programkönyvtár részének kell lennie. Ha JavaScript adatokat kell átadnia az előtétprogramnak, akkor használja a ``$LayoutObject->AddJSData()`` metódust.
zh_cn: 不要在模板中使用JavaScript。对于某个前端模块或适当的全局库，所有需要的JavaScript都应该是适当库的一部分。 如果需要将JavaScript数据传递到前端，请使用 ``$LayoutObject->AddJSData()`` 。

source: Minimum resolution is 1024x768px.
hu: A legkisebb felbontás 1024×768 képpont.
zh_cn: 最小分辨率为1024x768像素。

source: The layout is liquid, which means that if the screen is wider, the space will be used.
hu: Az elrendezés folyékony, amely azt jelenti, hogy ha a képernyő szélesebb, akkor a helyet fel fogja használni.
zh_cn: 布局是流动的，这意味着如果屏幕变宽，空间也会被使用。

source: Absolute size measurements should be specified in px to have a consistent look on many platforms and browsers.
hu: Az abszolút méretmeghatározásokat képpontban (px) kell megadni, hogy következetes kinézetet kapjon a legtöbb platformon és böngészőben.
zh_cn: 应该以px（像素）指定绝对大小的测量值，以在许多平台和浏览器上保持一致的外观。

source: Documentation is made with CSSDOC (see CSS files for examples). All logical blocks should have a CSSDOC comment.
hu: A dokumentáció CSSDOC használatával készül (nézze meg a CSS-fájlokat példaként). Az összes logikai blokknak rendelkeznie kell egy CSSDOC megjegyzéssel.
zh_cn: 文档是使用CSSDOC制作的（请参阅CSS文件的示例）。 所有的逻辑块应该有一个CSSDOC注释。

source: CSS Architecture
hu: CSS szerkezet
zh_cn: CSS体系结构

source: We follow the `Object Oriented CSS <http://wiki.github.com/stubbornella/oocss/>`__ approach. In essence, this means that the layout is achieved by combining different generic building blocks to realize a particular design.
hu: Az `objektumorientált CSS <http://wiki.github.com/stubbornella/oocss/>`__ megközelítést követjük. Lényegében ez azt jelenti, hogy az elrendezés különböző általános építőkockák egyesítésével érhető el egy bizonyos látványterv megvalósításához.
zh_cn: 我们遵循 `面向对象的CSS <http://wiki.github.com/stubbornella/oocss/>`__ 方法。本质上，这意味着布局是通过组合不同的通用构建块来实现特定的设计。

source: Wherever possible, module specific design should not be used. Therefore we also do not work with IDs on the ``body`` element, for example, if it can be avoided.
hu: Ahol csak lehetséges, nem szabad a modulra jellemző látványtervet használni. Például ezért nem dolgozunk azonosítókkal a ``body`` elemen sem, ha az elkerülhető.
zh_cn: 只要有可能，就不应使用模块特定的设计。 因此，如果可以避免的话，我们也不使用 ``body`` 元素上的ID。

source: CSS Style
hu: CSS stílus
zh_cn: CSS样式

source: All definitions have a ``{`` in the same line as the selector, all rules are defined in one row per rule, the definition ends with a row with a single ``}`` in it.
hu: Az összes meghatározásnak ugyanabban a sorában van a ``{`` karakter mint a kiválasztó, az összes szabály szabályonként egy sorban van meghatározva, a meghatározások egyetlen ``}`` karaktert tartalmazó sorral végződnek.
zh_cn: 所有定义在选择器的同一行中都有一个 ``{`` ，所有规则都按每个规则一行定义，定义以一个单行的 ``}`` 结束。

source: See the following example:
hu: Nézze meg a következő példát:
zh_cn: 请参阅以下示例：

source: Between ``:`` and the rule value, there is a space.
hu: A ``:`` és szabály értéke között van egy szóköz.
zh_cn: 在 ``:`` 和规则值之间，有一个空格。

source: Every rule has an indent of 4 spaces.
hu: Minden szabály 4 szóközzel van behúzva.
zh_cn: 每条规则都有4个空格的缩进。

source: If multiple selectors are specified, separate them with comma and put each one on an own line:
hu: Ha több kiválasztó van megadva, akkor vesszővel válassza el azokat, és mindegyiket tegye külön sorba:
zh_cn: 如果指定了多个选择器，请用逗号分隔它们，并且一行一个：

source: If rules are combinable, combine them (e.g. combine ``background-position``, ``background-image``, etc. into ``background``).
hu: Ha a szabályok egyesíthetők, akkor egyesítse azokat (például egyesítse a ``background-position``, ``background-image``, stb. szabályokat a ``background`` szabályba).
zh_cn: 如果规则是可组合的，则将它们组合起来（例如将 ``background-position`` 、 ``background-image`` 等组合成 ``background`` ）。

source: Rules should be in a logical order within a definition (all color specific rule together, all positioning rules together, etc.).
hu: A szabályoknak logikai sorrendben kell lenniük egy meghatározáson belül (az összes színre jellemző szabály együtt, az összes pozicionáló szabály együtt, stb.).
zh_cn: 规则应该在定义内按逻辑顺序排列（所有颜色特定规则在一起、所有定位规则在一起等）。

source: All IDs and names are written in CamelCase notation:
hu: Az összes azonosító és név CamelCase jelölésrendszerben van írva:
zh_cn: 所有ID和名称都以驼峰式命名法编写：

source: Sending Contributions
hu: Hozzájárulások küldése
zh_cn: 发送贡献

source: The source code of ((OTRS)) Community Edition and additional public modules can be found on `GitHub <https://github.com/OTRS>`__. From there you can get to the listing of all available repositories. It also describes the currently active branches and where contributions should go to (stable vs. development branches).
hu: Az ((OTRS)) Community Edition és a további nyilvános modul forráskódja megtalálható a `GitHubon <https://github.com/OTRS>`__. Innen eljuthat az összes elérhető tároló felsorolásához. Leírja a jelenleg aktív ágakat is, és hogy hova kell kerülniük a hozzájárulásoknak (stabil vagy fejlesztői ágak).
zh_cn: 可以在 `GitHub <https://github.com/OTRS>`__ 上找到((OTRS))社区版和其它公共模块的源代码。 从那里，您可以访问所有可用存储库的列表。 它还描述了当前活动的分支以及贡献应该去哪里（稳定分支与开发分支）。

source: It is highly recommended that you use the OTRS code quality checker `OTRSCodePolicy <https://github.com/OTRS/otrscodepolicy>`__ as described in the :ref:`Useful Tools` even before sending in your contributions. If your code does not validate against this tool, it will likely not be accepted.
hu: Erősen ajánlott a :ref:`Useful Tools` fejezetben bemutatott `OTRSCodePolicy <https://github.com/OTRS/otrscodepolicy>`__ OTRS kódminőség-ellenőrző használata, még mielőtt elküldené a hozzájárulásait. Ha a kódját nem érvényesíti ezzel az eszközzel, akkor valószínűleg nem fogják elfogadni.
zh_cn: 强烈建议您在发送贡献之前使用 :ref:`Useful Tools` 中所述的OTRS代码质量检查程序 `OTRSCodePolicy <https://github.com/OTRS/otrscodepolicy>`__ 。如果您的代码没有通过这个工具进行验证，那么它很可能不会被接受。

source: The easiest way to send your contributions to the OTRS developer's team is by creating a *pull request* in GitHub. Please take a look at the instructions on `GitHub <https://help.github.com>`__, specifically about `forking a repository and sending pull requests <https://help.github.com/articles/fork-a-repo>`__.
hu: A legegyszerűbb módja a hozzájárulások elküldésének az OTRS fejlesztőcsapata számára egy *pull request* létrehozása a GitHubon. Vessen egy pillantást a `GitHubon <https://help.github.com>`__ lévő utasításokra, különösen a `tároló elágaztatására és a beolvasztási kérések küldésére <https://help.github.com/articles/fork-a-repo>`__.
zh_cn: 将您的贡献发送给OTRS开发人员团队的最简单方法是在Github中创建一个 *pull request*。请查看关于 `GitHub <https://help.github.com>`__，特别是关于 `forking a repository and sending pull requests <https://help.github.com/articles/fork-a-repo>`__ 的说明。

source: The basic workflow would look like this:
hu: Az alap munkafolyamatnak így kellene kinéznie:
zh_cn: 基础的工作流应看起来像这样：

source: Register at GitHub, if you have no account yet.
hu: Regisztráljon a GitHubon, ha még nincs fiókja.
zh_cn: 如果您还没有帐户，请在GitHub注册。

source: Fork the repository you want to contribute to, and checkout the branch that the changes should go in.
hu: Ágaztassa el azt a tárolót, amelynél közre szeretne működni, és váltson át arra az ágra, amelybe a változtatásokat be kell tenni.
zh_cn: 克隆您要贡献的仓库（Fork），并检出要进行更改的分支。

source: Create a new development branch for your fix/feature/contribution, based on the current branch.
hu: Hozzon létre egy új fejlesztői ágat a javításhoz/szolgáltatáshoz/hozzájáruláshoz az aktuális ág alapján.
zh_cn: 根据当前分支为您的修订/特色功能/贡献创建一个新的开发分支。
