Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: There are three different kinds of output filters. They are active at different stages of the generation of HTML content.
hu: Három különböző fajta kimenetszűrő létezik. Ezek a HTML tartalom előállításának különböző szakaszaiban aktívak.
zh_cn: 有三种不同的输出过滤器。 他们在生成HTML内容的不同阶段激活。

source: These filters allow to modify the output of a template after it was rendered.
hu: Ezek a szűrők lehetővé teszik egy sablon kimenetének módosítást, miután az megjelenítésre került.
zh_cn: 这些过滤器允许在渲染模板后修改模板的输出。

source: To translate content, you can run ``$LayoutObject->Translate()`` directly. If you need other template features, just define a small template file for your output filter and use it to render your content before injecting it into the main data. It can also be helpful to use jQuery DOM operations to reorder/replace content on the screen in some cases instead of using regular expressions. In this case you would inject the new code somewhere in the page as invisible content (e. g. with the class ``Hidden``), and then move it with jQuery to the correct location in the DOM and show it.
hu: A tartalom lefordításához futtathatja közvetlenül a ``$LayoutObject->Translate()`` függvényt. Ha egyéb sablonszolgáltatásokra van szüksége, akkor egyszerűen határozzon meg egy kis sablonfájlt a kimenetszűrőhöz, és használja azt a tartalom megjelenítéséhez, mielőtt beültetné azt a fő adatokba. Néhány esetben hasznos lehet a jQuery DOM műveletek használata is a képernyőn lévő tartalom sorrendjének megváltoztatásához vagy cseréjéhez a reguláris kifejezések használata helyett. Ebben az esetben láthatatlan tartalomként kellene beültetnie az új kódot valahova az oldalba (például a ``Hidden`` osztállyal), majd ezután áthelyezni a jQuery használatával a megfelelő helyre a DOM-ban, és megjeleníteni azt.
zh_cn: 要翻译内容，您可以直接运行 ``$LayoutObject->Translate()`` 。 如果您需要其它模板功能，只需为输出过滤器定义一个小的模板文件，并在将其注入主数据之前使用它来呈现您的内容。 在某些情况下使用jQuery DOM操作来重新排序/替换屏幕上的内容，而不是使用正则表达式也是有帮助的。 在这种情况下，您会将新代码注入页面中的某个地方作为不可见的内容（例如，使用 ``Hidden`` 类），然后将其与jQuery一起移动到DOM中的正确位置并显示它。

source: To make using post output filters easier, there is also a mechanism to request HTML comment hooks for certain templates/blocks. You can add in your module config XML like:
hu: Az utó-kimenetszűrők használatának megkönnyítéséhez létezik egy mechanizmus is a HTML megjegyzéshorgok lekéréséhez bizonyos sablonoknál vagy blokkoknál. Hozzáadhatja a modulbeállító XML-be a következőhöz hasonlóan:
zh_cn: 为了更容易地使用渲染后输出过滤器，还有一种机制来为某些模板/块请求HTML注释钩子。 您可以在模块中添加配置XML，如：

source: This will cause the block ``CustomerTable`` in ``AgentTicketZoom.tt`` to be wrapped in HTML comments each time it is rendered:
hu: Ez azt fogja okozni, hogy az ``AgentTicketZoom.tt`` fájlban lévő ``CustomerTable`` blokk át lesz alakítva a HTML megjegyzésekben minden alkalommal, amikor megjelenítésre kerül:
zh_cn: 这将导致 ``AgentTicketZoom.tt`` 中的 ``CustomerTable`` 块在每次渲染时都封装在HTML注释中：

source: With this mechanism every package can request just the block hooks it needs, and they are consistently rendered. These HTML comments can then be used in your output filter for easy regular expression matching.
hu: Ezzel a mechanizmussal minden csomag csak azokat a blokkhorgokat kérheti, amelyekre szüksége van, és következetesen kerülnek megjelenítésre. Ezek a HTML megjegyzések használhatók ezután a kimenetszűrőben az egyszerű reguláris kifejezés illesztéshez.
zh_cn: 使用这种机制，每个包都可以请求它所需的块钩子，并且它们一致地被渲染。 然后，可以在输出过滤器中使用这些HTML注释，以便于正则表达式匹配。

source: This kind of filter allows to process the complete HTML output for the request right before it is sent to the browser. This can be used for global transformations.
hu: Ez a fajta szűrő lehetővé teszi a teljes HTML kimenet feldolgozását a kérésnél közvetlenül azelőtt, hogy kiküldésre kerül a böngészőnek. Ez globális átalakításokhoz használható.
zh_cn: 这种过滤器允许在将请求发送到浏览器之前处理请求的完整HTML输出。 这可以用于全局转换。

source: This kind of output filter is a plugin for the method ``Kernel::Output::HTML::Layout::Ascii2HTML()`` and is only active when the parameter ``LinkFeature`` is set to 1. Thus the ``FilterText`` output filters are currently only active for the display of the body of plain text articles. Plain text articles are generated by incoming non-HTML mails and when OTRS is configured to not use the Rich Text feature in the front end.
hu: Ez a fajta kimenetszűrő egy bővítmény a ``Kernel::Output::HTML::Layout::Ascii2HTML()`` metódushoz, és csak akkor aktív, amikor a ``LinkFeature`` paraméter 1-re van állítva. Így a ``FilterText`` kimenetszűrők jelenleg csak az egyszerű szöveges bejegyzések törzsének megjelenítésénél aktívak. Az egyszerű szöveges bejegyzéseket a bejövő nem HTML levelek állítják elő, illetve amikor az OTRS úgy van beállítva, hogy ne használja a Rich Text szolgáltatást az előtétprogramon.
zh_cn: 这种输出过滤器是 ``Kernel::Output::HTML::Layout::Ascii2HTML()`` 方法的插件，仅当参数 ``LinkFeature`` 设置为1时才有效。这样 ``FilterText`` 输出过滤器目前仅用于显示纯文本信件的正文。 纯文本信件由传入的非HTML邮件生成，并且OTRS配置为不在前端使用富文本功能。

source: Output Filter Code Example
hu: Kimenetszűrő kódpélda
zh_cn: 输出过滤器代码示例

source: See package `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Output/HTML>`__.
hu: Nézze meg a `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Output/HTML>`__ csomagot.
zh_cn: 请参阅软件包 `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Output/HTML>`__。

source: Output Filter Configuration Example
hu: Kimenetszűrő beállítási példa
zh_cn: 输出过滤器配置示例

source: See package `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Config/Files>`__.
hu: Nézze meg a `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Config/Files>`__ csomagot.
zh_cn: 请参阅软件包 `TemplateModule <https://github.com/OTRS/TemplateModule/tree/master/Kernel/Config/Files>`__。

source: Output Filter Use Case Example
hu: Kimenetszűrő használati eset példa
zh_cn: 输出过滤器用例示例

source: Show additional ticket attributes in ``AgentTicketZoom``
hu: További jegyattribútumok megjelenítése az ``AgentTicketZoom`` képernyőn
zh_cn: 在 ``AgentTicketZoom`` 中显示其它工单属性

source: This can be achieved with a ``FilterElementPost`` output filter.
hu: Ez egy ``FilterElementPost`` kimenetszűrővel valósítható meg.
zh_cn: 这可以通过 ``FilterElementPost`` 输出过滤器来实现。

source: Show the service selection as a multi level menu
hu: A szolgáltatásválasztás megjelenítése többszintű menüként
zh_cn: 将服务选择显示为多级菜单

source: Use a ``FilterElementPost`` for this feature. The list of selectable services can be parsed from the processed template output. The multi level selection can be constructed from the service list and inserted into the template content. A ``FilterElementPost`` output filter must be used for that.
hu: Használjon egy ``FilterElementPost`` szűrőt ehhez a szolgáltatáshoz. A választható szolgáltatások listája a feldolgozott sablonkimenetből dolgozható fel. A többszintű választás a szolgáltatáslistából építhető fel, és szúrható be a sablontartalomba. Egy ``FilterElementPost`` kimenetszűrőt kell használni ehhez.
zh_cn: 对此功能使用 ``FilterElementPost``。 可以从处理的模板输出中解析可选服务的列表。 可以从服务列表构造多级选择并将其插入到模板内容中。 必须使用 ``FilterElementPost`` 输出过滤器。

source: Create links within plain text article bodies
hu: Hivatkozások létrehozása az egyszerű szöveges bejegyzés törzseiben
zh_cn: 在纯文本信件正文中创建链接

source: A biotech company uses gene names like IPI00217472 in plain text articles. A ``FilterText`` output filter can be used to create links to a sequence database, e.g. http://srs.ebi.ac.uk/srsbin/cgi-bin/wgetz?-e+[IPI-acc:IPI00217472]+-vn+2, for the gene names.
hu: Egy biotechnológiai vállalat IPI00217472 formátumú génneveket használ az egyszerű szöveges bejegyzésekben. Egy ``FilterText`` kimenetszűrő használható a szekvencia-adatbázisra mutató hivatkozások létrehozásához a génneveknél, például http://srs.ebi.ac.uk/srsbin/cgi-bin/wgetz?-e+[IPI-acc:IPI00217472]+-vn+2 formában.
zh_cn: 一家生物技术公司在纯文章文章中使用IPI00217472等基因名称。 可以使用 ``FilterText`` 输出过滤器来创建到序列数据库的链接，例如，用于基因名称的 http://srs.ebi.ac.uk/srsbin/cgi-bin/wgetz?-e+[IPI-acc:IPI00217472 ]+-vn+2。

source: Prohibit active content
hu: Az aktív tartalom megtiltása
zh_cn: 禁止有效内容

source: There is firewall rule that disallows all active content. In order to avoid rejection by the firewall, the HTML tag ``<applet>`` can be filtered with a ``FilterContent`` output filter.
hu: Van egy olyan tűzfalszabály, amely megtiltja az összes aktív tartalmat. Azért, hogy elkerüljük a tűzfal visszautasítását, az ``<applet>`` HTML-címke kiszűrhető egy ``FilterContent`` kimenetszűrővel.
zh_cn: 防火墙规则禁止所有活动内容。 为了避免被防火墙拒绝，可以使用 ``FilterContent`` 输出过滤器过滤HTML的 ``<applet>`` 标签。

source: Every ``FilterElementPost`` output filter is constructed and run for every configured template that is needed for the current request. Thus low performance of the output filter or a large number of filters can severely degrade performance.
hu: Minden ``FilterElementPost`` kimenetszűrő felépítésre és futtatásra kerül minden olyan beállított sablonnál, amely szükséges az aktuális kéréshez. Így a kimenetszűrő alacsony teljesítménye vagy a szűrők nagy száma komolyan csökkentheti a teljesítményt.
zh_cn: 为当前请求所需的每个配置模板构造并运行每个 ``FilterElementPost`` 输出过滤器。因此，低性能的输出过滤器或大量的过滤器会严重降低性能。

source: Best Practices
hu: Bevált gyakorlatok
zh_cn: 最佳实践

source: In order to increase flexibility the list of affected templates should be configured in system configuration.
hu: A rugalmasság növelésének érdekében az érintett sablonok listáját be kell állítani a rendszerbeállításokban.
zh_cn: 为了增加灵活性，应在系统配置中配置受影响的模板列表。

source: Since OTRS 7 process management can use script modules to perform activities (script tasks) and/or sequence flow actions (know before as transition actions). This modules are located in ``Kernel::System::ProcessManagement::Modules``.
hu: Az OTRS 7-től kezdve a folyamatkezelés képes vezérelt modulokat használni a tevékenységek (vezérelt feladatok) és/vagy szekvenciafolyamok (korábban átmenet-műveteknek hívták) végrehajtásához. Ezek a modulok a ``Kernel::System::ProcessManagement::Modules`` helyen találhatók.
zh_cn: 由于OTRS 7流程管理可以使用脚本模块来执行活动（脚本任务）和/或序列流操作（之前称为转换操作）。 这些模块位于 ``Kernel::System::ProcessManagement::Modules`` 中。

source: Process Management Modules
hu: Folyamatkezelés modulok
zh_cn: 流程管理模块

source: The process management modules are scripts written in Perl language to perform certain action or actions over the process ticket like set a dynamic field or change a queue. Or to any other part of the system like create new tickets.
hu: A folyamatkezelés modulok Perl nyelven megírt parancsfájlok, amelyek a folyamatjegy során bizonyos művelet vagy műveletek végrehajtásához készültek, mint például egy dinamikus mező beállítása vagy egy várólista megváltoztatása. Vagy a rendszer bármely egyéb részéhez, mint például új jegyek létrehozásához.
zh_cn: 流程管理模块是用Perl语言编写的脚本，用于执行某些操作或基于流程工单的操作（如设置动态字段或更改队列）。 或者到系统的任何其它部分，比如创建新工单。

source: By default modules use a set of key value pairs to use them as parameters for the action e.g. to change queue of the process ticket, the queue or queue ID and its corresponding value is needed.
hu: Alapértelmezetten a modulok egy kulcs-érték készletet használnak, hogy paraméterként használják azokat a műveletekhez, például a folyamatjegy várólistájának megváltoztatásához a várólista vagy a várólista-azonosító, illetve a hozzá tartozó érték szükséges.
zh_cn: 默认情况下，模块使用一组键值对将它们用作操作的参数，例如： 要更改流程工单的队列，需要队列或队列ID及其对应的值。

source: Some scripts might require more than a simple key value pairs as parameters or its configuration might need to have a more user friendly GUI. In such cases OTRS provides some configuration field types that can be also extended if needed.
hu: Néhány parancsfájl esetleg többet igényel egy egyszerű kulcs-érték párnál paraméterként, vagy a beállításának esetleg még felhasználóbarátabb grafikus felületre lenne szüksége. Ilyen esetekben az OTRS biztosít néhány beállítási mezőtípust, amely szintén kibővíthető, ha szükséges.
zh_cn: 某些脚本可能需要多个简单的键值对作为参数，或者其配置可能需要具有更加用户友好的GUI。 在这种情况下，OTRS提供了一些配置字段类型，如果需要也可以扩展。

source: Current field types:
hu: Jelenlegi mezőtípusok:
zh_cn: 当前字段类型：

source: Dropdown
hu: Legördülő
zh_cn: 下拉选择框

source: Shows a drop-down list with predefined values.
hu: Egy legördülő listát jelenít meg előre meghatározott értékekkel.
zh_cn: 显示包含预定义值的下拉列表框。

source: Key-value list
hu: Kulcs-érték lista
zh_cn: 键-值列表

source: Shows a list of simple key value pairs (text inputs). Pairs can be added or deleted.
hu: Egyszerű kulcs-érték párok listáját jeleníti meg (szöveges bevitelek). A párok hozzáadhatók vagy törölhetők.
zh_cn: 显示简单键值对（文本输入）的列表。 可以添加或删除键值对。

source: Multi language Rich Text
hu: Többnyelvű Rich Text
zh_cn: 多语言富文本

source: Shows a Rich Text editor associated to a system language, also shows a language selector to add Rich Text fields for the proper selected language.
hu: Egy rendszernyelvhez rendelt Rich Text szerkesztőt jelenít meg, valamint egy nyelvválasztót is Rich Text mezők hozzáadásához a megfelelő kiválasztott nyelvhez.
zh_cn: 显示与系统语言关联的富文本编辑器，还显示语言选择器，以便为选择的特定语言添加富文本字段。

source: Recipients
hu: Címzettek
zh_cn: 收件人

source: Shows a multi select field pre-filled with agents to be used as email recipients, also displays a free input field to be used to specify external email addresses to be added to the recipients list.
hu: Ügyintézőkkel előre kitöltött többválasztós mezőt jelenít meg, akik használhatók e-mailek címzettjeinél, valamint egy szabad beviteli mezőt is megjelenít, amely használható külső e-mail címek megadásához és a címzettlistához adásához.
zh_cn: 显示一个多选字段，其中预先填充了用作电子邮件收件人的服务人员，还显示一个自由输入字段，用于指定要添加到收件人列表中的外部电子邮件地址。

source: Shows a single Rich Text field.
hu: Egy egyszerű Rich Text mezőt jelenít meg.
zh_cn: 显示单个富文本字段。

source: Creating a New Process Management Module
hu: Egy új folyamatkezelés modul létrehozása
zh_cn: 创建新的流程管理模块

source: The following is an example of how to create a process management module. It includes a section where all possible fields are defined as a reference. To create a new module only one field type is needed but consider that by convention the parameter user ID is used to impersonate all the actions in the module with another user than the one that triggers the action. Then it is a good practice to always include the key-value list field type along with any other needed field.
hu: A következő egy példa arra, hogy hogyan kell létrehozni egy folyamatkezelés modult. Tartalmaz egy szakaszt, ahol az összes lehetséges mező meg van határozva referenciaként. Egy új modul létrehozásához csak egy mezőtípus szükséges, de fontolja meg, hogy megegyezés szerint a felhasználó-azonosító paramétert használják az összes művelet megszemélyesítéséhez a modulban egy másik felhasználó nevében, ha az eltér attól, aki a műveletet aktiválta. Ekkor jó megoldás lehet a kulcs-érték pár lista mezőtípust minden esetben felvenni a többi szükséges mező mellett.
zh_cn: 下面是如何创建流程管理模块的示例。 它包括一个部分，其中所有可能的字段都被定义为一个引用。 要创建新模块，只需要一种字段类型，但考虑到按照惯例，用户ID参数用于模拟模块中的所有操作，而不是触发操作的用户。 然后，最好始终包含键值列表字段类型以及任何其它所需字段。

source: Process Management Module Code Example
hu: Folyamatkezelés modul kódpélda
zh_cn: 流程管理模块代码示例

source: The following code implements a dummy process management module that can be used in script task activities or sequence flow actions.
hu: A következő kód egy üres folyamatkezelés modult valósít meg, amely használható vezérelt feladat tevékenységekben vagy szekvenciafolyam-műveletekben.
zh_cn: 以下代码实现了一个虚拟的流程管理模块，可用于脚本任务活动或序列流操作。

source: In this case we are inheriting from ``Base`` class, and the object manager dependencies are set.
hu: Ebben az esetben a ``Base`` osztályból származtatunk le, és az objektumkezelő függőségei be vannak állítva.
zh_cn: 在本例中我们继承自 ``Base`` 类，并设置了对象管理器依赖项。

source: The constructor ``new()`` creates a new instance of the class. The configuration fields are defined here and they are set in ``$Self->{Config}``.
hu: A ``new()`` konstruktor hozza létre az osztály új példányát. A beállítási mezők itt vannak meghatározva, és a ``$Self->{Config}`` változóban vannak beállítva.
zh_cn: 构造函数 ``new()`` 创建一个新的类实例。 配置字段在这里定义，它们在 ``$Self->{Config}`` 中设置。

source: The configuration has two main entries:
hu: A beállításnak két fő bejegyzése van:
zh_cn: 该配置有两个主要条目：

source: This is used to explain the administrators what does the module do and/or considerations for its configuration.
hu: Ezt arra használják, hogy elmagyarázzák az adminisztrátoroknak, hogy mit csinál a modul és/vagy a beállítására vonatkozó megfontolásokhoz.
zh_cn: 这用于向管理员解释模块执行的操作和/或其配置注意事项。

source: This is just a container for the actual configuration fields.
hu: Ez csak egy tároló a tényleges beállítási mezőkhöz.
zh_cn: 这只是实际配置字段的容器。

source: All configuration fields requires a type that defines the kind of field and they could also have an internal description to be used as the title of the field widget. If it is not defined, a default description is used.
hu: Az összes beállítási mezőnek szüksége van egy típusra, amely meghatározza a mező fajtáját és tartalmazhat egy belső leírást is, amely a mező felületi elem címeként lesz használva. Ha ez nincs meghatározva, akkor egy alapértelmezett leírás lesz használva.
zh_cn: 所有配置字段都需要一个定义字段类型的类型，并且它们还可以具有内部描述以用作字段小部件的标题。 如果未定义，则使用默认描述。

source: Each field defines its configuration parameters and capabilities. The following is a small reference for the fields provided by OTRS out of the box.
hu: Minden egyes mező meghatározza a beállítási paramétereit és képességeit. A következő egy kis referencia azon mezőkhöz, amelyeket az OTRS alapértelmezetten biztosít.
zh_cn: 每个字段定义其配置参数和功能。 以下是OTRS提供的开箱即用的字段的小参考。

source: Used to define if a value is required to be set.
hu: Annak meghatározásához használják, hogy egy értéket kötelező-e beállítani.
zh_cn: 用于定义是否必须设置值。

source: Holds the information to display the drop-down field.
hu: Információkat tárol a legördülő lista megjelenítéséhez.
zh_cn: 保存信息以显示下拉选择框字段。

source: Simple hash that defines the options for the drop-down. The keys are used internally, and the values are the options that the user sees in the screen.
hu: Egyszerű kivonat, amely meghatározza a lehetőségeket a legördülőhöz. A kulcsok belsőleg lesznek használva és az értékek azok a lehetőségek, amelyeket a felhasználó a képernyőn lát.
zh_cn: 简单哈希定义下拉选择框的选项。 键在内部使用，值是用户在屏幕中看到的选项。

source: The name of the parameter.
hu: A paraméter neve.
zh_cn: 参数的名称。

source: To define if only one or multiple values can be selected.
hu: Annak meghatározásához, hogy csak egy vagy több értéket lehet kiválasztani.
zh_cn: 定义是否只能选择一个或多个值。

source: Defines if the list of values offer an empty value or not.
hu: Meghatározza, hogy az értékek listája ajánljon-e fel üres értéket vagy sem.
zh_cn: 定义值列表是否提供空值。

source: Defines how the options will be sorted when the field is rendered. The possible values are: ``AlphanumericValue``, ``NumericValue``, ``AlphanumericKey`` and ``NumericKey``.
hu: Meghatározza, hogy a lehetőségeket hogyan kell rendezni, amikor a mező megjelenik. A lehetséges értékek: ``AlphanumericValue``, ``NumericValue``, ``AlphanumericKey`` és ``NumericKey``.
zh_cn: 定义在渲染字段时如何对选项进行排序。 可能的值是：``AlphanumericValue``、``NumericValue``、``AlphanumericKey`` 和 ``NumericKey``。

source: Set if the displayed values should be translated.
hu: Beállítja, hogy a megjelenített értékeket le kell-e fordítani.
zh_cn: 设置是否应翻译显示的值。

source: Array of hashes that holds the default configuration for its key value pairs.
hu: Kivonatok tömbje, amely az alapértelmezett beállítást tárolja a kulcs-érték párjához.
zh_cn: 包含其键值对的默认配置的哈希数组。

source: The name of a parameter.
hu: Egy paraméter neve.
zh_cn: 参数的名称。

source: The default value of the parameter (optional).
hu: A paraméter alapértelmezett értéke (elhagyható).
zh_cn: 参数的默认值（可选）。

source: Mandatory parameters can not be renamed or removed (optional).
hu: A kötelező paramétereket nem lehet átnevezni vagy eltávolítani (elhagyható).
zh_cn: 不能重命名或删除必填参数（可选）。

source: Array of hashes that holds the default configuration each language and field part.
hu: Kivonatok tömbje, amely az alapértelmezett beállítómezőt tárolja minden egyes nyelvhez és mezőrészhez.
zh_cn: 哈希数组，包含每个语言和字段部分的默认配置。

source: This is composed by language such as ``en`` or ``es_MX``, followed by a ``_`` (underscore character) and then ``Subject`` or ``Body`` for the corresponding part of the field.
hu: Ezt egy nyelv alkotja, mint például ``en`` vagy ``es_MX``, amelyet egy ``_`` (aláhúzás karakter) követ, majd a ``Subject`` vagy ``Body`` szó a mező megfelelő részéhez.
zh_cn: 它由 ``en`` 或 ``es_MX`` 等语言组成，后跟一个 ``_`` （下划线字符），然后是 ``Subject`` 或 ``Body``，用于字段相应的部分。

source: The default value of the field part (optional).
hu: A mezőrész alapértelmezett értéke (elhagyható).
zh_cn: 字段部分的默认值（可选）。

source: No further configuration is provided for this kind of field.
hu: Nincs további beállítás megadva ennél a típusú mezőnél.
zh_cn: 没有为这种字段提供进一步的配置。

source: Array of hashes that holds the default configuration field (only the first element is used).
hu: Kivonatok tömbje, amely az alapértelmezett beállítómezőt tárolja (csak az első elem lesz használva).
zh_cn: 保存默认配置字段的哈希数组（仅使用第一个元素）。

source: The default value of the field.
hu: A mező alapértelmezett értéke.
zh_cn: 该字段的默认值。

source: The ``Run`` method is the main part of the module. First sets a common message that can be used in error logs or any other purpose. For consistency its highly recommended to use it as described above.
hu: A ``Run`` metódus a modul fő része. Először beállít egy szokásos üzenetet, amely hibanaplókban vagy egyéb célokra használható. A következetességért erősen ajánlott a használata, amint az fent bemutatásra került.
zh_cn: ``Run`` 方法是模块的主要部分。 首先设置可以在错误日志或任何其它目的中使用的公共消息。 为了保持一致性，强烈建议如上所述使用它。

source: Next step is to check if the global parameters was sent correctly.
hu: A következő lépés annak ellenőrzése, hogy a globális paraméterek helyesen lettek-e elküldve.
zh_cn: 下一步是检查是否正确发送了全局参数。

source: By convention all modules should be able to override the current user ID by one is provided in the parameters (if any). This passed user ID should be used in any function call that requires it.
hu: Megegyezés szerint az összes modulnak képesnek kell lennie felülírnia a jelenlegi felhasználó-azonosítót azzal, amit paraméterben adnak át (ha létezik). Ezt az átadott felhasználó-azonosítót kell használni minden függvényhívásban, amely igényli azt.
zh_cn: 按照惯例，所有模块都应该能够覆盖参数中提供的当前用户ID（如果有的话）。 此传递的用户ID应该在需要它的任何函数调用中使用。

source: User defined attribute values can use current ticket values by using OTRS smart tags. ``_ReplaceTicketAttributes`` is used for normal text attributes, while ``_ReplaceAdditionalAttributes`` for Rich Texts. For more complex parameters it might need customized functions to replace this smart tags.
hu: A felhasználó által meghatározott attribútumértékek használhatnak jelenlegi jegyértékeket az OTRS intelligens címkéivel. A ``_ReplaceTicketAttributes`` a normál szöveges attribútumoknál van használatban, míg a ``_ReplaceAdditionalAttributes`` a Rich Text szövegeknél. Az összetettebb paramétereknél szükséges lehet a függvények személyre szabása az intelligens címkék cseréjéhez.
zh_cn: 用户定义的属性值可以使用OTRS智能标签来使用当前工单值。 ``_ReplaceTicketAttributes`` 用于普通文本属性，而 ``_ReplaceAdditionalAttributes`` 用于富文本。 对于更复杂的参数，可能需要自定义函数来替换此智能标签。

source: The following is the proper logic of the module.
hu: Az ezután következő a modul megfelelő logikája.
zh_cn: 以下是该模块的正确逻辑。

source: If everything was OK it must return 1.
hu: Ha minden rendben volt, akkor 1-et kell visszaadnia.
zh_cn: 如果一切正常，则必须返回1。

source: Creating a New Process Management Module Configuration Field
hu: Egy új folyamatkezelés modul beállítási mező létrehozása
zh_cn: 创建新的流程管理模块配置字段
