Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: Dynamic Field Password files
hu: Dinamikus mező jelszó fájlok
zh_cn: Password动态字段的文件

source: Dynamic Field Configuration File Example
hu: Dinamikus mező beállítófájl példa
zh_cn: 动态字段配置文件示例

source: The configuration files are used to register the dynamic field types (driver) and the object type drivers for the back end object. They also store standard registrations for admin modules in the framework.
hu: A beállítófájlokat használják a dinamikus mező típusok (illesztőprogram) és az objektumtípus illesztőprogramok regisztrálásához a háttérprogram-objektum számára. Ezek szabványos regisztrációkat is tárolnak az adminisztrátori modulokhoz a keretrendszerben.
zh_cn: 配置文件用于注册后端对象的动态字段类型（驱动程序）和对象类型驱动程序。 它们还在框架中存储管理模块的标准注册。

source: In this section a configuration file for password dynamic field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy beállítófájl van megjelenítve és elmagyarázva.
zh_cn: 在本节中，将显示和解释password动态字段的配置文件。

source: This setting registers the password dynamic field driver for the back end module so it can be included in the list of available dynamic fields types. It also specify its own admin dialog in the key ``ConfigDialog``. This key is used by the master dynamic field admin module to manage this new dynamic field type.
hu: Ez a beállítás regisztrálja a jelszó dinamikus mező illesztőprogramot a háttérprogram-modulhoz, így az felvehető az elérhető dinamikus mezők típusainak listájába. A saját adminisztrátori párbeszédablakát is meghatározza a ``ConfigDialog`` kulcsban. Ezt a kulcsot a fő dinamikus mező adminisztrátori modul használja ennek az új dinamikus mező típusának a kezeléséhez.
zh_cn: 此设置为后端模块注册password动态字段驱动程序，以便它可以包含在可用动态字段类型列表中。 它还在键 ``ConfigDialog`` 中指定了自己的管理对话框。 主动态字段管理模块使用此键来管理此新的动态字段类型。

source: This is a standard module registration for the password admin dialog in the admin interface.
hu: Ez egy szabványos modulregisztráció a jelszó adminisztrátori párbeszédablakhoz az adminisztrátori felületen.
zh_cn: 这是管理界面中password管理对话框的标准模块注册。

source: Dynamic Field Admin Dialog Example
hu: Dinamikus mező adminisztrátori párbeszédablak példa
zh_cn: 动态字段管理对话框示例

source: The admin dialogs are standard admin modules to manage (add or edit) the dynamic fields.
hu: Az adminisztrátori párbeszédablakok szabványos adminisztrátori modulok a dinamikus mezők kezeléséhez (hozzáadás vagy szerkesztés).
zh_cn: 管理对话框是管理（添加或编辑）动态字段的标准管理模块。

source: In this section an admin dialog for password dynamic field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy adminisztrátori párbeszédablak van megjelenítve és elmagyarázva.
zh_cn: 在本节中，将显示和解释password动态字段的管理对话框。

source: The constructor ``new`` creates a new instance of the class. According to the coding guidelines objects of other classes that are needed in this module have to be created in ``new``.
hu: A ``new`` konstruktor hozza létre az osztály új példányát. A kódolási irányelvek szerint más osztályoknak azon objektumait kell a ``new`` konstruktorban létrehozni, amelyek ebben a modulban szükségesek.
zh_cn: 构造函数 ``new`` 创建了一个新的类实例。 根据编码指南，必须在 ``new`` 中创建此模块中所需的其它类的对象。

source: ``Run`` is the default function to be called by the web request. We try to make this function as simple as possible and let the helper functions to do the hard work.
hu: A ``Run`` a webkérés által meghívott alapértelmezett függvény. Megpróbáljuk ezt a függvényt annyira egyszerűvé tenni, amennyire csak lehetséges, és lehetővé tenni a segítő függvényeknek a kemény munka elvégzését.
zh_cn: ``Run`` 是Web请求调用的默认函数。 我们尝试使这个函数尽可能简单，并让helper函数完成艰苦的工作。

source: ``_Add`` function is also pretty simple, it just get some parameters from the web request and call the ``_ShowScreen()`` function. Normally this function is not needed to be modified.
hu: Az ``_Add`` függvény is nagyon egyszerű, csak lekér néhány paramétert a webkérésből, és meghívja a ``_ShowScreen()`` függvényt. Normális esetben ezt a függvényt nem szükséges módosítani.
zh_cn: ``_Add`` 函数也很简单，它只是从Web请求获取一些参数并调用 ``_ShowScreen()`` 函数。 通常，不需要修改此函数。

source: The ``_AddAction`` function gets the configuration parameters from a new dynamic field, and it validates that the dynamic field name only contains letters and numbers. This function could validate any other parameter.
hu: Az ``_AddAction`` függvény kéri le a beállítási paramétereket egy új dinamikus mezőből, és ellenőrzi, hogy a dinamikus mező neve csak betűket és számokat tartalmaz-e. Ez a függvény képes ellenőrizni bármilyen egyéb paramétert is.
zh_cn: `_AddAction`` 函数从新的动态字段中获取配置参数，并验证动态字段名称只包含字母和数字。 此函数可以验证任何其它参数。

source: ``Name``, ``Label``, ``FieldOrder``, ``Validity`` are common parameters for all dynamic fields and they are required. Each dynamic field has its specific configuration that must contain at least the ``DefaultValue`` parameter. In this case it also have ``ShowValue`` and ``ValueMask`` parameters for password field.
hu: A ``Name``, ``Label``, ``FieldOrder``, ``Validity`` közös paraméterek az összes dinamikus mezőnél, és ezek kötelezők. Minden egyes dinamikus mezőnek megvan a saját különleges beállítása, amelynek tartalmaznia kell legalább a ``DefaultValue`` paramétert. Ebben az esetben a ``ShowValue`` és a ``ValueMask`` paraméterekkel is rendelkezik a jelszómezőnél.
zh_cn: ``Name``、``Label``、``FieldOrder``、``Validity`` 是所有动态字段的通用参数，它们是必需的。 每个动态字段都有其特定的配置，必须至少包含 ``DefaultValue`` 参数。 在这种情况下，它还有密码字段的 ``ShowValue`` 和 ``ValueMask`` 参数。

source: If the field has the ability to store a fixed list of values they should be stored in the ``PossibleValues`` parameter inside the specific configuration hash.
hu: Ha a mező rendelkezik egy rögzített listájú értékek tárolásának képességével, akkor azokat a ``PossibleValues`` paraméterben kell tárolni a különleges beállítási kivonaton belül.
zh_cn: 如果该字段能够存储固定的值列表，则应将它们存储在特定配置哈希内的 ``PossibleValues`` 参数中。

source: As in other admin modules, if a parameter is not valid this function returns to the add screen highlighting the erroneous form fields.
hu: Mint más adminisztrátori modulokban, ha egy paraméter nem érvényes, akkor ez a függvény visszatér a hozzáadás képernyőre, kiemelve a hibás űrlapmezőket.
zh_cn: 与其它管理模块一样，如果参数无效，则此函数将返回添加屏幕，突出显示错误的表单字段。

source: If all the parameters are correct it creates a new dynamic field.
hu: Ha az összes paraméter helyes, akkor létrehoz egy új dinamikus mezőt.
zh_cn: 如果所有参数都正确，则会创建一个新的动态字段。

source: The ``_Change`` function is very similar to the ``_Add`` function but since this function is used to edit an existing field it needs to validated the ``FieldID`` parameter and gather the current dynamic field data.
hu: A ``_Change`` függvény nagyon hasonló az ``_Add`` függvényhez, de mivel ezt a függvényt egy meglévő mező szerkesztéséhez használják, ellenőriznie kell a ``FieldID`` paramétert, és be kell gyűjtenie a jelenlegi dinamikus mező adatait.
zh_cn: ``_Change`` 函数与 ``_Add`` 函数非常相似，但由于此函数用于编辑现有字段，因此需要验证 ``FieldID`` 参数并收集当前动态字段数据。

source: ``_ChangeAction()`` is very similar to ``_AddAction()``, but adapted for the update of an existing field instead of creating a new one.
hu: A ``_ChangeAction()`` nagyon hasonló az ``_AddAction()`` függvényhez, de át van írva egy meglévő mező frissítéséhez egy új létrehozása helyett.
zh_cn: ``_ChangeAction()`` 与 ``_AddAction()`` 非常相似，但适用于更新现有字段而不是创建新字段。

source: The ``_ShowScreen`` function is used to set and define the HTML elements and blocks from a template to generate the admin dialog HTML code.
hu: A ``_ShowScreen`` függvényt használják egy sablonból történő HTML elemek és blokkok beállítására és meghatározására az adminisztrátori párbeszédablak HTML kódjának előállításához.
zh_cn: ``_ShowScreen`` 函数用于设置和定义模板中的HTML元素和块，以生成管理对话框HTML代码。

source: Dynamic Field Template for Admin Dialog Example
hu: Dinamikus mező sablon az adminisztrátori párbeszédablak példához
zh_cn: 用于管理对话框的动态字段模块示例

source: The template is the place where the HTML code of the dialog is stored.
hu: A sablon az a hely, ahol a párbeszédablak HTML kódja el van tárolva.
zh_cn: 模板是存储对话框的HTML代码的位置。

source: In this section an admin dialog template for the password dynamic field is shown and explained.
hu: Ebben a szakaszban a jelszó dinamikus mezőhöz egy adminisztrátori párbeszédablak sablon van megjelenítve és elmagyarázva.
zh_cn: 在本节中，将显示和解释password动态字段的管理对话框模板。

source: This is common header that can be found in common OTRS modules.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban.
zh_cn: 这是可在常见OTRS模块中找到的通用标头。

source: This part of the code has the main box and also the actions side bar. No modifications are needed in this section.
hu: A kód ezen része rendelkezik a fő dobozzal és a műveletek oldalsávval is. Nincs szükség módosításokra ebben a szakaszban.
zh_cn: 这部分代码有主框和动作侧栏。 本部分不需要修改。

source: In this section of the code is defined the right part of the dialog. Notice that the value of the ``Action`` hidden input must match with the name of the admin dialog.
hu: A kód ezen szakaszában van meghatározva a párbeszédablak jobboldali része. Figyelje meg, hogy a rejtett ``Action`` beviteli mező értékének egyeznie kell az adminisztrátori párbeszédablak nevével.
zh_cn: 在这部分代码中定义了对话框的右侧部分。 请注意，``Action`` 隐藏输入的值必须与管理对话框的名称匹配。

source: This first widget contains the common form attributes for the dynamic fields. For consistency with other dynamic fields is recommended to leave this part of the code unchanged.
hu: Ez az első felületi elem tartalmazza a szokásos űrlapattribútumokat a dinamikus mezőkhöz. A többi dinamikus mezővel való következetességért javasolt a kód ezen részének változatlanul hagyása.
zh_cn: 第一个小部件包含动态字段的通用表单属性。为了与其它动态字段保持一致，建议保持代码的这部分不变。

source: The second widget has the dynamic field specific form attributes. This is the place where new attributes can be set and it could use JavaScript and AJAX technologies to make it more easy or friendly for the end user.
hu: A második felületi elem a dinamikus mezőre jellemző űrlapattribútumokkal rendelkezik. Ez az a hely, ahol az új attribútumok beállíthatók, és használhatnak JavaScript és AJAX technológiákat, hogy egyszerűbbé és barátságosabbá tegyék a végfelhasználó számára.
zh_cn: 第二个小部件具有特定于动态字段的表单属性。这是可以设置新属性的地方，它可以使用Javascript和AJAX技术使最终用户更容易或更友好。

source: The final part of the file contains the *Save* button and the *Cancel* link, as well as other needed JavaScript code.
hu: A fájl utolsó része tartalmazza a *Mentés* gombot és a *Mégse* hivatkozást, valamint az egyéb szükséges JavaScript kódot.
zh_cn: 文件的最后一部分包含 *保存* 按钮和 *取消* 链接，以及其它需要的JavaScript代码。

source: Dynamic Field Driver Example
hu: Dinamikus mező illesztőprogram példa
zh_cn: 动态字段驱动程序示例

source: The driver *is* the dynamic field. It contains several functions that are used wide in the OTRS framework. A driver can inherit some functions form base classes, for example ``TextArea`` driver inherits most of the functions from ``Base.pm`` and ``BaseText.pm`` and it only implements the functions that requires different logic or results. Checkbox field driver only inherits from ``Base.pm`` as all other functions are very different from any other base driver.
hu: Az illesztőprogram *maga a* dinamikus mező. Számos olyan függvényt tartalmaz, amelyet széles körben használnak az OTRS keretrendszerben. Egy illesztőprogram örökölhet néhány függvényt az alaposztályokból, például a ``TextArea`` illesztőprogram a ``Base.pm`` és a ``BaseText.pm`` fájlokból örökli a függvények legnagyobb részét, és csak azokat a függvényeket valósítja meg, amelyek eltérő logikát vagy eredményeket igényelnek. A jelölőnégyzet mező illesztőprogram csak a ``Base.pm`` fájlból örököl, mivel az összes többi függvény nagyon eltérő bármely más alap illesztőprogramtól.
zh_cn: 驱动程序 *即是* 动态字段。 它包含在OTRS框架中广泛使用的几个函数。 驱动程序可以从基类继承一些函数，例如 ``TextArea`` 驱动程序从 ``Base.pm`` 和 ``BaseText.pm`` 继承大多数函数，它只实现需要不同逻辑的函数或结果。 复选框字段驱动程序仅继承自 ``Base.pm``，因为所有其它函数与任何其它基本驱动程序非常不同。

source: Please refer to the Perl online documentation (POD) of the module ``/Kernel/System/DynmicField/Backend.pm`` to have the list of all attributes and possible return data for each function.
hu: Nézze meg a ``/Kernel/System/DynmicField/Backend.pm`` modul Perl On-line Dokumentációját (POD) az összes attribútum listája és a lehetséges visszatérési adatok megismeréséhez az egyes függvényeknél.
zh_cn: 请参阅模块 ``/Kernel/System/DynmicField/Backend.pm`` 的Perl在线文档（POD），以获得每个函数的所有属性和可能的返回数据的列表。

source: In this section the password dynamic field driver is shown and explained. This driver inherits some functions from ``Base.pm`` and ``BaseText.pm`` and only implements the functions that needs different results.
hu: Ebben a szakaszban a jelszó dinamikus mező illesztőprogram van bemutatva és elmagyarázva. Ez az illesztőprogram örököl néhány függvényt a ``Base.pm`` és a ``BaseText.pm`` fájlokból, és csak azokat a függvényeket valósítja meg, amelyek eltérő eredményeket igényelnek.
zh_cn: 在本节中，将显示和解释password动态字段驱动程序。 这个驱动程序继承了 ``Base.pm`` 和 ``BaseText.pm`` 中的一些函数，只实现了需要不同结果的函数。

source: This is the common header that can be found in common OTRS modules. The class/package name is declared via the ``package`` keyword. Notice that ``BaseText`` is used as base class.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a ``package`` kulcsszón keresztül van deklarálva. Figyelje meg, hogy a ``BaseText`` osztályt használják alaposztályként.
zh_cn: 这是可在常见OTRS模块中找到的通用标头。 类/包名称通过 ``package`` 关键字声明。 请注意，``BaseText`` 用作基类。

source: It is important to define the behaviors correctly as the field might or might not be used in certain screens, functions that depends on behaviors that are not active for this particular field might not be needed to be implemented.
hu: Fontos a viselkedéseket helyesen meghatározni, mivel a mező lehet használható vagy lehet nem használható bizonyos képernyőkön. Azokat a függvényeket esetleg nem szükséges megvalósítani, amelyek olyan viselkedésektől függenek, amelyek nem aktívak ennél a bizonyos mezőnél.
zh_cn: 正确定义行为非常重要，因为在某些屏幕中可能会或可能不会使用该字段，可能不需要实现依赖于对该特定字段不活动的行为的函数。

source: Drivers are created only by the ``BackendObject`` and not directly from any other module.
hu: Az illesztőprogramokat kizárólag a ``BackendObject`` hozza létre, és nem közvetlenül bármely egyéb modulból.
zh_cn: 驱动程序仅由 ``BackendObject`` 创建，而不是直接从任何其它模块创建。

source: This function is the responsible to create the HTML representation of the field and its label, and is used in the edit screens like ``AgentTicketPhone``, ``AgentTicketNote``, etc.
hu: Ez a függvény felelős a mező és annak címkéje HTML ábrázolásának létrehozásáért, és olyan szerkesztő képernyőkön használják, mint például az ``AgentTicketPhone``, ``AgentTicketNote``, stb.
zh_cn: 此函数负责创建字段及其标签的HTML呈现，并在编辑屏幕（如 ``AgentTicketPhone``、``AgentTicketNote`` 等）中使用。

source: ``DisplayValueRender()`` function returns the field value as a plain text as well as its title (both can be translated). For this particular example we are checking if the password should be revealed or display a predefined mask by a configuration parameter in the dynamic field.
hu: A ``DisplayValueRender()`` függvény egyszerű szövegként adja vissza a mező értékét és annak feliratát (mindkettő lefordítható). Ennél a bizonyos példánál azt ellenőrizzük, hogy a jelszót meg kell-e mutatni, vagy egy beállítási paraméter által előre meghatározott maszkot kell-e megjeleníteni a dinamikus mezőben.
zh_cn: ``DisplayValueRender()`` 函数返回字段值作为纯文本及其标题（两者都可以翻译）。 对于此特定示例，我们检查是否应显示密码或通过动态字段中的配置参数显示预定义的掩码。

source: This function is similar to ``DisplayValueRender()`` but is used in places where there is no ``LayoutObject``.
hu: Ez a függvény hasonló a ``DisplayValueRender()`` függvényhez, de olyan helyeken használják, ahol nincs ``LayoutObject``.
zh_cn: 此函数类似于 ``DisplayValueRender()`` 但是用于没有 ``LayoutObject`` 的地方。

source: Other Functions
hu: Egyéb függvények
zh_cn: 其它函数

source: The following are other functions that are might needed if the new dynamic field does not inherit from other classes. To see the complete code of this functions please take a look directly into the files ``Kernel/System/DynamicField/Driver/Base.pm`` and ``Kernel/System/DynamicField/Driver/BaseText.pm``.
hu: A következők olyan egyéb függvények, amelyek talán szükségesek lehetnek, ha egy új dinamikus mező nem örököl más osztályokból. Ezen függvények teljes kódjának megtekintéséhez nézzen bele közvetlenül a ``Kernel/System/DynamicField/Driver/Base.pm`` és a ``Kernel/System/DynamicField/Driver/BaseText.pm`` fájlokba.
zh_cn: 如果新动态字段不从其它类继承，则以下是可能需要的其它函数。 要查看此函数的完整代码，请直接查看文件 ``Kernel/System/DynamicField/Driver/Base.pm`` 和 ``Kernel/System/DynamicField/Driver/BaseText.pm``。

source: This function retrieves the value from the field on a specified object. In this case we are returning the first text value, since the field only stores one text value at time.
hu: Ez a függvény lekéri az értéket a mezőből egy adott objektumnál. Ebben az esetben az első szövegértéket adjuk vissza, mivel a mező egyszerre csak egy szövegértéket tárol.
zh_cn: 此函数从指定对象上的字段中检索值。 在这种情况下，我们返回第一个文本值，因为该字段仅存储一个文本值。

source: This function is used to store a dynamic field value. In this case this field only stores one text type value. Other fields could store more than one value on either ``ValueText``, ``ValueDateTime`` or ``ValueInt`` format.
hu: Ez a függvényt egy dinamikus mező érték tárolásához használják. Ebben az esetben a mező csak egy szöveg típusú értéket tárol. Más mezők tárolhatnak egynél több értéket is a ``ValueText``, a ``ValueDateTime`` vagy a ``ValueInt`` formátumnál.
zh_cn: 此函数用于存储动态字段值。 在这种情况下，该字段仅存储一个文本类型值。 其它字段可以用 ``ValueText``、``ValueDateTime`` 或 ``ValueInt`` 格式存储多个值。

source: This function is used to delete one field value attached to a particular object ID. For example if the instance of an object is to be deleted, then there is no reason to have the field value stored in the database for that particular object instance.
hu: Ezt a függvényt egy mező értékének törléséhez használják, amely egy bizonyos objektumazonosítóhoz van csatolva. Például ha egy objektum példánynak törlésére készülnek, akkor nincs oka a mezőérték tárolásának az adatbázisban annál a bizonyos objektumpéldánynál.
zh_cn: 此函数用于删除附加到特定对象ID的一个字段值。 例如，如果要删除对象的实例，则没有理由将该字段值存储在该特定对象实例的数据库中。

source: This function is used to delete all values from a certain dynamic field. This function is very useful when a dynamic field is going to be deleted.
hu: Ezt a függvényt az összes érték törléséhez használják egy bizonyos dinamikus mezőből. Ez a függvény nagyon hasznos, amikor egy dinamikus mező törlésre fog kerülni.
zh_cn: 此函数用于删除某个动态字段中的所有值。 要删除动态字段时，此功能非常有用。

source: This function is used to check if the value is consistent to its type.
hu: Ezt a függvényt annak ellenőrzéséhez használják, hogy az érték megegyezik-e a típusának.
zh_cn: 此函数用于检查值是否与其类型一致。

source: This function is used by ``TicketSearch`` core module to build the internal query to search for a ticket based on this field as a search parameter.
hu: Ezt a függvényt a ``TicketSearch`` alapmodul használja egy jegy kereséséhez szükséges belső lekérdezés felépítéséhez, ezt a mezőt alapul véve keresési paraméterként.
zh_cn: ``TicketSearch`` 核心模块使用此函数构建内部查询，以基于此字段作为搜索参数搜索工单。

source: This function is also a helper for ``TicketSearch`` module. ``$Param{TableAlias}`` should be kept and ``value_text`` could be replaced with ``value_date`` or ``value_int`` depending on the field.
hu: Ez a függvény szintén egy segítő a ``TicketSearch`` modulhoz. A ``$Param{TableAlias}`` paramétert meg kell tartani, és a ``value_text`` lecserélhető a ``value_date`` vagy a ``value_int`` paraméterrel a mezőtől függően.
zh_cn: 此函数也是 ``TicketSearch`` 模块的一个helper。 ``$Param{TableAlias}`` 应该保留，``value_text`` 可以用 ``value_date`` 或 ``value_int`` 替换，具体取决于字段。

source: This function is used in the edit screens of OTRS and its purpose is to get the value of the field, either from a template like generic agent profile or from a web request. This function gets the web request in the ``$Param{ParamObject}``, that is a copy of the ``ParamObject`` of the front end module or screen.
hu: Ezt a függvényt az OTRS szerkesztőképernyőin használják, és a célja a mező értékének lekérése vagy egy sablonból (mint például az általános ügyintéző profilból), vagy egy webkérésből. Ez a függvény megkapja a webkérést a ``$Param{ParamObject}`` paraméterben, amely az előtétprogram-modul vagy a képernyő ``ParamObject`` objektumának egy másolata.
zh_cn: 此函数用于OTRS的编辑屏幕，其目的是从自动任务配置文件或Web请求等模板获取字段的值。 此函数在 ``$Param{ParamObject}`` 中获取Web请求，它是前端模块或屏幕的 ``ParamObject`` 的副本。

source: There are two return formats for this function. The normal that is just the raw value or a structure that is the pair field name => field value. For example a date dynamic field returns normally the date as string, and if it should return a structure it returns a pair for each part of the date in the hash.
hu: Két visszatérési formátum létezik ennél a függvénynél. A normál, amely egyszerűen a nyers érték, vagy egy szerkezet, amely a mezőnév => mezőérték páros. Például egy dátum dinamikus mező normális esetben a dátumot szövegként adja vissza, és ha egy szerkezetet kell visszaadnia, akkor a kivonatban egy párost ad vissza a dátum minden egyes részéhez.
zh_cn: 此函数有两种返回格式。 通常只是 字段名称=>字段值 对的原始值或结构。 例如，日期动态字段通常将日期作为字符串返回，如果它应返回结构，则它会为散列中的日期的每个部分返回一对。

source: If the result should be a structure then, normally this is used to store its values in a template, like a generic agent profile. For example a date field uses several HTML components to build the field, like the used checkbox and selects for year, month, day etc.
hu: Ha az eredménynek egy szerkezetnek kell lennie, akkor normális esetben ezt arra használják, hogy az értékét egy sablonban tárolja, mint például egy általános ügyintéző profilban. Például egy dátummező számos HTML összetevőt használ a mező felépítéséhez, mint például a használt jelölőnégyzetet és kiválasztókat az évhez, hónaphoz, naphoz, stb.
zh_cn: 如果结果应该是结构，那么通常这用于将其值存储在模板中，如自动任务配置文件。 例如，日期字段使用多个HTML组件来构建字段，如使用的复选框，并选择年、月、日等。

source: This function should provide at least a method to validate if the field is empty, and return an error if the field is empty and mandatory, but it can also do more validations for other kind of fields, like if the option selected is valid, or if a date should be only in the past etc. It can provide a custom error message also.
hu: Ennek a függvénynek biztosítania kell legalább egy metódust az ellenőrzéshez, ha a mező üres, és hibát kell visszaadnia, ha a mező üres és kötelező, de végrehajthat további ellenőrzéseket is a másfajta mezőknél, mint például ha a kiválasztott lehetőség érvényes, vagy ha egy dátumnak csak a múltban kell lennie, stb. Egy egyéni hibaüzenetet is biztosíthat.
zh_cn: 此函数应至少提供一种方法来验证字段是否为空，如果字段为空且是必需的，则返回错误，但它也可以对其它类型的字段执行更多验证，例如，如果选择的选项有效，或者日期是否应仅在过去等。它也可以提供自定义错误消息。

source: This function is used by ticket search dialog and it is similar to ``EditFieldRander()``, but normally on a search screen small changes has to be done for all fields. For this example we use a HTML text input instead of a password input. In other fields like drop-down field is displayed as a multiple select in order to let the user search for more than one value at a time.
hu: Ezt a függvényt a jegykeresés párbeszédablak használja, és hasonló a ``EditFieldRander()`` függvényhez, de normális esetben egy keresési képernyőn kisebb változtatásokat kell elvégezni az összes mezőnél. Például ebben az esetben egy HTML szöveges beviteli mező használunk egy jelszóbeviteli mező helyett. Más mezőkben (például legördülő lista) többválasztósként jelenik meg azért, hogy egyszerre több érték keresését tegye lehetővé a felhasználónak.
zh_cn: 工单搜索对话框使用此函数，它类似于 ``EditFieldRander()``，但通常在搜索屏幕上，必须对所有字段进行小的更改。 对于此示例，我们使用HTML文本输入而不是密码输入。 在其它字段中，下拉字段显示为多选，以便让用户一次搜索多个值。
