Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: Create a configuration file to register the new back end and drivers extensions and behaviors.
hu: Hozzon létre egy beállítófájlt az új háttérprogram és az illesztőprogramok kiterjesztéseinek és viselkedéseinek regisztrálásához.
zh_cn: 创建一个配置文件以注册新的后端和驱动程序扩展和行为。

source: Other Extensions
hu: Egyéb kiterjesztések
zh_cn: 其它扩展

source: Other extensions could be a combination of the above examples.
hu: Egyéb kiterjesztések lehetnek a fenti példák kombinációi.
zh_cn: 其它扩展可以是上述示例的组合。

source: Dynamic Fields Framework
hu: Dinamikus mezők keretrendszer
zh_cn: 动态字段框架

source: Before creating new dynamic fields is necessary to understand its framework and how OTRS screens interact with them, as well as their underlying API.
hu: Az új dinamikus mezők létrehozása előtt szükséges megérteni azok keretrendszerét, és hogy az OTRS képernyők hogyan lépnek kölcsönhatásba azokkal, valamint a mögöttes API-t.
zh_cn: 在创建新的动态字段之前，有必要了解它的框架以及OTRS屏幕如何与它们以及它们的底层API交互。

source: The following picture shows the architecture of the dynamic fields framework.
hu: A következő kép a dinamikus mezők keretrendszer szerkezetét mutatja be.
zh_cn: 下图显示了动态字段框架的体系结构。

source: Dynamic Field Back End Modules
hu: Dinamikus mező háttérprogram-modulok
zh_cn: 动态字段后端模块

source: Dynamic Field (Back End)
hu: Dinamikus mező (háttérprogram)
zh_cn: 动态字段（后端）

source: Normally called as ``BackendObject`` in the front end modules is the mediator between the front end modules and each specific dynamic field implementation or driver. It defines a generic middle API for all dynamic field drivers, and each driver has the responsibility to implement the middle API for the specific needs for the field.
hu: Az előtétprogram modulokban normális esetben a ``BackendObject`` nevű objektum a közvetítő az előtétprogram modulok és az egyes konkrét dinamikus mező megvalósítás vagy illesztőprogram között. Ez határoz meg egy általános közbenső API-t az összes dinamikus mező illesztőprogramhoz, és az egyes illesztőprogramok felelőssége a közbenső API megvalósítása a mező sajátos szükségleteihez.
zh_cn: 通常在前端模块中称为 ``BackendObject``，是前端模块与每个特定动态字段实现或驱动程序之间的中介。它为所有动态字段驱动程序定义了通用的中间API，并且每个驱动程序都有责任为字段的特定需求实现中间API。

source: The dynamic field back end is the master controller of all the drivers. Each function in this module is responsible to check the required parameters and call the same function in the specific driver according to the dynamic field configuration parameter received.
hu: A dinamikus mező háttérprogram az összes illesztőprogram fő vezérlője. Ebben a modulban minden egyes függvény felelős a szükséges paraméterek ellenőrzéséért, és ugyanazon függvény meghívásáért az adott illesztőprogramban a kapott dinamikus mező beállítási paraméter szerint.
zh_cn: 动态字段后端是所有驱动程序的主控制器。此模块中的每个函数负责检查所需的参数，并根据接收到的动态字段配置参数在特定驱动程序中调用相同的函数。

source: This module is also responsible to call specific functions on each object type delegate (like ``Ticket`` or ``Article``) e.g. to add a history entry or fire an event.
hu: Ez a modul felelős bizonyos függvények meghívásáért is minden egyes objektumtípus delegáltnál (úgymint ``Ticket`` vagy ``Article``). Például egy előzmény bejegyzés hozzáadásához vagy egy esemény elsütéséhez.
zh_cn: 此模块还负责调用每个对象类型委托上的特定函数（如 ``Ticket`` 或 ``Article``），例如添加一个历史记录条目或触发一个事件。

source: This module is located in ``$OTRS_HOME/Kernel/System/DynamicField/Backend.pm``.
hu: Ez a modul az ``$OTRS_HOME/Kernel/System/DynamicField/Backend.pm`` fájlban található.
zh_cn: 此模块位于 ``$OTRS_HOME/Kernel/System/DynamicField/Backend.pm``。

source: Dynamic Field Drivers
hu: Dinamikus mező illesztőprogramok
zh_cn: 动态字段驱动程序

source: A dynamic field driver is the implementation of the dynamic field. Each driver must implement all the mandatory functions specified in the back end (there are some functions that depends on a behavior and it is not needed to implement those if the dynamic field does not have that particular behavior).
hu: Egy dinamikus mező illesztőprogram a dinamikus mező megvalósítása. Minden egyes illesztőprogramnak meg kell valósítania a háttérprogramban meghatározott összes kötelező függvényt (van néhány olyan függvény, amely egy viselkedéstől függ, és nem szükséges megvalósítani azokat, ha a dinamikus mező nem rendelkezik azzal a bizonyos viselkedéssel).
zh_cn: 动态字段驱动程序是动态字段的实现。每个驱动程序都必须实现后端中指定的所有强制函数（有些函数依赖于某个行为，如果动态字段没有该特定行为，则不需要实现这些函数）。

source: A driver is responsible to know how to get its own value or values from a web request, or from a profile (like a search profile). It also needs to know the HTML code to render the field in edit or display screens, or how to interact with the stats module, among other functions.
hu: Egy illesztőprogram felelős annak ismeretéért, hogy hogyan kérje le a saját értékét vagy értékeit egy webkérésből vagy egy profilból (mint például egy keresési profilból). Szükséges tudnia a HTML kódot is a szerkesztő vagy megjelenítő képernyőkön lévő mező megjelenítéséhez, vagy hogy hogyan lépjen kölcsönhatásba a statisztikák modullal, többek között a függvényekkel.
zh_cn: 驱动程序负责知道如何从Web请求或配置文件（如搜索配置文件）获取自己的值。它还需要知道在编辑或显示屏幕中呈现字段的HTML代码，或者如何与统计模块交互，以及其它函数。

source: These modules are located in ``$OTRS_HOME/Kernel/System/DynamicField/Driver/*.pm``.
hu: Ezek a modulok az ``$OTRS_HOME/Kernel/System/DynamicField/Driver/*.pm`` fájlokban találhatók.
zh_cn: 这些模块位于 ``$OTRS_HOME/Kernel/System/DynamicField/Driver/*.pm``。

source: It exists some base drivers like ``Base.pm``, ``BaseText.pm``, ``BaseSelect.pm`` and ``BaseDateTime.pm``, that implements common functions for certain drivers (e.g. driver ``TextArea.pm`` uses ``BaseText.pm`` that also uses ``Base.pm`` then ``TextArea`` only needs to implement the functions that are missing in ``Base.pm`` and ``BateText.pm`` or the ones that are special cases).
hu: Létezik néhány alap illesztőprogram, úgymint ``Base.pm``, ``BaseText.pm``, ``BaseSelect.pm`` és ``BaseDateTime.pm``, amely gyakori függvényeket valósít meg bizonyos illesztőprogramokhoz (például a ``TextArea.pm`` illesztőprogram a ``BaseText.pm`` fájlt használja, amely a ``Base.pm`` fájlt használja, ekkor a ``TextArea`` csak azon függvények megvalósítását igényli, amelyek hiányoznak a ``Base.pm`` és ``BateText.pm`` fájlokból, vagy azokat, amelyek különleges esetek).
zh_cn: 存在一些基本驱动程序，如 ``Base.pm``、 ``BaseText.pm``、 ``BaseSelect.pm`` 和 ``BaseDateTime.pm``，它们为某些驱动程序实现通用（例如，``TextArea.pm`` 驱动程序使用 ``BaseText.pm`` 也使用 ``Base.pm`` ，然后 ``TextArea`` 只需要实现 ``Base.pm`` 和 ``BaseText.pm`` 缺失的函数或某些特殊情况的函数）。

source: The following is the drivers inheritance tree:
hu: A következő az illesztőprogramok öröklődési fája:
zh_cn: 以下是驱动程序继承树：

source: Object Type Delegate
hu: Objektumtípus delegált
zh_cn: 对象类型委托

source: An object type delegate is responsible to perform specific functions on the object linked to the dynamic field. These functions are triggered by the back end object as they are needed.
hu: Egy objektumtípus delegált felelős bizonyos függvények végrehajtásáért a dinamikus mezőhöz kapcsolt objektumon. Ezeket a függvényeket a háttérprogram objektum aktiválja, amint szükség van rájuk.
zh_cn: 对象类型委托负责对链接到动态字段的对象执行特定功能。这些功能是由后端对象根据需要触发的。

source: These modules are located in ``$OTRS_HOME/Kernel/System/DynamicField/ObjectType/*.pm``.
hu: Ezek a modulok az ``$OTRS_HOME/Kernel/System/DynamicField/ObjectType/*.pm`` fájlokban találhatók.
zh_cn: 这些模块位于 ``$OTRS_HOME/Kernel/System/DynamicField/ObjectType/*.pm``。

source: Dynamic Fields Admin Modules
hu: Dinamikus mezők adminisztrátori moduljai
zh_cn: 动态字段管理模块

source: To manage the dynamic fields (add, edit and list) a series of modules has been already developed. There is one specific master module (``AdminDynamicField.pm``) that shows the list of defined dynamic fields, and from within other modules are called to create new dynamic fields or modify an existing ones.
hu: A dinamikus mezők kezeléséhez (hozzáadás, szerkesztés és felsorolás) már egy csomó modul van kifejlesztve. Van egy bizonyos fő modul (``AdminDynamicField.pm``), amely megjeleníti a meghatározott dinamikus mezők listáját, és más modulokon belülről hívják meg új dinamikus mezők létrehozásához vagy a meglévők módosításához.
zh_cn: 为了管理动态字段（添加、编辑和列出），已经开发了一系列模块。有一个特定的主模块（``AdminDynamicField.pm``），它显示定义的动态字段列表，并从其它模块中调用以创建新的动态字段或修改现有的动态字段。

source: Normally a dynamic field driver needs its own admin module (admin dialog) to define its properties. This dialog might differ from other drivers. But this is not mandatory, drivers can share admin dialogs, if they can provide needed information for all the drivers that are linked to them, no matter if they are from different type. What is mandatory is that each driver must be linked to an admin dialog (e.g. text and textarea drivers share ``AdminDynamicFieldText.pm`` admin dialog, and date and date/time drivers share ``AdminDynamicFieldDateTime.pm`` admin dialog).
hu: Normális esetben egy dinamikus mező illesztőprogramnak saját adminisztrátori modulra van szüksége (adminisztrátori párbeszédablak) a tulajdonságai meghatározásához. Ez a párbeszédablak esetleg eltérhet a többi illesztőprogramtól. De ez nem kötelező, az illesztőprogramok megoszthatják az adminisztrátori párbeszédablakokat, ha szükséges információkat biztosíthatnak az összes olyan illesztőprogramhoz, amelyek hozzájuk vannak kapcsolva, nem számít, hogy eltérő típusból származnak. Ami kötelező, hogy minden egyes illesztőprogramnak hozzákapcsolva kell lennie egy adminisztrátori párbeszédablakhoz (például a szöveg és a szövegterület illesztőprogramok megosztják az ``AdminDynamicFieldText.pm`` adminisztrátori párbeszédablakot, és a dátum és a dátum/idő illesztőprogramok megosztják az ``AdminDynamicFieldDateTime.pm`` adminisztrátori párbeszédablakot).
zh_cn: 通常，动态字段驱动程序需要自己的管理模块（管理对话框）来定义其属性。此对话框可能与其它驱动程序不同。但这不是强制性的，驱动程序可以共享管理对话框，前提是它们可以为链接到它们的所有驱动程序提供所需的信息，无论它们来自不同的类型。必须将每个驱动程序链接到管理对话框（例如，文本和文本区域驱动程序共享 ``AdminDynamicFieldText.pm`` 管理对话框，以及日期和日期/时间驱动程序共享 ``AdminDynamicFieldDateTime.pm`` 管理对话框）。

source: Admin dialogs follow the normal OTRS admin module rules and architecture. But for standardization all configuration common parts to all dynamic fields should have the same look and feel among all admin dialogs.
hu: Az adminisztrátori párbeszédablakok a normál OTRS adminisztrátori modulszabályokat és szerkezetet követik. De a szabványosításhoz az összes beállítás közös részének az összes dinamikus mezőnél ugyanolyan megjelenésűnek kell lennie az összes adminisztrátori párbeszédablaknál.
zh_cn: 管理对话框遵循正常的OTRS管理模块规则和体系结构。但是为了标准化，所有动态字段的所有配置公共部分在所有管理对话框中应该具有相同的外观和感觉。

source: These modules are located in ``$OTRS_HOME/Kernel/Modules/*.pm``.
hu: Ezek a modulok az ``$OTRS_HOME/Kernel/Modules/*.pm`` fájlokban találhatók.
zh_cn: 这些模块位于 ``$OTRS_HOME/Kernel/Modules/*.pm``。

source: Each admin dialog needs its corresponding HTML template file (``.tt``).
hu: Minden adminisztrátori párbeszédablaknak szüksége van a neki megfelelő HTML sablonfájlra (``.tt``).
zh_cn: 每个管理对话框都需要相应的HTML模板文件（``.tt``）。

source: Dynamic Fields Core Modules
hu: Dinamikus mezők alapmoduljai
zh_cn: 动态字段核心模块

source: This modules reads and writes the dynamic fields information from and to the database tables.
hu: Ezek a modulok olvassák és írják a dinamikus mezők információit az adatbázistáblákban.
zh_cn: 此模块从数据库表读取动态字段信息并将其写入数据库表。

source: This module is responsible to manage the dynamic field definitions. It provides the basic API for add, change, delete, list and get dynamic fields. This module is located in ``$OTRS_HOME/Kernel/System/DynamicField.pm``.
hu: Ez a modul felelős a dinamikus mező meghatározások kezeléséért. Ez biztosítja az alap API-t a hozzáadáshoz, megváltoztatáshoz, törléshez, felsoroláshoz és a dinamikus mezők lekéréséhez. Ez a modul az ``$OTRS_HOME/Kernel/System/DynamicField.pm`` fájlban található.
zh_cn: 此模块负责管理动态字段定义。它为添加、更改、删除、列出和获取动态字段提供了基本的API。此模块位于 ``$OTRS_HOME/Kernel/System/DynamicField.pm``。

source: This module is responsible to read and write dynamic field values into the form and into the database. This module is highly used by the drivers and is located in ``$OTRS_HOME/Kernel/System/DynamicFieldValue.pm``.
hu: Ez a modul felelős a dinamikus mező értékeinek olvasásáért és írásáért az űrlapon és az adatbázisban. Ezt a modult erősen használják az illesztőprogramok, és az ``$OTRS_HOME/Kernel/System/DynamicFieldValue.pm`` fájlban található.
zh_cn: 此模块负责将动态字段值读写到表单和数据库中。此模块被驱动程序高度使用，位于 ``$OTRS_HOME/Kernel/System/DynamicFieldValue.pm``。

source: Dynamic Fields Database Tables
hu: Dinamikus mezők adatbázistáblái
zh_cn: 动态字段数据库表

source: There are two tables in the database to store the dynamic field information:
hu: Két tábla van az adatbázisban a dinamikus mező információinak tárolásához:
zh_cn: 数据库中有两个表用于存储动态字段信息：

source: Used by the core module ``DynamicField.pm``, it stores the dynamic field definitions.
hu: A ``DynamicField.pm`` alapmodul használja, és a dinamikus mező meghatározásokat tárolja.
zh_cn: 由核心模块 ``DynamicField.pm`` 使用，它存储动态字段定义。

source: Used by the core module ``DynamicFieldValue.pm`` to save the dynamic field values for each dynamic field and each object type instance.
hu: A ``DynamicFieldValue.pm`` alapmodul használja a dinamikus mező értékeinek mentéséhez minden egyes dinamikus mező és minden egyes objektumtípus példánynál.
zh_cn: 由核心模块 ``DynamicFieldValue.pm`` 用于保存每个动态字段和每个对象类型实例的动态字段值。

source: Dynamic Fields Configuration Files
hu: Dinamikus mezők beállítófájljai
zh_cn: 动态字段配置文件

source: The back end module needs a way to know which drivers exists and since the amount of drivers can be easily extended. The easiest way to manage them is to use the system configuration, where the information of dynamic field drivers and object type drivers can be stored and extended.
hu: A háttérprogram-modulnak szüksége van egy módra megtudni azt, hogy mely illesztőprogramok léteznek, mivel az illesztőprogramok mennyisége egyszerűen kiterjeszthető. Ezek kezelésének legegyszerűbb módja a rendszerbeállítás használata, ahol a dinamikus mező illesztőprogramok és az objektumtípus illesztőprogramok információi eltárolhatók és kiterjeszthetők.
zh_cn: 后端模块需要一种方法来了解哪些驱动程序存在，并且因为驱动程序的数量可以轻松扩展。 管理它们的最简单方法是使用系统配置，其中可以存储和扩展动态字段驱动程序和对象类型驱动程序的信息。

source: The master admin module also needs to know this information about the available dynamic field drivers to use the admin dialog linked with, to create or modify the dynamic fields.
hu: A fő adminisztrátori modulnak is szükséges tudnia ezeket az információkat az elérhető dinamikus mező illesztőprogramokról a hozzájuk kapcsolt adminisztrátori párbeszédablakok használatához, a dinamikus mezők létrehozásához vagy módosításához.
zh_cn: 主管理模块还需要知道有关可用动态字段驱动程序的信息，以使用与之链接的管理对话框来创建或修改动态字段。

source: Front end modules need to read the system configuration to know which dynamic fields are active for each screen and which ones are also mandatory. For example: ``Ticket::Frontend::AgentTicketPhone###DynamicField`` stores the active, mandatory and inactive dynamic fields for *New Phone Ticket* screen.
hu: Az előtétprogram-moduloknak szükségük van a rendszerbeállítások olvasására megtudni azt, hogy mely dinamikus mezők vannak bekapcsolva az egyes képernyőknél, és melyek kötelezőek. Például a ``Ticket::Frontend::AgentTicketPhone###DynamicField`` tárolja az aktív, kötelező és inaktív dinamikus mezőket az *Új telefonos jegy* képernyőnél.
zh_cn: 前端模块需要读取系统配置以了解每个屏幕的哪些动态字段是活动的，哪些是强制性的。 例如：``Ticket::Frontend::AgentTicketPhone###DynamicField`` 存储 *新建电话工单* 屏幕的活动、必填和非活动的动态字段。

source: Dynamic Field Interaction With Front End Modules
hu: Dinamikus mező kölcsönhatása az előtétprogram-modulokkal
zh_cn: 动态字段与前端模块交互

source: Knowing about how front end modules interact with dynamic fields is not strictly necessary to extend dynamic fields for the ticket or article objects, since all the screens that could use the dynamic fields are already prepared. But in case of custom developments or to extend the dynamic fields to other objects is very useful to know how to access dynamic fields framework from a front end module.
hu: Ismerve azt, hogy az előtétprogram-modulok hogyan lépnek kölcsönhatásba a dinamikus mezőkkel, nem feltétlenül szükséges a dinamikus mezők kiterjesztése a jegy vagy bejegyzés objektumokhoz, mivel már elő van készítve az összes olyan képernyő, amely dinamikus mezőket tud használni. De egyéni fejlesztések esetén vagy a dinamikus mezők más objektumokhoz történő kiterjesztéséhez nagyon hasznos tudni, hogy a dinamikus mezők keretrendszere hogyan érhető el egy előtétprogram-modulból.
zh_cn: 了解前端模块如何与动态字段交互并不是扩展工单或信件对象的动态字段所必需的，因为可以使用动态字段的所有屏幕都已经准备好了。但在定制开发或将动态字段扩展到其它对象的情况下，了解如何从前端模块访问动态字段框架非常有用。

source: The following picture shows a simple example of how the dynamic fields interact with other OTRS framework parts.
hu: A következő kép egy egyszerű példáját mutatja be annak, hogy a dinamikus mezők hogyan lépnek kölcsönhatásba az OTRS keretrendszer többi részével.
zh_cn: 下图显示了动态字段如何与其它OTRS框架部分交互的简单示例。

source: Dynamic Field Interaction
hu: Dinamikus mezők kölcsönhatása
zh_cn: 动态字段交互

source: The first step is that the front end module reads the configured dynamic fields. For example ``AgentTicketNote`` should read ``Ticket::Frontend::AgentTicketNote###DynamicField`` setting. This setting can be used as the filter parameter for ``DynamicField`` core module function ``DynamicFieldListGet()``. The screen can store the results of this function to have the list of the dynamic fields activated for this particular screen.
hu: Az első lépés, hogy az előtétprogram-modul beolvassa a beállított dinamikus mezőket. Például az ``AgentTicketNote`` modulnak be kell olvasnia a ``Ticket::Frontend::AgentTicketNote###DynamicField`` beállítást. Ez a beállítás használható szűrőparaméterként a ``DynamicFieldListGet()`` ``DynamicField`` alapmodul függvénynél. A képernyő tárolhatja ennek a függvénynek az eredményeit, hogy meglegyen az aktivált dinamikus mezők listája ennél a bizonyos képernyőnél.
zh_cn: 第一步是前端模块读取配置的动态字段。 例如，``AgentTicketNote`` 应该读取 ``Ticket::Frontend::AgentTicketNote###DynamicField`` 设置。 此设置可用作 ``DynamicField`` 核心模块函数 ``DynamicFieldListGet()`` 的过滤器参数。 该屏幕可以存储此功能的结果，以便为此特定屏幕激活动态字段列表。

source: Next, the screen should try to get the values from the web request. It can use the back end object function ``EditFieldValueGet()`` for this purpose, and can use this values to trigger ACLs. The back end object will use each driver to perform the specific actions for all functions.
hu: Ezután a képernyőnek meg kell próbálnia lekérni az értékeket a webkérésből. Erre a célra használhatja az ``EditFieldValueGet()`` háttérprogram-objektum függvényt, és használhatja ezeket az értékeket az ACL-ek aktiválásához. A háttérprogram-objektum minden egyes illesztőprogramot használni fog a különleges műveletek végrehajtásához az összes függvénynél.
zh_cn: 接下来，该屏幕应该尝试从Web请求中获取值。 为此，它可以使用后端对象函数 ``EditFieldValueGet()``，并可以使用此值来触发ACL。 后端对象将使用每个驱动程序执行所有功能的特定操作。

source: To continue, the screen should get the HTML for each field to display it. The back end object function ``EditFieldRender()`` can be used to perform this action and the ACLs restriction as well as the values from the web request can be passed to this function in order to get better results. In case of a submit the screen could also use the back end object function ``EditFieldValueValidate()`` to check the mandatory fields.
hu: A folytatáshoz a képernyőnek le kell kérnie a HTML-t minden egyes mezőhöz annak megjelenítéséhez. Az ``EditFieldRender()`` háttérprogram-objektum függvény használható ezen művelet és az ACL-ek korlátozásának végrehajtásához, valamint a webkérésből származó értékek átadhatók ennek a függvénynek azért, hogy jobb eredményeket kapjon. Egy elküldés esetén a képernyő használhatja az ``EditFieldValueValidate()`` háttérprogram-objektum függvényt is a kötelező mezők ellenőrzéséhez.
zh_cn: 要继续，该屏幕应获取每个字段的HTML以显示它。 后端对象函数 ``EditFieldRender()`` 可用于执行此操作，并且可以将ACL限制以及Web请求中的值传递给此函数，以获得更好的结果。 如果提交，该屏幕也可以使用后端对象函数 ``EditFieldValueValidate()`` 来检查必填字段。

source: Other screens could use ``DisplayFieldRender()`` instead of ``EditFieldRender()`` if the screen only shows the field value, and in such case no value validation is needed.
hu: A többi képernyő használhatja a ``DisplayFieldRender()`` függvényt az ``EditFieldRender()`` helyett, ha a képernyő csak a mezőértéket jeleníti meg, és ilyen esetben nincs szükség értékellenőrzésre.
zh_cn: 如果屏幕只显示字段值，则其它屏幕可以使用 ``DisplayFieldRender()`` 而不是 ``EditFieldRender()``，在这种情况下，不需要进行值验证。

source: To store the value of the dynamic field is necessary to get the object ID. For this example if the dynamic field is linked to a ticket object, the screen should already have the ``TicketID``, otherwise if the field is linked to an article object in order to set the value of the field is necessary to create the article first. ``ValueSet()`` from the back end object can be used to set the dynamic field value.
hu: A dinamikus mező értékének tárolásához szükséges az objektumazonosító lekérése. Ennél a példánál ha a dinamikus mező hozzá van kapcsolva egy jegy objektumhoz, akkor a képernyőnek már rendelkeznie kell a ``TicketID`` azonosítóval, egyébként ha a mező hozzá van kapcsolva egy bejegyzés objektumhoz azért, hogy beállítsa a mező értékét, akkor először a bejegyzés létrehozása szükséges. A háttérprogram-objektumból a ``ValueSet()`` függvény használható a dinamikus mező értékének beállításához.
zh_cn: 要获取对象ID，需要存储动态字段的值。 对于此示例，如果动态字段链接到工单对象，则屏幕应该已经具有 ``TicketID``，否则如果该字段链接到信件对象，要设置该字段的值，则必须首先创建该信件。 后端对象的 ``ValueSet()`` 可用于设置动态字段值。

source: In summary the front end modules does not need to know how each dynamic field works internally to get or set their values or to display them. It just needs to call the back end object module and use the fields in a generic way.
hu: Összefoglalva, az előtétprogram-moduloknak nem szükséges tudniuk, hogy az egyes dinamikus mezők hogyan működnek belsőleg azért, hogy lekérjék vagy beállítsák az értékeiket vagy megjelenítsék azokat. Egyszerűen csak meg kell hívnia a háttérprogram-objektum modult, és általános módon kell használnia a mezőket.
zh_cn: 总之，前端模块不需要知道每个动态字段是如何在内部工作来获取或设置它们的值或显示它们。它只需要调用后端对象模块并以通用的方式使用字段。

source: Creating A New Dynamic Field
hu: Egy új dinamikus mező létrehozása
zh_cn: 创建一个新动态字段

source: To illustrate this process a new dynamic field *Password* will be created. This new dynamic field type will show a new password field to ticket or article objects. Since is very similar to a text dynamic field we will use the ``Base`` and ``BaseText`` drivers as a basis to build this new field.
hu: A folyamat bemutatásához egy új *Jelszó* dinamikus mező lesz létrehozva. Ez az új dinamikus mező típus egy új jelszómezőt fog megjeleníteni a jegy és a bejegyzés objektumokhoz. Mivel nagyon hasonló egy szöveg dinamikus mezőhöz, ezért a ``Base`` és a ``BaseText`` illesztőprogramokat fogjuk használni alapként ezen új mező felépítéséhez.
zh_cn: 为了说明此过程，将创建一个新的动态字段 *Password*。 此新动态字段类型将为工单或信件对象显示新的密码字段。 由于与文本动态字段非常相似，我们将使用 ``Base`` 和 ``BaseText`` 驱动程序作为构建此新字段的基础。

source: This new password field implementation is just for educational purposes, it does not provide any level of security and is not recommended for production systems.
hu: Az új jelszómező megvalósítása csak oktatási célokra van, nem biztosít semmilyen biztonsági szintet, és nem ajánlott termelési rendszereknél.
zh_cn: 此新密码字段实现仅用于教育目的，它不提供任何级别的安全性，不建议用于生产系统。

source: To create this new dynamic field we will create 4 files:
hu: A dinamikus mező létrehozásához négy fájlt fogunk létrehozni:
zh_cn: 要创建这个新的动态字段，我们将创建4个文件：

source: An admin dialog module (Perl) to setup the field options.
hu: Egy adminisztrátori párbeszédablak modult (Perl) a mezőlehetőségek beállításához.
zh_cn: 一个用于设置字段选项的管理对话框模块（Perl）。

source: A template module for the admin dialog.
hu: Egy sablonmodult az adminisztrátori párbeszédablakhoz.
zh_cn: 一个管理对话框的模板模块。

source: A dynamic field driver (Perl).
hu: Egy dinamikus mező illesztőprogramot (Perl).
zh_cn: 一个动态字段驱动程序（Perl）。
