Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: Next we will show how to develop a new operation, each operation has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új műveletet kifejleszteni. Minden egyes műveletnek meg kell valósítania ezeket a szubrutinokat:
zh_cn: 接下来我们将展示如何开发一个新操作，每个操作都必须实现这些子程序：

source: We should implement each one of this methods in order to be able to execute the action handled by the provider (``Kernel/GenericInterface/Provider.pm``).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk végrehajtani a szolgáltató által kezelt műveletet (``Kernel/GenericInterface/Provider.pm``).
zh_cn: 我们应该实现这些方法中的每一个子程序，以便能够执行提供程序处理的动作（``Kernel/GenericInterface/Provider.pm``）。

source: Operation Code Example
hu: Művelet kódpélda
zh_cn: 操作代码示例

source: In this section a sample operation module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta műveletmodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.
zh_cn: 在本节中，展示了一个示例操作模块，并解释了每个子程序。

source: We also include ``VariableCheck`` module to perform certain validation over some variables. Operations can not be instantiated by the object manager.
hu: Felveszünk egy ``VariableCheck`` modult is bizonyos ellenőrzések végrehajtásához néhány változón. A műveletek nem példányosíthatók az objektumkezelővel.
zh_cn: 我们还使用 ``VariableCheck`` 模块来对某些变量执行某些验证。 对象管理器无法实例化操作。

source: The ``Run`` function is the main part of each operation. It receives all internal mapped data from remote system needed by the provider to execute the action, it performs the action and returns the result to the provider to be external mapped and deliver back to the remote system.
hu: A ``Run`` függvény az egyes műveletek fő része. Fogadja az összes belsőleg leképezett adatot a távoli rendszertől, amelyre a szolgáltatónak szüksége van a művelet végrehajtásához, végrehajtja a műveletet, és visszaadja az eredményt a szolgáltatónak a külső leképezéshez, valamint visszaszállítja a távoli rendszerhez.
zh_cn: ``Run`` 函数是每个操作的主要部分。 它接收来自提供程序执行操作所需的远程系统的所有内部映射数据，它执行动作并将结果返回给提供程序以进行外部映射并将其传送回远程系统。

source: This particular example returns the same data as came from the remote system, unless ``TestError`` parameter is passed. In this case it returns an error.
hu: Ez a bizonyos példa ugyanúgy adja vissza az adatokat, ahogy azok a távoli rendszertől jönnek, hacsak a ``TestError`` paraméter át nincs adva. Ebben az esetben egy hibát ad vissza.
zh_cn: 此特定示例返回与远程系统相同的数据，除非传递了 ``TestError`` 参数。 在这种情况下，它会返回错误。

source: Operation Configuration Example
hu: Művelet beállítási példa
zh_cn: 操作配置示例

source: There is the need to register this operation module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen műveletmodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要将此操作模块注册以便在OTRS GUI中访问。 这可以使用下面的XML配置来完成。

source: Unit Test Example
hu: Egységteszt példa
zh_cn: 单元测试示例

source: Unit test for generic interface operations does not differs from other unit tests but it is needed to consider testing locally, but also simulating a remote connection. It is a good practice to test both separately since results could be slightly different.
hu: Az általános felület műveleteinek egységtesztjei nem különböznek más egységtesztektől, de fontolóra kell venni a helyi tesztelést, viszont egy távoli kapcsolatot is szimulálni kell. Egy jó bevált gyakorlat mindkettőt különválasztva tesztelni, mivel az eredmények némileg különbözők lehetnek.
zh_cn: 通用接口操作的单元测试与其它单元测试没有区别，但需要考虑本地测试，还需要模拟一个远程连接。 由于结果可能略有不同，因此分别测试两者是一个好习惯。

source: To learn more about unit tests, please take a look to the :doc:`../../contributing/unit-tests` chapter.
hu: Ha többet szeretne megtudni az egységtesztekről, akkor vessen egy pillantást az :doc:`../../contributing/unit-tests` fejezetre.
zh_cn: 要学习有关单元测试的更多信息，请查看 :doc:`../../contributing/unit-tests` 一章。

source: The following is just the starting point for a unit test:
hu: A következő csak a kezdési pont egy egységteszthez:
zh_cn: 以下只是单元测试的起点：

source: WSDL Extension Example
hu: WSDL-kiterjesztés példa
zh_cn: WSDL扩展示例

source: WSDL files contain the definitions of the web services and its operations for SOAP messages, in case we will extend ``development/webservices/GenericTickeConnectorSOAP.wsdl`` in some places:
hu: A WSDL-fájlok tartalmazzák a webszolgáltatás és a SOAP-üzenethez tartozó műveleteinek meghatározásait abban az esetben, a kibővítjük a ``development/webservices/GenericTickeConnectorSOAP.wsdl`` fájlt néhány helyen:
zh_cn: WSDL文件包含Web服务的定义及其SOAP消息的操作，本例中我们将在部分地方扩展 ``development/webservices/GenericTickeConnectorSOAP.wsdl``：

source: Port Type:
hu: Port típusa:
zh_cn: 端口类型：

source: Binding:
hu: Kötés:
zh_cn: 绑定：

source: Type:
hu: Típus:
zh_cn: 类型：

source: Message:
hu: Üzenet:
zh_cn: 消息：

source: WADL Extension Example
hu: WADL-kiterjesztés példa
zh_cn: WADL扩展示例

source: WADL files contain the definitions of the web services and its operations for REST interface, add a new resource to ``development/webservices/GenericTickeConnectorREST.wadl``.
hu: A WADL-fájlok tartalmazzák a webszolgáltatás és a REST-felülethez tartozó műveleteinek meghatározásait. Adjon hozzá egy új erőforrást a ``development/webservices/GenericTickeConnectorREST.wadl`` fájlhoz.
zh_cn: WADL文件包含Web服务的定义及其REST接口的操作，向 ``development/webservices/GenericTickeConnectorREST.wadl`` 添加新资源。

source: Web Service SOAP Extension Example
hu: Webszolgáltatás SOAP-kiterjesztés példa
zh_cn: Web服务SOAP扩展示例

source: Web services can be imported into OTRS by a YAML with a predefined structure in this case we will extend ``development/webservices/GenericTickeConnectorSOAP.yml`` for a SOAP web service.
hu: A webszolgáltatások importálhatók az OTRS-be egy előre meghatározott szerkezettel rendelkező YAML-fájllal. Ebben az esetben a ``development/webservices/GenericTickeConnectorSOAP.yml`` fájlt bővítjük ki egy SOAP webszolgáltatáshoz.
zh_cn: Web服务可以通过具有预定义结构的YAML导入到OTRS中，在本例中我们将为SOAP Web服务扩展 ``development/webservices/GenericTickeConnectorSOAP.yml``。

source: Web Service REST Extension Example
hu: Webszolgáltatás REST-kiterjesztés példa
zh_cn: Web服务REST扩展示例

source: Web services can be imported into OTRS by a YAML with a predefined structure in this case we will extend ``development/webservices/GenericTickeConnectorREST.yml`` for a REST web service.
hu: A webszolgáltatások importálhatók az OTRS-be egy előre meghatározott szerkezettel rendelkező YAML-fájllal. Ebben az esetben a ``development/webservices/GenericTickeConnectorREST.yml`` fájlt bővítjük ki egy REST webszolgáltatáshoz.
zh_cn: Web服务可以通过具有预定义结构的YAML导入到OTRS中，在本例中我们将为REST Web服务扩展 ``development/webservices/GenericTickeConnectorREST.yml`` 。

source: Network Transport
hu: Hálózati átvitel
zh_cn: 网络传输

source: The network transport is used as method to send and receive information between OTRS and a remote system. The generic interface configuration allows a web service to use different network transport modules for provider and requester, but the most common scenario is that the same transport module is used for both.
hu: A hálózati átvitelt használják az információk küldésének és fogadásának módszereként az OTRS és egy távoli rendszer között. Az általános felület beállításai lehetővé teszik egy webszolgáltatásnak, hogy különböző hálózati átviteli modulokat használjon a szolgáltatónál és a kérelmezőnél, de a leggyakoribb forgatókönyv az, hogy ugyanazt az átviteli modult használják mindkettőnél.
zh_cn: 网络传输用作在OTRS和远程系统之间发送和接收信息的方法。 通用接口配置允许Web服务为提供程序和请求程序使用不同的网络传输模块，但最常见的情况是两者都使用相同的传输模块。

source: OTRS as provider
hu: OTRS mint szolgáltató
zh_cn: OTRS作为服务提供方

source: OTRS uses the network transport modules to get the data from the remote system and the operation to be executed. After the operation is performed OTRS uses them again to send the response back to the remote system.
hu: Az OTRS arra használja a hálózati átviteli modulokat, hogy lekérje az adatokat a távoli rendszertől, valamint lekérje a végrehajtandó műveleteket. A művelet végrehajtása után az OTRS ismét azokat használja a válasz visszaküldéséhez a távoli rendszernek.
zh_cn: OTRS使用网络传输模块从远程系统获取数据并执行操作。 执行操作后，OTRS再次使用网络传输模块将响应发送回远程系统。

source: OTRS as requester
hu: OTRS mint kérelmező
zh_cn: OTRS作为服务请求方

source: OTRS uses the network transport modules to send petitions to the remote system to perform a remote action along with the required data. OTRS waits for the remote system response and send it back to the requester module.
hu: Az OTRS arra használja a hálózati átviteli modulokat, hogy kérelmeket küldjön a távoli rendszernek egy távoli művelet végrehajtásához a szükséges adatok mellett. Az OTRS várakozik a távoli rendszer válaszára, és visszaküldi azt a kérelmező modulnak.
zh_cn: OTRS使用网络传输模块向远程系统发送请求以执行远程操作以及所需数据。 OTRS等待远程系统响应并将其发送回请求者模块。

source: In both ways network transport modules deal with the data in the remote system format. It is not recommended to do any data transformation in this modules, as the mapping layer is the responsible to perform any data transformation needed during the communication. An exception of this is the data conversion that is required specifically by for the transport e.g. XML or JSON from / to Perl conversions.
hu: Mindkét irányban a hálózati átviteli modulok foglalkoznak a távoli rendszer formátumában lévő adatokkal. Nem ajánlott semmilyen adatátalakítás végrehajtása sem ezekben a modulokban, mivel a leképező réteg felelős a kommunikáció során szükséges bármilyen adatátalakítás végrehajtásáért. Egy kivétel erre az olyan adatátalakítás, amely kifejezetten az átvitelnél szükséges, például XML vagy JSON és Perl átalakítások.
zh_cn: 在这两种方式中，网络传输模块处理远程系统格式的数据。 建议不要在此模块中进行任何数据转换，因为映射层负责执行通信期间所需的任何数据转换。 例外情况是传输中特别需要的数据转换，例如 从或到Perl转换的XML或JSON。

source: Transport Back End
hu: Átviteli háttérprogram
zh_cn: 传输后端

source: Next we will show how to develop a new transport back end. Each transport back end has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új átviteli háttérprogramot kifejleszteni. Minden egyes átviteli háttérprogramnak meg kell valósítania ezeket a szubrutinokat:
zh_cn: 接下来我们将展示如何开发新的传输后端。 每个传输后端都必须实现这些子程序：

source: We should implement each one of this methods in order to be able to communicate correctly with a remote system in both ways. All network transport back ends are handled by the transport module (``Kernel/GenericInterface/Transport.pm``).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk mindkét irányban helyesen kommunikálni egy távoli rendszerrel. Az összes átviteli háttérprogramot az átviteli modul kezeli (``Kernel/GenericInterface/Transport.pm``).
zh_cn: 我们应该实现这些方法中的每一种，以便能够以两种方式与远程系统正确通信。 所有网络传输后端都由传输模块（``Kernel/GenericInterface/Transport.pm``）处理。

source: Currently generic interface implements the HTTP SOAP and HTTP REST transports. If the planned web service can use HTTP SOAP or HTTP SOAP there is no need to create a new network transport module, instead we recommend to take a look into HTTP SOAP or HTTP REST configurations to check their settings and how it can be tuned according to the remote system.
hu: Jelenleg az általános felület megvalósítja a HTTP SOAP és a HTTP REST átviteleket. Ha a tervezett webszolgáltatás használhat HTTP SOAP vagy HTTP SOAP átviteleket, akkor nincs szükség egy új hálózati átviteli modul létrehozására, hanem ahelyett azt ajánljuk, hogy vessen egy pillantást a HTTP SOAP vagy HTTP REST konfigurációira a beállításaik ellenőrzéséhez, valamint hogy hogyan hangolhatók a távoli rendszernek megfelelően.
zh_cn: 当前通用接口实现HTTP SOAP和HTTP REST传输。 如果计划的Web服务可以使用HTTP SOAP或HTTP REST，则无需创建新的网络传输模块，而是建议您查看HTTP SOAP或HTTP REST配置以检查其设置以及如何根据远程系统进行调整。

source: Network Transport Code Example
hu: Hálózati átvitel kódpélda
zh_cn: 网络传输代码示例

source: In case that the provided network transports does not match the web service needs, then in this section a sample network transport module is shown and each subroutine is explained. Normally transport modules uses CPAN modules as back ends. For example the HTTP SOAP transport modules uses ``SOAP::Lite`` module as back end.
hu: Abban az esetben, ha a biztosított hálózati átvitelek nem illeszkednek a webszolgáltatás igényeire, akkor ebben a szakaszban egy minta hálózati átviteli modul van bemutatva, és minden egyes szubrutin elmagyarázásra kerül. Normális esetben az átviteli modulok CPAN modulokat használnak háttérprogramokként. Például a HTTP SOAP átviteli modulok a ``SOAP::Lite`` modult használják háttérprogramként.
zh_cn: 如果提供的网络传输与Web服务需求不匹配，则在本节中展示一个示例网络传输模块，并解释每个子程序。 通常，传输模块使用CPAN模块作为后端。 例如，HTTP SOAP传输模块使用 ``SOAP::Lite`` 模块作为后端。

source: For this example a custom package is used to return the data without doing a real network request to a remote system, instead this custom module acts as a loop-back interface.
hu: Ennél a példánál egy egyéni csomagot használnak az adatok visszaadásához,anélkül hogy valódi hálózati kérést intéznének egy távoli rendszerhez, ehelyett ez az egyéni modul működik visszacsatolási felületként.
zh_cn: 对于此示例，自定义包用于返回数据而不向远程系统发出真实的网络请求，而是将此自定义模块用作环回接口。

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the ``package`` keyword. Transports can not be instantiated by the object manager.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a ``package`` kulcsszón keresztül van deklarálva. Az átvitelek nem példányosíthatók az objektumkezelővel.
zh_cn: 这是可在常见OTRS模块中找到的通用标头。类/包名称通过 ``package`` 关键字声明。 传输无法由对象管理器实例化。

source: The ``ProviderProcessRequest`` function gets the request from the remote system (in this case the same OTRS) and extracts the data and the operation to perform from the request. For this example the operation is always ``test_operation``.
hu: A ``ProviderProcessRequest`` függvény megkapja a kérést a távoli kiszolgálótól (ebben az esetben ugyanaz az OTRS), és kibontja az adatokat és a műveletet a kérésből a végrehajtáshoz. Ennél a példánál a művelet mindig a ``test_operation``.
zh_cn: ``ProviderProcessRequest`` 函数从远程系统获取请求（在本例中与OTRS相同），并从请求中提取数据和要执行的操作。 对于这个例子，操作总是 ``test_operation``。

source: The way this function parses the request to get the data and the operation name, depends completely on the protocol to be implemented and the external modules that are used for.
hu: Annak a módja, ahogy ez a függvény feldolgozza a kérést az adatok és a művelet nevének lekéréséhez, az teljes egészében a megvalósítandó protokolltól és azon külső moduloktól függ, amelyekhez használják azokat.
zh_cn: 此函数解析请求以获取数据和操作名称的方式，完全取决于要实现的协议和用于的外部模块。

source: This function sends the response back to the remote system for the requested operation.
hu: Ez a függvény visszaküldi a választ a távoli rendszernek a kért művelethez.
zh_cn: 此函数将响应发送回远程系统以进行请求的操作。

source: For this particular example we return a standard HTTP response success (200) or not (500), along with the required data on each case.
hu: Ennél a bizonyos példánál minden esetben egy szabványos sikeres HTTP-választ adunk vissza (200) vagy nem (500) a szükséges adatok mellett.
zh_cn: 对于此特定示例，我们返回标准HTTP响应成功（200）或不成功（500），以及每种情况下所需的数据。

source: This is the only function that is used by OTRS as requester. It sends the request to the remote system and waits for its response.
hu: Ez az egyetlen olyan függvény, amelyet az OTRS mint kérelmező használ. Elküldi a kérést a távoli rendszernek, és várakozik annak válaszára.
zh_cn: 这是OTRS作为请求者使用的唯一函数。 它将请求发送到远程系统并等待其响应。

source: For this example we use a custom protocol handler to avoid send the request to the real network. This custom protocol is specified below.
hu: Ennél a példánál egy egyéni protokollkezelőt használunk a valódi hálózatra történő kérésküldés elkerüléséhez. Ez az egyéni protokoll az alábbiakban van megadva.
zh_cn: 对于此示例，我们使用自定义协议处理程序来避免将请求发送到真实网络。 此自定义协议如下所示。

source: This is the code for the custom protocol that we use. This approach is only useful for training or for testing environments where the remote systems are not available.
hu: Ez a kód ahhoz az egyéni protokollhoz van, amelyet használunk. Ez a megközelítés csak gyakorlásnál vagy olyan tesztelési környezeteknél hasznos, ahol a távoli rendszerek nem érhetők el.
zh_cn: 这是我们使用的自定义协议的代码。 此方法仅适用于培训或测试远程系统不可用的环境。

source: For a new module development we do not recommend to use this approach, a real protocol needs to be implemented.
hu: Egy új modul kifejlesztéséhez nem ajánljuk ezen megközelítés használatát, egy valódi protokollt kell megvalósítani.
zh_cn: 对于新模块开发，我们不建议使用此方法，需要实现真正的协议。

source: Network Transport Configuration Example
hu: Hálózati átvitel beállítási példa
zh_cn: 网络传输配置示例

source: There is the need to register this network transport module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen hálózati átviteli modul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要将该网络传输模块注册以便在OTRS GUI中访问。 这可以使用下面的XML配置来完成。

source: Log Module
hu: Naplózás modul
zh_cn: 日志模块

source: There is a global log interface for OTRS that provides the possibility to create own log back ends.
hu: Létezik egy globális naplózó felület az OTRS-hez, amely a saját naplózó háttérprogramok létrehozásának lehetőségét biztosítja.
zh_cn: OTRS有一个全局日志接口，可以创建自己的日志后端。

source: Writing an own logging back end is as easy as reimplementing the ``Kernel::System::Log::Log()`` method.
hu: Egy saját naplózó háttérprogram írása olyan egyszerű, mint újra megvalósítani a ``Kernel::System::Log::Log()`` metódust.
zh_cn: 编写自己的日志记录后端就像重新实现 ``Kernel::System::Log::Log()`` 方法一样简单。

source: Log Module Code Example
hu: Naplózás modul kódpélda
zh_cn: 日志模块代码示例

source: In this small example, we'll write a little file logging back end which works similar to ``Kernel::System::Log::File``, but prepends a string to each logging entry.
hu: Ebben a kis példában írni fogunk egy kicsi fájl naplózó háttérprogramot, amely hasonlóan működik mint a ``Kernel::System::Log::File``, de egy szöveget fűz minden naplóbejegyzés elé.
zh_cn: 在这个小例子中，我们将编写一个小的文件日志后端，其工作方式类似于 ``Kernel::System::Log::File``，但是为每个日志条目添加一个字符串。

source: Log Module Configuration Example
hu: Naplózás modul beállítási példa
zh_cn: 日志模块配置示例

source: To activate our custom logging module, the administrator can either set the existing configuration item ``LogModule`` manually to ``Kernel::System::Log::CustomFile``. To realize this automatically, you can provide an XML configuration file which overrides the default setting.
hu: Az egyéni naplózómodul bekapcsolásához az adminisztrátor beállíthatja kézzel a meglévő ``LogModule`` konfigurációs elemet a ``Kernel::System::Log::CustomFile`` osztályhoz. Ennek automatikus megvalósításához megadhat egy XML beállítófájlt, amely felülbírálja az alapértelmezett beállítást.
zh_cn: 要激活我们的自定义日志模块，管理员可以手动将现有配置项 ``LogModule`` 设置为 ``Kernel::System::Log::CustomFile``。 要自动实现此功能，您可以提供覆盖默认设置的XML配置文件。

source: Log Module Use Case Example
hu: Naplózás modul használati eset példa
zh_cn: 日志模块用例示例

source: Useful logging back ends could be logging to a web service or to encrypted files.
hu: Hasznos naplózó háttérprogram lehet egy webszolgáltatásba vagy egy titkosított fájlba történő naplózás.
zh_cn: 有用的日志后端可以记录到Web服务或加密文件。

source: ``Kernel::System::Log`` has other methods than ``Log()`` which cannot be reimplemented, for example code for working with shared memory segments and log data caching.
hu: A ``Kernel::System::Log`` a ``Log()`` metóduson kívül egyéb metódusokkal is rendelkezik, amelyeket nem lehet újra megvalósítani, például az osztott memóriaszakaszokkal történő munkához tartozó kód és a naplóadatok gyorsítótárazása.
zh_cn: ``Kernel::System::Log`` 除了 ``Log()`` 之外还有其它方法，它们不能重新实现，例如用于处理共享内存段和日志数据缓存的代码。

source: Notification Module
hu: Értesítési modul
zh_cn: 通知模块

source: Notification modules are used to display a notification below the main navigation. You can write and register your own notification module. There are currently 5 ticket menus in the OTRS framework.
hu: Az értesítési modulokat egy értesítés megjelenítéséhez használják a fő navigáció alatt. Megírhatja és regisztrálhatja a saját értesítési modulját. Jelenleg 5 jegymenü van az OTRS keretrendszerben.
zh_cn: 通知模块用于在主导航下方显示通知。 您可以编写和注册自己的通知模块。 OTRS框架中目前有5个工单菜单。

source: Notification Module Code Example
hu: Értesítési modul kódpélda
zh_cn: 通知模块代码示例

source: The notification modules are located under ``Kernel/Output/HTML/TicketNotification*.pm``. Following, there is an example of a notify module. Save it under ``Kernel/Output/HTML/TicketNotificationCustom.pm``. You just need 2 functions: ``new()`` and ``Run()``.
hu: Az értesítési modulok a ``Kernel/Output/HTML/TicketNotification*.pm`` alatt találhatók. Ezt követően egy értesítőmodul példája található. Mentse el a ``Kernel/Output/HTML/TicketNotificationCustom.pm`` fájlba. Mindössze két függvényre van szüksége: ``new()`` és ``Run()``.
zh_cn: 通知模块位于 ``Kernel/Output/HTML/TicketNotification*.pm``。 下面是一个通知模块的示例。 将它保存为 ``Kernel/Output/HTML/TicketNotificationCustom.pm``。 你只需要2个函数：``new()`` 和 ``Run()``。

source: Notification Module Configuration Example
hu: Értesítési modul beállítási példa
zh_cn: 通知模块配置示例

source: There is the need to activate your custom notification module. This can be done using the XML configuration below. There may be additional parameters in the config hash for your notification module.
hu: Szükség van az egyéni értesítési modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni. Lehetnek további paraméterek is a beállítás kivonatában az értesítési moduljánál.
zh_cn: 需要激活自定义通知模块。 这可以使用下面的XML配置来完成。 通知模块的配置哈希中可能还有其它参数。

source: Notification Module Use Case Example
hu: Értesítési modul használati eset példa
zh_cn: 通知模块用例示例

source: Useful ticket menu implementation could be a link to an external tool if parameters (e.g. ``FreeTextField``) have been set.
hu: Hasznos jegymenü megvalósítás lehet egy hivatkozás egy külső eszközre, ha a paraméterek (például ``FreeTextField``) be lettek állítva.
zh_cn: 如果已设置参数（例如 ``FreeTextField``），则有用的工单菜单实现可以是指向外部工具的链接。

source: Output Filter
hu: Kimenetszűrő
zh_cn: 输出过滤器

source: Output filters allow to modify HTML on the fly. It is best practice to use output filters instead of modifying ``.tt`` files directly. There are three good reasons for that. When the same adaptation has to be applied to several front end modules then the adaption only has to be implemented once. The second advantage is that when OTRS is upgraded there is a chance that the filter doesn't have to be updated, when the relevant pattern has not changed. When two extensions modify the same file there is a conflict during the installation of the second package. This conflict can be resolved by using two output filters that modify the same front end module.
hu: A kimenetszűrők lehetővé teszik a HTML módosítását röptében. A bevált gyakorlat a kimenetszűrők használata a ``.tt`` fájlok közvetlen módosítása helyett. Három jó ok létezik erre. Amikor ugyanazt az átdolgozást kell alkalmazni számos előtétprogram modulon, akkor az átdolgozást csak egyszer kell megvalósítani. A második előnye, hogy amikor az OTRS-t frissítik, akkor megvan az esély arra, hogy a szűrőt nem kell frissíteni, ha a hozzá tartozó minta nem változott. Amikor két kiterjesztés ugyanazt a fájlt módosítja, akkor ütközés lép fel a második csomag telepítése során. Ez az ütközés feloldható két kimenetszűrő használatával, amelyek ugyanazt az előtétprogram modult módosítják.
zh_cn: 输出过滤器允许动态修改HTML。 最佳做法是使用输出过滤器而不是直接修改 ``.tt`` 文件。 这有三个很好的理由。 当必须将相同的适配应用于多个前端模块时，则仅需要实现一次适配。 第二个优点是当OTRS升级时，当相关模式没有改变时，有可能不必更新过滤器。 当两个扩展修改同一文件时，在安装第二个包期间会发生冲突。 通过使用修改相同前端模块的两个输出过滤器可以解决此冲突。
