Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: You can also use ``[% ReplacePlaceholders() %]`` in function format, in case you are not translating anything. In this case, first parameter is the target string, and any found placeholders in it are substituted with subsequent parameters.
hu: Használhatja a ``[% ReplacePlaceholders() %]`` szűrőt függvény formában is abban az esetben, ha nem fordít le semmit sem. Ebben az esetben az első paraméter a célszöveg, és a benne talált bármilyen helykitöltő helyettesítve lesz az azt követő paraméterekkel.
zh_cn: 您也可以在函数格式中使用 ``[％ReplacePlaceholders()％]``，以防您没有翻译任何内容。 在这种情况下，第一个参数是目标字符串，其中任何找到的占位符都替换为后续参数。

source: Template Processing Commands
hu: Sablonfeldolgozó parancsok
zh_cn: 模板处理命令

source: Comment
hu: Megjegyzés
zh_cn: 注释

source: Lines starting with a # at the beginning of will not be shown in the html output. This can be used both for commenting the Template code or for disabling parts of it.
hu: Azok a sorok, amelyek # karakterrel kezdődnek az elején, nem lesznek láthatók a HTML kimeneten. Ez használható a sablonkód magyarázatához, vagy annak egyes részei letiltásához is.
zh_cn: 以＃开头的行不会显示在html输出中。 这既可用于注释模板代码，也可用于禁用部分模板代码。

source: Please note that the ``InsertTemplate`` command was added to provide better backwards compatibility to the old DTL system. It might be deprecated in a future version of OTRS and removed later. If you don't use block commands in your included template, you don't need ``InsertTemplate`` and can use standard Template::Toolkit syntax like ``INCLUDE/PROCESS`` instead.
hu: Felhívjuk a figyelmét, hogy az ``InsertTemplate`` parancs azért lett hozzáadva, hogy jobb visszafelé kompatibilitást nyújtson a régi DTL rendszerhez. Ez esetleg elavulttá válhat az OTRS jövőbeli verzióiban, és később eltávolításra kerülhet. Ha nem használ blokk parancsokat a felvett sablonjában, akkor nincs szüksége az ``InsertTemplate`` parancsra, és használhatja helyette a szabványos Template::Toolkit szintaxist, úgymint ``INCLUDE/PROCESS``.
zh_cn: 请注意，添加了 ``InsertTemplate`` 命令以提供与旧DTL系统更好的向后兼容性。 它可能会在未来的OTRS版本中弃用，并在以后删除。 如果你不在包含的模板中使用块命令，则不需要 ``InsertTemplate`` 并且可以使用标准的Template::Toolkit语法，例如 ``INCLUDE/PROCESS``。

source: Includes another template file into the current one. The included file may also contain template commands.
hu: Felvesz egy másik sablonfájlt a jelenlegibe. A felvett fájl is tartalmazhat sablonparancsokat.
zh_cn: 将另一个模板文件包含到当前模板中。 包含的文件也可能包含模板命令。

source: Please note this is not the same as Template::Toolkit's ``[% INCLUDE %]`` command, which just processes the referenced template. ``[% InsertTemplate() %]`` actually adds the content of the referenced template into the current template, so that it can be processed together. That makes it possible for the embedded template to access the same environment/data as the main template.
hu: Felhívjuk a figyelmét, hogy ez nem ugyanaz mint a Template::Toolkit ``[% INCLUDE %]`` parancsa, amely csak feldolgozza a hivatkozott sablont. Az ``[% InsertTemplate() %]`` tulajdonképpen hozzáadja a hivatkozott sablon tartalmát a jelenlegi sablonhoz azért, hogy együtt legyenek feldolgozhatók. Ez lehetővé teszi a beágyazott sablon számára, hogy ugyanazon környezethez vagy adatokhoz férjen hozzá mint a fő sablon.
zh_cn: 请注意，这与Template::Toolkit的 ``[% INCLUDE %]`` 命令不同，后者只处理引用的模板。 ``[% InsertTemplate() %]`` 实际上将引用模板的内容添加到当前模板中，以便可以一起处理它。 这使得嵌入式模板可以访问与主模板相同的环境/数据。

source: Please note that the blocks commands were added to provide better backwards compatibility to the old DTL system. They might be deprecated in a future version of OTRS and removed later. We advise you to develop any new code without using the blocks commands. You can use standard Template::Toolkit syntax like ``IF/ELSE``, ``LOOP`` and other helpful things for conditional template output.
hu: Vegye figyelembe, hogy a blokk parancsok azért lettek hozzáadva, hogy jobb visszafelé kompatibilitást nyújtsanak a régi DTL rendszerhez. Ezek esetleg elavulttá válhatnak az OTRS jövőbeli verzióiban, és később eltávolításra kerülhetnek. Azt javasoljuk, hogy blokk parancsok használata nélkül fejlesszen bármilyen új kódot. Használhatja a szabványos Template::Toolkit szintaxist a feltételes sablonkimenethez, mint például ``IF/ELSE``, ``LOOP`` és egyéb hasznos dolgok.
zh_cn: 请注意，添加了块命令以提供与旧DTL系统更好的向后兼容性。 它们可能在将来的OTRS版本中被弃用，稍后会被删除。 我们建议您在不使用blocks命令的情况下开发任何新代码。 您可以使用标准的Template::Toolkit语法，如 ``IF/ELSE``、``LOOP`` 以及条件模板输出的其它有用的东西。

source: With this command, one can specify parts of a template file as a block. This block needs to be explicitly filled with a function call from the application, to be present in the generated output. The application can call the block 0 (it will not be present in the output), 1 or more times (each with possibly a different set of data parameters passed to the template).
hu: Ezzel a paranccsal lehet megadni egy sablonfájl részeit blokként. Ezt a blokkot határozottan ki kell tölteni egy függvényhívással az alkalmazásból, hogy megjelenjen az előállított kimeneten. Az alkalmazás meghívhatja a blokkot 0-szor (nem fog megjelenni a kimeneten), illetve 1 vagy többször (esetleg mindegyiket a sablonnak átadott adatparaméterek különböző halmazával).
zh_cn: 使用此命令，可以将模板文件的某些部分指定为块。 需要使用来自应用程序的函数调用显式填充此块，以使其出现在生成的输出中。 应用程序可以调用块0次（它不会出现在输出中）、1次或多次（每次都可能有一组不同的数据参数传递给模板）。

source: One common use case is the filling of a table with dynamic data:
hu: Egy gyakori használati eset egy táblázat kitöltése dinamikus adatokkal:
zh_cn: 一个常见的用例是使用动态数据填充表：

source: The surrounding table with the header is always generated. If no data was found, the block ``NoDataFoundMsg`` is called once, resulting in a table with one data row with the message *No data found*.
hu: A körülvevő táblázat a fejléccel mindig elő lesz állítva. Ha nem található adat, akkor a ``NoDataFoundMsg`` blokk egyszer lesz meghívva egy olyan táblázatot eredményezve, amelynek egy adatsora van a *Nem található adat* üzenettel.
zh_cn: 始终生成带有标题的完整表。 如果没有找到数据，则会调用块 ``NoDataFoundMsg`` 一次，从而产生一个包含一个数据行的表，显示消息 *没有找到数据*。

source: If data was found, for each row there is one function call made for the block ``OverViewResultRow`` (each time passing in the data for this particular row), resulting in a table with as many data rows as results were found.
hu: Ha találhatók adatok, akkor minden egyes sornál egy függvényhívás történik az ``OverViewResultRow`` blokknál (minden alkalommal átadva az adatokat ehhez a bizonyos sorhoz) egy olyan táblázatot eredményezve, amelynek annyi sora van, ahány eredmény található.
zh_cn: 如果找到数据，则对于每一行，都会对 ``OverViewResultRow`` 块进行一次函数调用（每次传入此特定行的数据），从而得到一个表，包含与找到结果一样多的数据行。

source: Let's look at how the blocks are called from the application module:
hu: Nézzük meg, hogyan vannak meghívva a blokkok az alkalmazásmodulból:
zh_cn: 让我们看看如何从应用程序模块调用块：

source: Note how the blocks have both their name and an optional set of data passed in as separate parameters to the block function call. Data inserting commands inside a block always need the data provided to the block function call of this block, not the general template rendering call.
hu: Figyelje meg, hogy a blokkoknak hogyan kell átadniuk mind a nevüket, mind egy opcionális adathalmazt különálló paraméterekként a blokkfüggvény hívásnak. Az adatbeszúró parancsoknak egy blokkon belül mindig az ezen blokk blokkfüggvény hívásához megadott adatokra van szükségük, nem az általános sablonmegjelenítő híváshoz.
zh_cn: 注意块如何将它们的名称和一组可选数据作为单独的参数传递给块函数调用。 块内的数据插入命令总是需要提供给该块的块函数调用的数据，而不是一般的模板渲染调用。

source: Marks JavaScript code which should be executed after all CSS, JavaScript and other external content has been loaded and the basic JavaScript initialization was finished. Again, let's look at an example:
hu: Megjelöli azt a JavaScript kódot, amelyet azután kell lefuttatni, miután az összes CSS, JavaScript és egyéb külső tartalom betöltődött, és az alapvető JavaScript előkészítés befejeződött. Vessünk egy pillantást ismét egy példára:
zh_cn: 标记在加载所有CSS、JavaScript和其它外部内容并完成基本JavaScript初始化之后应执行的JavaScript代码。 让我们再看一个例子：

source: This snippet creates a small form and puts an ``onchange`` handler on the ``<select>`` element which triggers an AJAX based form update.
hu: Ez a kódrészlet egy kicsi űrlapot hoz létre, és rátesz egy ``onchange`` kezelőt a ``<select>`` elemre, amely aktivál egy AJAX-alapú űrlapfrissítést.
zh_cn: 这个片段创建一个小型表单，并在 ``<select>`` 元素上放置一个 ``onchange`` 处理程序，触发基于AJAX的表单更新。

source: Why is it necessary to enclose the JavaScript code in ``[% WRAPPER JSOnDocumentComplete %]...[% END %]``? JavaScript loading was moved to the footer part of the page for performance reasons. This means that within the ``<body>`` of the page, no JavaScript libraries are loaded yet. With ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` you can make sure that this JavaScript is moved to a part of the final HTML document, where it will be executed only after the entire external JavaScript and CSS content has been successfully loaded and initialized.
hu: Miért van szükség a JavaScript kód körbezárására a ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` blokkban? A JavaScript betöltést teljesítmény okok miatt áthelyezték az oldal lábrészébe. Ez azt jelenti, hogy az oldal ``<body>`` részén belül még nincsenek JavaScript programkönyvtárak betöltve. A ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` blokkal lehet biztos abban, hogy ez a JavaScript áthelyezésre kerül a végső HTML dokumentumnak egy olyan részébe, ahol csak akkor kerül végrehajtásra, miután a teljes külső JavaScript és CSS tartalom sikeresen be lett töltve és elő lett készítve.
zh_cn: 为什么有必要将JavaScript代码包含在 ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` 中？ 出于性能原因，JavaScript加载已移至页面的页脚部分。 这意味着在页面的 ``<body>`` 中，还没有加载任何JavaScript库。 使用 ``[% WRAPPER JSOnDocumentComplete %]...[% END %]``，您可以确保将此JavaScript移动到最终HTML文档的一部分，只有在整个外部JavaScript和CSS内容已成功加载和初始化之后才能执行它。

source: Inside the ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` block, you can use ``<script>`` tags to enclose your JavaScript code, but you do not have to do so. It may be beneficial because it will enable correct syntax highlighting in IDEs which support it.
hu: A ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` blokkon belül használhatja a ``<script>`` címkéket a JavaScript kód körbezárásához, de ezt nem kell megtennie. Előnyös lehet, mert engedélyezni fogja a helyes szintaxis-kiemelést az olyan integrált fejlesztői környezetekben, amelyek támogatják azt.
zh_cn: 在 ``[% WRAPPER JSOnDocumentComplete %]...[% END %]`` 块中，您可以使用 ``<script>`` 标签来封装您的JavaScript代码，但您不必这样做。 这可能是有益的，因为它将在支持它的IDE中启用正确的语法突出显示。

source: Using a Template File
hu: Egy sablonfájl használata
zh_cn: 使用一个模板文件

source: Ok, but how to actually process a template file and generate the result? This is really simple:
hu: Rendben, de tulajdonképpen hogyan kell egy sablonfájlt feldolgozni és az eredményt előállítani? Ez igazán egyszerű:
zh_cn: 好了，那如何实际处理模板文件并生成结果呢？这很简单：

source: In the front end modules, the ``Output()`` function of ``Kernel::Output::HTML::Layout`` is called (after all the needed blocks have been called in this template) to generate the final output. An optional set of data parameters is passed to the template, for all data inserting commands which are not inside of a block.
hu: Az előtétprogram-modulokban a ``Kernel::Output::HTML::Layout`` objektum ``Output()`` függvénye lesz meghívva (miután az összes szükséges blokk meg lett hívva ebben a sablonban) a végső kimenet előállításához. Adatparaméterek opcionális halmaza is átadásra kerül a sablonnak minden olyan adatbeszúró parancsnál, amelyek nincsenek egy blokk belsejében.
zh_cn: 在前端模块中，调用 ``Kernel::Output::HTML::Layout`` 的 ``Output()`` 函数（在该模板中调用了所有需要的块之后），以生成最终输出。对于不在块内的所有数据插入命令，将向模板传递一组可选的数据参数。

source: Creating Your Own Themes
hu: Saját témák létrehozása
zh_cn: 创建你自己的主题

source: You can create your own themes so as to use the layout you like in the OTRS web front end. To create custom themes, you should customize the output templates to your needs. More information on the syntax and structure of output templates can be found in the :doc:`templates`.
hu: Létrehozhatja a saját témáit, így olyan elrendezést használhat az OTRS webes előtétprogramján, amilyet csak szeretne. Egyéni témák létrehozásához személyre kell szabnia a kimeneti sablonokat az igényei szerint. A kimeneti sablonok szerkezetéről és szintaxisáról további információk találhatók a :doc:`templates` szakaszban.
zh_cn: 您可以创建自己的主题，以便使用您喜欢的OTRS Web前端布局。要创建自定义主题，应根据需要自定义输出模板。有关输出模板语法和结构的详细信息，请参见 :doc:`templates`。

source: As an example, perform the following steps to create a new theme called *Company*:
hu: Példaként hajtsa végre a következő lépéseket egy új *Company* nevű téma létrehozásához:
zh_cn: 例如，执行以下步骤创建名为 *Company* 的新主题：

source: Create a directory called ``Kernel/Output/HTML/Templates/Company`` and copy all files that you like to change from ``Kernel/Output/HTML/Templates/Standard`` into the new folder.
hu: Hozzon létre egy ``Kernel/Output/HTML/Templates/Company`` nevű könyvtárat, és másoljon át a ``Kernel/Output/HTML/Templates/Standard`` mappából minden olyan fájlt az új mappába, amelyet meg szeretne változtatni.
zh_cn: 创建一个名为 ``Kernel/Output/HTML/Templates/Company`` 的目录，并将您想要更改的所有文件从 ``Kernel/Output/HTML/Templates/Standard`` 复制到新文件夹中。

source: Only copy over the files you're planning to change. OTRS will automatically get the missing files from the Standard theme. This will make upgrading at a later stage much easier.
hu: Csak azokat a fájlokat másolja át, amelyeket meg szeretne változtatni. Az OTRS automatikusan be fogja szerezni a hiányzó fájlokat a szabványos témából. Ez sokkal könnyebbé fogja tenni a későbbiekben a frissítést.
zh_cn: 仅复制您计划更改的文件。 OTRS将自动从标准主题中获取缺失的文件。 这将使后期升级变得更加容易。

source: Customize the files in the directory ``Kernel/Output/HTML/Templates/Company`` and change the layout to your needs.
hu: Szabja személyre a ``Kernel/Output/HTML/Templates/Company`` könyvtárban lévő fájlokat, és változtassa meg az elrendezést az igényei szerint.
zh_cn: 定制 ``Kernel/Output/HTML/Templates/Company`` 目录中的文件，并根据需要更改布局。

source: To activate the new theme, add them in system configuration under ``Frontend::Themes``.
hu: Az új téma bekapcsolásához adja hozzá azokat a rendszerbeállításokban a ``Frontend::Themes`` alatt.
zh_cn: 要激活新主题，请在系统配置 ``Frontend::Themes`` 中添加它们。

source: Now the new theme should be usable. You can select it via your personal preferences.
hu: Most az új témának használhatónak kell lennie. A személyes beállítások oldalán keresztül tudja kiválasztani.
zh_cn: 现在应该可用新主题了。 您可以通过个人首选项选择它。

source: Do not change the theme files shipped with OTRS, since these changes will be lost after an update. Create your own themes only by performing the steps described above.
hu: Ne változtassa meg az OTRS-sel szállított témafájlokat, mivel azok a változtatások el fognak veszni egy frissítés után. Csak a fent leírt lépések végrehajtásával hozzon létre saját témákat.
zh_cn: 不要直接修改OTRS自带的主题文件，因为这些更改在OTRS升级后会丢失。只需按上述步骤创建你自己的主题就行了。

source: Localization / Translation Mechanism
hu: Honosítási és fordítási mechanizmus
zh_cn: 本地化/翻译机制

source: There are four steps needed to translate / localize software: marking localizable strings in the source files, generating the translation database/file, the translation process itself, and the usage of translated data within the code.
hu: Négy lépés szükséges a szoftver lefordításához és honosításához: a honosítható szövegek megjelölése a forrásfájlokban, a fordítási adatbázis/fájl előállítása, maga a fordítási folyamat, és a lefordított adatok használata a kódon belül.
zh_cn: 翻译/本地化软件需要四个步骤：在源文件中标记可本地化的字符串、生成翻译数据库/文件、翻译过程本身以及在代码中使用翻译的数据。

source: Marking Translatable Strings in the Source Files
hu: Lefordítható szövegek megjelölése a forrásfájlokban
zh_cn: 在源文件中标记可翻译字符串

source: In Perl code, all literal strings to be translated are automatically marked for translation:
hu: A Perl-kódban az összes lefordítandó literál szöveg automatikusan meg van jelölve a fordításhoz:
zh_cn: 在Perl代码中，所有要翻译的文字字符串都会自动标记为翻译：

source: This will mark *My string %s* for translation. If you need to mark strings, but NOT translate them in the code yet, you can use the NOOP method ``Kernel::Langauge::Translatable()``.
hu: Ez fogja megjelölni a *My string %s* szöveget a fordításhoz. Ha arra van szüksége, hogy a kódban megjelölje a szövegeket, de még NE fordítsa le azokat, akkor használhatja a ``Kernel::Langauge::Translatable()`` NOOP metódust.
zh_cn: 这将标记为 *My string %s* 进行翻译。 如果你需要标记字符串，但尚未在代码中翻译它们，你可以使用NOOP方法 ``Kernel::Langauge::Translatable()``。

source: In template files, all literal strings enclosed in the ``Translate()`` tag are automatically marked for extraction: ``[% Translate('My string %s', Data.Data )%]``.
hu: A sablonfájlokban az összes olyan literál szöveg automatikusan meg van jelölve a kigyűjtéshez, amelyek ``Translate()`` címkével vannak körbezárva: ``[% Translate('My string %s', Data.Data )%]``.
zh_cn: 在模板文件中，所有包含在 ``Translate()`` 标签中的文字字符串都会自动标记以便提取：``[% Translate('My string %s', Data.Data )%]``。

source: In system configuration and database XML files you can mark strings for extraction with the ``Translatable="1"`` attribute.
hu: A rendszerbeállítás és az adatbázis XML-fájlokban a ``Translatable="1"`` attribútummal jelölheti meg a szövegeket a kigyűjtéshez.
zh_cn: 在系统配置和数据库XML文件中，您可以使用 ``Translatable="1"`` 属性标记要提取的字符串。

source: Collecting Translatable Strings Into The Translation Database
hu: Lefordítható szövegek összegyűjtése a fordítási adatbázisba
zh_cn: 将可翻译字符串收集到翻译数据库中

source: The console command ``otrs.Console.pl Dev::Tools::TranslationsUpdate`` is used to extract all translatable strings from the source files. These will be collected and written into the translation files.
hu: Az ``otrs.Console.pl Dev::Tools::TranslationsUpdate`` konzolparancs használható az összes lefordítható szöveg kigyűjtéséhez a forrásfájlokból. Ezek össze lesznek gyűjtve, és ki lesznek írva a fordítási fájlokba.
zh_cn: 控制台命令 ``otrs.Console.pl Dev::Tools::TranslationsUpdate`` 用于从源文件中提取所有可翻译的字符串。 这些将被收集并写入翻译文件。

source: For the OTRS framework and all extension modules, ``.pot`` and ``.po`` files are written. These files are used by translators to localize the software.
hu: Az OTRS keretrendszerhez és az összes kiterjesztőmodulhoz ``.pot`` és ``.po`` fájlok kerülnek kiírásra. Ezeket a fájlokat használják a fordítók a szoftver honosításához.
zh_cn: 对于OTRS框架和所有扩展模块，都会编写 ``.pot`` 和 ``.po`` 文件。 这些文件由翻译人员用于本地化软件。

source: But OTRS requires the translations to be in Perl files for speed reasons. These files will also be generated by ``otrs.Console.pl Dev::Tools::TranslationsUpdate``. There are two different translation cache file types which are used in the following order. If a word/sentence is redefined in a translation file, the last definition will be used.
hu: De az OTRS-nek sebességi okok miatt a fordításokra Perl-fájlokban van szüksége. Az ``otrs.Console.pl Dev::Tools::TranslationsUpdate`` parancs ezeket a fájlokat is elő fogja állítani. Két különböző fordítási gyorsítótár fájltípus létezik, amelyek a következő sorrendben kerülnek felhasználásra. Ha egy szó vagy mondat újra meg van adva egy fordítási fájlban, akkor a legutolsó meghatározást fogja használni.
zh_cn: 但出于速度原因，OTRS要求翻译出现在Perl文件中。 这些文件也将由 ``otrs.Console.pl Dev::Tools::TranslationsUpdate`` 生成。 有两种不同的转换缓存文件类型，按以下顺序使用。 如果在翻译文件中重新定义了单词/句子，则将使用最后一个定义的。

source: Default framework translation file: ``Kernel/Language/$Language.pm``
hu: Alapértelmezett keretrendszer fordítási fájl: ``Kernel/Language/$Language.pm``
zh_cn: 默认的框架翻译文件：``Kernel/Language/$Language.pm``

source: Custom translation file: ``Kernel/Language/$Language_Custom.pm``
hu: Egyéni fordítási fájl: ``Kernel/Language/$Language_Custom.pm``
zh_cn: 自定义的翻译文件：``Kernel/Language/$Language_Custom.pm``

source: Default Framework Translation File
hu: Alapértelmezett keretrendszer fordítási fájl
zh_cn: 默认的框架翻译文件

source: The default framework translation file includes the basic translations. The following is an example of a default framework translation file.
hu: Az alapértelmezett keretrendszer fordítási fájl tartalmazza az alapvető fordításokat. Az alábbi egy alapértelmezett keretrendszer fordítási fájl példája.
zh_cn: 默认的框架翻译文件包括基本的翻译。 下面是一个默认的框架翻译文件的一个例子。

source: Custom Translation File
hu: Egyéni fordítási fájl
zh_cn: 自定义的翻译文件

source: The custom translation file is read out last and so its translation which will be used. If you want to add your own wording to your installation, create this file for your language.
hu: Az egyéni fordítási fájl kerül beolvasásra legutoljára, és így annak fordítása, amely használva lesz. Ha saját megfogalmazást szeretne hozzáadni a telepítéshez, akkor hozza létre ezt a fájlt a nyelvéhez.
zh_cn: 自定义翻译文件最后读出并使用其翻译。 如果要在安装中添加自己的措辞，请为您的语言创建此文件。

source: The language files for the new interface are now part of the built application (static JSON). When you add a custom language file to the file system, you need to rebuild the application for the change to be considered. To trigger the rebuild, restart the server with the ``--deploy-assets`` option:
hu: Az új felület nyelvi fájljai mostantól az összeállított alkalmazás (statikus JSON) része. Ha egyéni nyelvi fájlt ad hozzá a fájlrendszerhez, akkor újra össze kell állítania az alkalmazást a változtatások figyelembe vételéhez. Az ismételt összeállítás aktiválásához indítsa újra a kiszolgálót a ``--deploy-assets`` kapcsolóval:
zh_cn: 新接口的语言文件现在是构建应用程序（静态JSON）的一部分。将自定义语言文件添加到文件系统时，需要重新生成应用程序以使更改生效。要触发重建，请使用 ``--deploy-assets`` 选项重新启动服务器：

source: During the build process, the language files will be refreshed and will take any ``*_Custom.pm`` into account.
hu: Az összeállítási folyamat során a nyelvi fájlok frissítve lesznek, és az összes ``*_Custom.pm`` fájl is életbe fog lépni.
zh_cn: 在构建过程中，语言文件将被刷新，任何 ``*_Custom.pm`` 都会被处理。

source: The Translation Process Itself
hu: Maga a fordítási folyamat
zh_cn: 翻译过程本身

source: OTRS uses `Weblate <https://translate.otrs.com/>`__ to manage the translation process. Please see :doc:`../contributing/translate` section for details.
hu: Az OTRS a `Weblate <https://translate.otrs.com/>`__ fordítószoftvert használja a fordítási folyamat kezeléséhez. A részletekért nézze meg a :doc:`../contributing/translate` szakaszt.
zh_cn: OTRS使用 `Weblate <https://translate.otrs.com/>`__ 来管理翻译过程。 有关详细信息，请参阅 :doc:`../contributing/translate` 部分。

source: Using The Translated Data From The Code
hu: A lefordított adatok használata a kódból
zh_cn: 使用代码中的翻译数据

source: You can use the method ``$LanguageObject->Translate()`` to translate strings at runtime from Perl code, and the ``Translate()`` tag in :doc:`templates`.
hu: Használhatja a ``$LanguageObject->Translate()`` metódust a szövegek lefordításához futási időben a Perl-kódból, és a ``Translate()`` címkét a :doc:`templates` esetén.
zh_cn: 您可以使用 ``$LanguageObject->Translate()`` 方法在运行时从Perl代码翻译字符串，在 :doc:`templates` 中使用 ``Translate()`` 标记。

source: How to Extend OTRS
hu: Hogyan bővíthető az OTRS
zh_cn: 如何扩展OTRS

source: Using the power of the OTRS module layers
hu: Az OTRS modulrétegek erejének használata
zh_cn: 使用OTRS模块层的功能
