Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: ``Path`` is actually the slug under which the route component will be available. The full URL in this case will be ``/external/hello-world``, and any subsequent path component will be passed as a parameter named ``headingText``. If your system has ``Frontend::PrefixPath`` configured, full URL will be prepended by it.
hu: A ``Path`` tulajdonképpen a rövid útvonal, ami alatt az útvonal összetevő elérhető lesz. A teljes URL ebben az esetben ``/external/hello-world`` lesz, és bármely további útvonal összetevő egy ``headingText`` nevű paraméterként kerül átadásra. Ha a rendszeren beállították a ``Frontend::PrefixPath`` értéket, akkor a teljes URL elé lesz fűzve.
zh_cn: ``Path`` 实际上是路由组件可用的slug。 在本例中完整的URL将是 ``/external/hello-world``，任何后续的路由组件都将作为名为 ``headingText`` 的参数传递。 如果您的系统配置了 ``Frontend::PrefixPath``，则会在其前面加上完整的URL。

source: ``Alias`` can be used to provide an alias for the same route (e. g. ``/hello-world-alt``). It will point to the same component.
hu: Az ``Alias`` használható egy álnév adásához ugyanarra az útvonalra (például ``/hello-world-alt``). Ugyanarra az összetevőre fog mutatni.
zh_cn: ``Alias`` 可用于为同一路由提供别名（例如 ``/hello-world-alt``）。 它将指向相同的组件。

source: ``Component`` is the component identifier, first part of the filename, without the ``.vue`` extension. In case of component folders, it's the name of the root folder. See :ref:`Component Folders` for more information.
hu: A ``Component`` az összetevő azonosítója, a fájlnév első része a ``.vue`` kiterjesztés nélkül. Összetevőmappák esetén ez a gyökér mappa neve. További információkért nézze meg az :ref:`component folders` fejezetet.
zh_cn: ``Component`` 是组件标识符，文件名的第一部分，没有 ``.vue`` 扩展名。 如果是组件文件夹，则它是根文件夹的名称。 有关更多信息，请参阅 :ref:`Component Folders`。

source: ``IsPublic`` defines if the route will be accessible by unauthenticated users (0/Empty - not accessible, 1 - accessible).
hu: Az ``IsPublic`` határozza meg, hogy az útvonal elérhető legyen-e a nem hitelesített felhasználóknak (0 vagy üres – nem érhető el, 1 – elérhető).
zh_cn: ``IsPublic`` 定义未经身份验证的用户是否可以访问该路由（0/空 - 不可访问，1 - 可访问）。

source: ``Props`` defines if the route will be passed URI parameters as prop values (0/Empty - not passed, 1 - passed). See :ref:`Passing Parameters to the Route Component` for more information.
hu: A ``Props`` határozza meg, hogy az útvonal át fog-e adni URI paramétereket prop értékekként (0 vagy üres – nincs átadva, 1 – átadva). További információkért nézze meg a :ref:`Passing Parameters to the Route Component` fejezetet.
zh_cn: ``Props`` 定义路由是否将URI参数作为prop值传递（0 / Empty - 未传递，1 - 传递）。 有关更多信息，请参阅 :ref:`Passing Parameters to the Route Component` 。

source: Component Template Code
hu: Összetevő sablon kód
zh_cn: 组件模板代码

source: Let's fire up the code editor now and take a closer look at the ``HelloWorld.vue`` file that our skeleton command created.
hu: Most indítsuk el a kódszerkesztőt, és vessünk közelebbi pillantást a ``HelloWorld.vue`` fájlra, amit a csontváz parancsunk létrehozott.
zh_cn: 让我们现在启动代码编辑器，仔细看看我们的骨架命令创建的 ``HelloWorld.vue`` 文件。

source: Top part of the file contains a template section which should contain Vue.js template code. For example, let's modify it so it displays a heading with a text variable:
hu: A fájl felső része egy sablonszakaszt tartalmaz, amely Vue.js sablonkódot kell tartalmazzon. Például módosítsuk azt, hogy megjelenítsen egy címsort egy szöveges változóval:
zh_cn: 该文件的顶部包含一个模板部分，其中应包含Vue.js模板代码。 例如，让我们修改它，以便显示带有文本变量的标题：

source: OTRS supports number of filters, with ``translate`` being one of them. It even supports translation of string literals with placeholder values, you can use it like this:
hu: Az OTRS sok szűrőt támogat, ezek egyike a ``translate`` szűrő. Akkor is támogatja a szövegliterálok lefordítását, ha helykitöltő értékeket használ. Használhatja ehhez hasonlóan:
zh_cn: OTRS支持多个过滤器，``translate`` 就是其中之一。 它甚至支持使用占位符值转换字符串文字，您可以像这样使用它：

source: Component Core Code
hu: Összetevő alapkódja
zh_cn: 组件核心代码

source: Next, we add a support for a prop to our component core code block, following is a modified and abridged version suitable for an example:
hu: Ezután támogatást adunk egy prophoz az összetevő alapkód blokkjánál. A következő egy módosított és rövidített verzió, amely megfelel példaként:
zh_cn: 接下来，我们为组件核心代码块添加对prop的支持，以下是适用于示例的已修改和删节版本：

source: This adds a prop with the name ``headingText`` to our component, which is of type string and has a sensible default value.
hu: Ez hozzáad egy ``headingText`` nevű propot az összetevőnkhöz, amely szöveg típusú és van egy érzékeny alapértelmezett értéke.
zh_cn: 这会向我们的组件添加一个名为 ``headingText`` 的prop，它的类型为string，并且具有合理的默认值。

source: Usage of ``translatable()`` no-op method is limited to marking translatable strings which appear in the code. Please note that this is not required for string literals which are piped to the translate filter, as this will be assumed from the start. Rule of thumb is to use the marker anywhere where the string is not translated at the place where it is defined.
hu: A ``translatable()`` művelet nélküli metódus használata csak arra van korlátozva, hogy megjelölje azokat a lefordítható szövegeket, amelyek megjelennek a kódban. Ne feledje, hogy ez nem szükséges az olyan szövegliteráloknál, amelyek át lesznek küldve a fordítási szűrőn, mivel ezt a kezdettől fogva feltételezzük. Ökölszabályként használja a jelölőt minden olyan helyen, ahol a szöveg nincs azon a helyen lefordítva, ahol meghatározták.
zh_cn: ``translatable()`` no-op方法的用法仅限于标记出现在代码中的可翻译字符串。 请注意，对于通过管道传输到翻译过滤器的字符串文字，这不是必需的，因为这将从一开始就假定。 经验法则是在字符串未在定义位置翻译的任何位置使用标记。

source: Component Style Code
hu: Összetevő stílus kód
zh_cn: 组件样式代码

source: Last, but not the least, we have an option to specify styles used by the component. For this we have access to the SCSS, which is a flavor of SASS CSS extension set. To leverage it, just add a style tag at the end of the component file:
hu: Végül, de nem utoljára, lehetőségünk van az összetevő által használt stílus meghatározásához. Ehhez hozzá kell férnünk az SCSS-hez, amely a SASS CSS-kiterjesztés egyik változata. A kihasználásához egyszerűen adjon hozzá egy stílus címkét az összetevő fájl végénél:
zh_cn: 最后，但并非最不重要，我们可以选择指定组件使用的样式。 为此，我们可以访问SCSS，它是SASS CSS扩展集的一种风格。 要利用它，只需在组件文件的末尾添加样式标记：

source: Inside the style block, you will have access to certain set of global variables and mixins. Please refer to the framework code for details (take a look at the ``Frontend/Styles/globals.js``).
hu: A stílusblokkon belül hozzá kell férnie globális változók és mixinek bizonyos halmazához. Nézze meg a keretrendszer kódját a részletekért (vessen egy pillantást a ``Frontend/Styles/globals.js`` fájlra).
zh_cn: 在样式块中，您可以访问某些全局变量和mixin。 有关详细信息，请参阅框架代码（请参阅 ``Frontend/Styles/globals.js``）。

source: Please note that while the styles will be loaded only when your component is referenced, these will be globally available afterwards since the CSS is inherently global for the same page. There is an option to scope the styles just to your component, you can do this via the ``scoped`` attribute on the style tag, but this might not be necessary with clever usage of BEM approach in designing your class names.
hu: Ne feledje, hogy míg a stílusok csak akkor lesznek betöltve, amikor az összetevőre hivatkoznak, addig ezek globálisan elérhetők lesznek azután, mivel a CSS eredendően globális ugyanannál az oldalnál. Van lehetőség a stílus hatókörének beállításához kizárólag az összetevőre, ezt a ``scoped`` attribútumon keresztül teheti meg a stílus címkén, de ez nem mindig szükséges a blokkelem módosító megközelítés okosabb használatával az osztálynevek tervezésekor.
zh_cn: 请注意，虽然仅在引用组件时才会加载样式，但之后这些样式将全局可用，因为CSS对于同一页面本质上是全局的。 可以选择将样式范围仅限于组件，可以通过样式标记上的 ``scoped`` 属性来实现，但在设计类名时巧妙使用BEM方法可能不需要这样做。【译注：BEM--前端命名方法论,BEM的意思就是块（block）、元素（element）、修饰符（modifier）,是由Yandex团队提出的一种前端命名方法论。这种巧妙的命名方法让你的CSS类对其他开发者来说更加透明而且更有意义。BEM命名约定更加严格，而且包含更多的信息，它们用于一个团队开发一个耗时的大项目。】

source: Passing Parameters to the Route Component
hu: Paraméterek átadása az útvonal összetevőnek
zh_cn: 传递参数给路由组件

source: In the route configuration above, we defined the route path that contains a parameter placeholder (``headingText``). By activating the ``Props`` flag, we made sure that the value of this parameter will be bound to our component prop with the same name every time a route is entered.
hu: A fenti útvonal beállításban meghatároztuk az útvonal elérési útját, amely egy paraméter helykitöltőt (``headingText``) tartalmaz. A ``Props`` jelző aktiválásával meggyőződtünk arról, hogy ennek a paraméternek az értéke hozzá lesz kötve az összetevő prophoz ugyanazzal a névvel minden esetben, amikor az útvonalra belépnek.
zh_cn: 在上面的路由配置中，我们定义一个包含参数占位符（``headingText``）的路由路径。 通过激活 ``Props`` 标志，我们确保每次进入路由时，此参数的值将绑定到具有相同名称的组件prop。

source: For example, if we enter the route via the ``/external/hello-world`` URL, our component prop will be undefined and therefore will get its default value.
hu: Például ha belépünk az útvonalra az ``/external/hello-world`` URL-en keresztül, akkor az összetevő propunk meghatározatlan lesz és ennélfogva megkapja az alapértelmezett értékét.
zh_cn: 例如，如果我们通过 ``/external/hello-world`` URL进入路由，我们的组件prop将是未定义的，因此将获得其默认值。

source: Passing Parameters - Default Prop Value
hu: Paraméterek átadása – alapértelmezett prop érték
zh_cn: 传递参数 - 默认Prop 值

source: But, if we access the route via the ``/external/hello-world/Value``, the prop will be set to string ``Value``, and even automatically translated in the current user language (where applicable).
hu: Azonban ha az ``/external/hello-world/Value`` URL-en keresztül lépünk be az útvonalra, akkor a prop beállításra kerül a ``Value`` szöveggel, és még automatikusan le is lesz fordítva az aktuális felhasználó nyelvére (ahol alkalmazható).
zh_cn: 但是，如果我们通过 ``/external/hello-world/Value`` 访问路由，prop将被设置为字符串 ``Value``，甚至自动翻译为当前用户语言（如果已有翻译）。

source: Passing Parameters - Translated Prop Value
hu: Paraméterek átadása – lefordított prop érték
zh_cn: 传递参数 - 已翻译的Prop 值

source: Component Folders
hu: Összetevőmappák
zh_cn: 组件目录

source: In case of self-enclosed components, you might want to ship some additional files with it. Sometimes it's better to modularize the code base since it's easier to maintain. In case of front end components you have a really simple way of doing this: component folders. Instead of a single ``.vue`` file for a component, enclose the file named ``index.vue`` in a folder named as your component. Something like this:
hu: Az önmagát tartalmazó összetevők esetén érdemes lehet néhány további fájlt is szállítani vele együtt. Néha jobb modulárissá tenni a kódbázist, mivel úgy egyszerűbb karbantartani. Az előtétprogram összetevők esetén egy igazán egyszerű módja van ennek: összetevőmappák. Egy összetevő önálló ``.vue`` fájlja helyett helyezze el az ``index.vue`` nevű fájlt egy olyan mappába, amelyet úgy nevez el, mint az összetevőt. Valahogy így:
zh_cn: 如果是自封闭组件，您可能需要随附一些其他文件。 有时最好模块化代码库，因为它更容易维护。 对于前端组件，您可以使用一种非常简单的方法：组件目录，而不是组件的单个 ``.vue`` 文件，将名为 ``index.vue`` 的文件包含在名为组件的目录中。 像这样的：

source: Then, simply add new files in the same folder, following a sane structure:
hu: Ezután egyszerűen adjon hozzá új fájlokat ugyanabba a mappába egy észszerű szerkezetet követve:
zh_cn: 然后，只需按照理智的结构在同一目录中添加新文件：

source: You get the idea. It will then be possible to reference the new files via relative paths, in order to achieve something like this in the parent component (``index.vue``):
hu: Megvan az ötlet. Ezután lehetőség van hivatkozni az új fájlokra relatív elérési úton keresztül, azért hogy valami ehhez hasonlót érjen el a szülő összetevőben (``index.vue``):
zh_cn: 你懂的。 然后可以通过相对路径引用新文件，以便在父组件（``index.vue``）中实现类似的功能：

source: Or, something like this:
hu: Vagy ehhez hasonlóan:
zh_cn: 或者，像这样：

source: Even external styles can be referenced in the correct block:
hu: Még a külső stílusok és hivatkozhatók a helyes blokkban:
zh_cn: 甚至可以在正确的块中引用外部样式：

source: With this approach you will be left with a packaged component in a single folder that follows the logical tree hierarchy, and makes all resources easily findable when needed.
hu: Ezzel a megközelítéssel otthagyhatja a csomagolt összetevőt egy önálló mappában, amely a logikus faszerkezetet követi, és egyszerűen megtalálhatóvá teszi az összes erőforrást, amikor szükséges.
zh_cn: 使用这种方法，您将在遵循逻辑树层次结构的单个目录中保留一个打包的组件，并使所有资源在需要时都易于查找。

source: Packaging Additional Vendor Modules
hu: További gyártók moduljainak csomagolása
zh_cn: 打包其它供应商模块

source: In certain cases, you might need to ship additional Node.js modules with your package. Unfortunately, both NPM and OTRS do not support easy addition of modules to the root ``node_modules/`` folder, but there is a mechanism to provide pre-packaged module files.
hu: Bizonyos esetekben szükség lehet további Node.js modulokat is szállítani a csomaggal. Sajnálatos módon sem az NPM, sem az OTRS nem támogatja a modulok egyszerű hozzáadását a gyökér ``node_modules/`` mappához, azonban létezik egy mechanizmus előre csomagolt modulfájlok biztosításához.
zh_cn: 在某些情况下，您可能需要在包中附加其它Node.js模块。 遗憾的是，NPM和OTRS都不支持在根 ``node_modules/`` 目录中轻松添加模块，但是有一种机制可以提供预先打包的模块文件。

source: Simply create a ``Frontend/Vendor`` folder in your package, and add your module resources in sub-folders within it.
hu: Egyszerűen hozzon létre egy ``Frontend/Vendor`` mappát a csomagjában, és adja hozzá a modul erőforrásait almappákon belül.
zh_cn: 只需在包中创建一个 ``Frontend/Vendor`` 目录，然后在其中的子目录中添加模块资源。

source: For example, let us assume we want to ship a useful ``vue-full-calendar`` component and its dependencies as part of our package. This component has following NPM dependencies:
hu: Például tegyük fel, hogy szállítani szeretnénk a hasznos ``vue-full-calendar`` összetevőt és annak függőségeit a csomagunk részeként. Ennek az összetevőnek a következő NPM függőségei vannak:
zh_cn: 例如，假设我们想要发送一个有用的 ``vue-full-calendar`` 组件及其依赖项作为我们的包的一部分。 该组件具有以下NPM依赖项：

source: However, some of its dependencies have even more dependencies and we can inspect them too:
hu: Azonban néhány függőségének még további függőségei is lehetnek, és megvizsgálhatjuk azokat is:
zh_cn: 但是，它的一些依赖项可能具有更多依赖项，我们也可以检查它们：

source: Quick check will inform us that both ``babel-runtime`` and ``moment`` are actually part of the OTRS framework dependencies:
hu: Egy gyors ellenőrzés tájékoztatni fog minket, hogy mind a ``babel-runtime``, mind a ``moment`` már valójában része az OTRS keretrendszer függőségeinek:
zh_cn: 快速检查会告诉我们 ``babel-runtime`` 和 ``moment`` 实际上都是OTRS框架依赖项的一部分：

source: This means that we don't have to ship those modules too, since they will be available out-of-box. While it's cumbersome to check all dependencies, it will be worthwhile because our package will be smaller. We will also prevent issues with overriding framework dependencies, since ``Frontend/Vendor`` wins always.
hu: Ez azt jelenti, hogy nem kell ezeket a modulokat is szállítanunk, mivel már elérhetők alapértelmezetten. Miközben nehézkes az összes függőséget ellenőrizni, mégis érdemes, mert a csomagunk kisebb lesz. Ezzel meg fogjuk akadályozni az olyan problémákat, ami a keretrendszer függőségeinek felülírásából adódik, mivel a ``Frontend/Vendor`` nyer mindig.
zh_cn: 这意味着我们也不必打包这些模块，因为它们可以开箱即用。 虽然检查所有依赖项很麻烦，但这是值得的，因为我们的包会更小。 我们还将防止覆盖框架依赖性的问题，因为 ``Frontend/Vendor`` 总是获胜。

source: Let's now install what we need and discard what we don't need. The easiest way to do it is via the following NPM command:
hu: Most telepítsük, amire szükségünk van, és dobjuk el, amire nincs szükségünk. A legegyszerűbb mód ennek elvégzéséhez a következő NPM parancs futtatása:
zh_cn: 现在安装我们需要的东西并丢弃我们不需要的东西。 最简单的方法是通过以下NPM命令：

source: Now we remove those modules which we know are provided by the framework:
hu: Most eltávolítjuk azokat a modulokat, amelyekről tudjuk, hogy a keretrendszer biztosítja:
zh_cn: 现在删除那些我们知道由框架提供的模块：

source: Much better. Now we move the modules to their correct place:
hu: Sokkal jobb. Most áthelyezzük a modulokat a megfelelő helyre:
zh_cn: 好多了。 现在将模块移动到正确的位置：

source: Final optimization would be to remove unneeded files from the specific module folders. This might prove to be complicated, but it's worth it since it will further reduce size of the modules and number of files that need to be included in the package.
hu: A végső optimalizáció az lenne, hogy eltávolítja a szükségtelen fájlokat az adott modulmappából. Ez bonyolultnak bizonyulhat, de megéri, mivel tovább csökkenti a modul méretét és a fájlok számát, amelyeket fel kell venni a csomagba.
zh_cn: 最终的优化是从特定模块文件夹中删除不需要的文件。 这可能会很复杂，但它值得，因为它会进一步减少模块的大小和需要包含在包中的文件数量。

source: For example, let's remove minimized JS files from the ``fullcalendar`` module because we identified that the Vue component uses full dist files only:
hu: Például távolítsuk el a minimalizált JavaScript fájlokat a ``fullcalendar`` modulból, mert azt vettük észre, hogy a Vue összetevő csak a teljes disztribúciófájlokat használja:
zh_cn: 例如，让我们从 ``fullcalendar`` 模块中删除最小化的JS文件，因为我们发现Vue组件仅使用完整的dist文件：

source: It's also safe to remove jQuery source and minimized files as well, since the ``fullcalendar`` uses original dist files too:
hu: Biztonságosan eltávolíthatók a jQuery forrás és a minimalizált fájlok is, mivel a ``fullcalendar`` az eredeti disztribúciófájlokat is használja:
zh_cn: 由于 ``fullcalendar`` 也使用原始dist文件，因此删除jQuery源和最小化文件也是安全的：

source: We are left with approx. 100+ files which we need to include in our SOPM files, like any other regular package file. Once we do this, these dependencies will be present and resolvable in the target system:
hu: Maradt körülbelül 100+ fájl, amelyet fel kell vennünk az SOPM fájlunkba, úgymint bármilyen egyéb megszokott csomagfájlba. Amikor ezt megtesszük, akkor ezek a függőségek jelen lesznek és feloldhatóvá válnak a célrendszeren:
zh_cn: 我们留下约100多个需要包含在我们的SOPM文件中的文件，就像任何其他常规包文件一样。 完成此操作后，这些依赖项将在目标系统中存在并可解析：

source: Writing A New OTRS Front End Module
hu: Egy új OTRS előtétprogram-modul írása
zh_cn: 编写新的OTRS前端模块

source: In this chapter, the writing of a new OTRS module is illustrated on the basis of a simple small program. Necessary prerequisite is an OTRS development environment as specified in the chapter of the same name.
hu: Ebben a fejezetben egy új OTRS modul írása van szemléltetve egy egyszerű kis program alapján. A szükséges előkövetelmény egy olyan OTRS fejlesztői környezet, amely a hasonló nevű fejezetben van megadva.
zh_cn: 在本节中，基于一个简单的小程序来说明新OTRS模块的编写。 必要的先决条件是在开发环境章节中指定的OTRS开发环境。

source: What we want to write
hu: Mit szeretnénk írni
zh_cn: 要编写的内容

source: We want to write a little OTRS module that displays the text 'Hello World' when called up. First of all we must build the directory ``/Hello World`` for the module in the developer directory. In this directory, all directories existent in OTRS can be created. Each module should at least contain the following directories:
hu: Szeretnénk írni egy olyan kis OTRS modult, amely a „Hello World” szöveget jeleníti meg, amikor előhívják. Mindenek előtt fel kell építenünk a ``/Hello World`` könyvtárat a modulhoz a fejlesztői könyvtárban. Ebben a könyvtárban létrehozható az OTRS-ben meglévő összes könyvtár. Minden modulnak legalább a következő könyvtárakat kell tartalmaznia:
zh_cn: 我们想要编写一个小的OTRS模块，在调用时显示文本“Hello World”。 首先，我们必须为开发人员目录中的模块构建 ``/Hello World`` 目录。 在此目录中，可以创建OTRS中存在的所有目录。 每个模块至少应包含以下目录：

source: Default Config File
hu: Alapértelmezett beállítófájl
zh_cn: 默认配置文件

source: The creation of a module registration facilitates the display of the new module in OTRS. Therefore we create a file ``/Kernel/Config/Files/XML/HelloWorld.xml``. In this file, we create a new config element. The impact of the various settings is described in the chapter :doc:`../how-it-works/config-mechanism`.
hu: Egy modulregisztráció létrehozása megkönnyíti az új modul megjelenítését az OTRS-ben. Ezért létrehozunk egy ``/Kernel/Config/Files/XML/HelloWorld.xml`` fájlt. Ebben a fájlban létrehozunk egy új beállítási elemet. A különféle beállítások hatása a :doc:`../how-it-works/config-mechanism` fejezetben van leírva.
zh_cn: 创建模块注册有助于在OTRS中显示新模块。 因此我们创建一个文件 ``/Kernel/Config/Files/XML/HelloWorld.xml``。 在这个文件中，我们创建了一个新的配置元素。 各种设置的影响在 :doc:`../how-it-works/config-mechanism` 章节中描述。

source: Front End Module
hu: Előtétprogram-modul
zh_cn: 前端模块

source: After creating the links and executing the system configuration, a new module with the name 'HelloWorld' is displayed. When calling it up, an error message is displayed as OTRS cannot find the matching front end module yet. This is the next thing to be created. To do so, we create the following file:
hu: A hivatkozások létrehozása és a rendszerbeállítások végrehajtása után megjelenik egy új modul „HelloWorld” néven. Előhívásakor egy hibaüzenet jelenik meg, mivel az OTRS még nem találja a hozzá tartozó előtétprogram modult. Ez a következő dolog, amit létre kell hozni. Ehhez hozzuk létre az alábbi fájlt:
zh_cn: 创建链接并执行系统配置后，将显示名为“HelloWorld”的新模块。 调用它时，会显示一条错误消息，因为OTRS尚未找到匹配的前端模块。 这是接下来要创建的东西。 为此，我们创建以下文件：

source: Core Module
hu: Alapmodul
zh_cn: 核心模块

source: Next, we create the file for the core module ``/HelloWorld/Kernel/System/HelloWorld.pm`` with the following content:
hu: Ezután hozzunk létre egy fájlt a ``/HelloWorld/Kernel/System/HelloWorld.pm`` alapmodulhoz az alábbi tartalommal:
zh_cn: 接下来，我们使用以下内容为核心模块 ``/HelloWorld/Kernel/System/HelloWorld.pm`` 创建文件：

source: Template File
hu: Sablonfájl
zh_cn: 模板文件

source: The last thing missing before the new module can run is the relevant HTML template. Thus, we create the following file:
hu: Az utolsó hiányzó dolog, mielőtt az új modul futtatható lenne, a hozzá tartozó HTML sablon. Ezért hozzuk létre az alábbi fájlt:
zh_cn: 新模块可以运行之前缺少的最后一件事是相关的HTML模板。 因此，我们创建以下文件：

source: The module is working now and displays the text *Hello World* when called.
hu: A modul most már működik, és a meghívásakor megjeleníti a *Hello World* szöveget.
zh_cn: 该模块现在正在工作，并在调用时显示文本 *Hello World*。

source: Language File
hu: Nyelvi fájl
zh_cn: 语言文件

source: If the text *Hello World!* is to be translated into for instance German, you can create a translation file for this language in ``HelloWorld/Kernel/Language/de_AgentHelloWorld.pm``. Example:
hu: Ha a *Hello World!* szöveget le kell fordítani például magyarra, akkor létrehozhat egy fordítási fájlt ehhez a nyelvhez a ``HelloWorld/Kernel/Language/hu_AgentHelloWorld.pm`` helyre. Példa:
zh_cn: 如果要将文本 *Hello World！* 翻译成其它语言如德语，您可以在 ``HelloWorld/Kernel/Language/de_AgentHelloWorld.pm`` 中为该语言创建翻译文件。 例如：

source: Summary
hu: Összefoglaló
zh_cn: 摘要

source: The example given above shows that it is not too difficult to write a new module for OTRS. It is important, though, to make sure that the module and file name are unique and thus do not interfere with the framework or other expansion modules. When a module is finished, an OPM package must be generated from it (see chapter :doc:`../how-to-publish-otrs-extensions/package-building`).
hu: A fent megadott példa azt mutatja be, hogy nem túl bonyolult egy új modult írni az OTRS-hez. Fontos azonban meggyőződni arról, hogy a modul és a fájlnév egyedi legyen, és ennélfogva ne ütközzenek a keretrendszerrel vagy egyéb kiterjesztő modulokkal. Amikor egy modul elkészült, akkor egy OPM csomagot kell előállítani belőle (lásd a :doc:`../how-to-publish-otrs-extensions/package-building` fejezetet).
zh_cn: 上面给出的示例表明，为OTRS编写新模块并不困难。 但是，重要的是确保模块和文件名是唯一的，从而不会干扰框架或其他扩展模块。 模块完成后，必须从中生成一个OPM包（参见 :doc:`../how-to-publish-otrs-extensions/package-building`）。

source: How to Publish Your OTRS Extensions
hu: Hogyan tehetők közzé az OTRS kiterjesztések
zh_cn: 如何发布你的OTRS扩展

source: Package Building
hu: Csomagkészítés
zh_cn: 创建软件包
