Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: Additional Resources
hu: További erőforrások
zh_cn: 其它资源

source: The OTRS website with source code, documentation and news is available at `www.otrs.com <https://www.otrs.com/>`__. Here you can also find information about professional services and OTRS administrator training seminars from OTRS Group, the creator of OTRS.
hu: Az OTRS weboldala a forráskóddal, dokumentációval és hírekkel a `www.otrs.com <https://www.otrs.com/>`__ címen érhető el. Itt a hivatalos szakmai szolgáltatásokkal és az OTRS adminisztrátorképzési szemináriumokkal kapcsolatos információkat is megtalálja az OTRS csoporttól, az OTRS készítőjétől.
zh_cn: 含有源代码、文档和新闻的OTRS网站为 `www.otrs.com <https://www.otrs.com/>`__。 在这里，您还可以找到来自OTRS创始人--OTRS集团关于专业服务和OTRS管理员培训研讨会的信息。

source: Online API Library
hu: Internetes API könyvtár
zh_cn: 在线API库

source: The OTRS developer API documentation is available for `Perl`_ and `JavaScript`_.
hu: Az OTRS fejlesztői API dokumentáció elérhető a `Perl`_ és a `JavaScript`_ programnyelvekhez.

source: Developer Mailing List
hu: Fejlesztői levelezőlista
zh_cn: 开发者邮件列表

source: The OTRS developer mailing list is available at https://lists.otrs.org/.
hu: Az OTRS fejlesztői levelezőlista a https://lists.otrs.org/ címen érhető el.

source: Contributing to OTRS
hu: Közreműködés az OTRS-ben
zh_cn: 为OTRS做出贡献

source: This chapter will show how you can contribute to the OTRS framework, so that other users will be able to benefit from your work.
hu: Ez a fejezet azt fogja bemutatni, hogy hogyan működhet közre az OTRS keretrendszerben azért, hogy a többi felhasználó is képes legyen hasznot húzni a munkájából.
zh_cn: 本章将介绍如何为OTRS框架做出贡献，以便其它用户能够从您的工作中获益。

source: Contents
hu: Tartalom
zh_cn: 目录

source: Accessibility Guide
hu: Akadálymentesítési útmutató
zh_cn: 无障碍环境指南

source: This document is supposed to explain basics about accessibility issues and give guidelines for contributions to OTRS.
hu: Ez a dokumentum hivatott elmagyarázni az akadálymentesítési problémákkal kapcsolatos alapokat, és irányelveket ad az OTRS-ben való közreműködéshez.
zh_cn: 本文试图解释关于无障碍环境问题的基础知识，并给予指导方针，以便为OTRS做出贡献。

source: Accessibility Basics
hu: Akadálymentesítési alapok
zh_cn: 无障碍环境基础

source: What is Accessibility?
hu: Mi az akadálymentesítés?
zh_cn: 什么是无障碍环境？

source: Accessibility is a general term used to describe the degree to which a product, device, service or environment is accessible by as many people as possible. Accessibility can be viewed as the *ability to access* and possible benefit of some system or entity. Accessibility is often used to focus on people with disabilities and their right of access to entities, often through use of assistive technology.
hu: Az akadálymentesítés egy általános kifejezés annak leírásához, hogy egy termék, eszköz, szolgáltatás vagy környezet milyen mértékben érhető el a lehető legtöbb ember által. Az akadálymentesítés tekinthető úgyis mint *képesség a hozzáféréshez*, és néhány rendszer vagy dolog lehetséges előnyeként. Az akadálymentesítés gyakran a fogyatékkal rendelkező emberekre és a dolgokhoz való hozzáférésük jogára összpontosít, gyakran kisegítő technológiák használatán keresztül.
zh_cn: 无障碍环境是一个通用术语，用于描述尽可能多的人可以访问产品、设备、服务或环境的程度。 无障碍环境可被视为*访问*的能力以及某些系统或实体的可能益处。 可访问性通常用于关注残疾人及其访问实体的权利，通常通过使用辅助技术。

source: In the context of web development, accessibility has a focus on enabling people with impairments full access to web interfaces. For example, this group of people can include partially visually impaired or completely blind people. While the former can still partially use the GUI, the latter have to completely rely on assistive technologies such as software which reads the screen to them (screen readers).
hu: A webfejlesztés környezetében akadálymentesítéskor a sérült embereknek a webes felületekhez való teljes hozzáférés engedélyezésén van a hangsúly. Például az emberek ezen csoportja részlegesen látássérült vagy teljesen vak embereket tartalmazhat. Míg az előbbiek továbbra is képesek részlegesen használni a grafikus felhasználói felületet, addig az utóbbiaknak teljes mértékben a kisegítő technológiákra kell támaszkodniuk, az olyan szoftverekre, amelyek felolvassák számukra a képernyőt (képernyőolvasók).
zh_cn: 在Web开发的上下文中，无障碍环境集中于使受损害的人能够完全访问Web界面。 例如，这群人可能包括部分视力障碍或完全失明的人。 虽然前者仍然可以部分使用GUI，但是后者必须完全依赖辅助技术，例如向他们读屏幕的软件（屏幕阅读软件）。

source: Why is it important for OTRS?
hu: Miért fontos ez az OTRS-nél?
zh_cn: 为什么它对OTRS很重要？

source: To enable impaired users access to OTRS systems is a valid goal in itself. It shows respect.
hu: A sérült felhasználóknak történő hozzáférés engedélyezése az OTRS rendszerekhez önmagában indokolt cél. Tiszteletet tanúsít.
zh_cn: 使受损用户访问OTRS系统本身是一个有效的目标。 它体现了尊重。

source: Furthermore, fulfilling accessibility standards is becoming increasingly important in the public sector (government institutions) and large companies, which both belong to the target markets of OTRS.
hu: Továbbá az akadálymentesítési szabványok teljesítése egyre inkább fontossá válik az állami szektorban (kormányzati intézményeknél) és a nagyvállalatoknál, amely mindkettő az OTRS célcsoportjához tartozik.
zh_cn: 此外，在属于OTRS目标市场的公共部门（政府机构）和大型公司，实现无障碍环境标准变得越来越重要。

source: How can I successfully work on accessibility issues even if I am not disabled?
hu: Hogyan tudok sikeresen dolgozni az akadálymentesítési problémákon akkor is, ha nem vagyok fogyatékos?
zh_cn: 如果我没有受损，我如何成功地处理无障碍环境问题？

source: This is very simple. Pretend to be blind.
hu: Ez nagyon egyszerű. Tegyen úgy, mintha vak lenne.
zh_cn: 这很简单， 假装失明。

source: Don't use the mouse.
hu: Ne használja az egeret.
zh_cn: 不要使用鼠标。

source: Don't look at the screen.
hu: Ne nézzen a képernyőre.
zh_cn: 不要看屏幕。

source: Then try to use OTRS with the help of a screen reader and your keyboard only. This should give you an idea of how it will feel for a blind person.
hu: Ezután próbálja meg az OTRS-t csak egy képernyőolvasó és a billentyűzet segítségével használni. Ez ötletet adhat arra, hogy mit fog érezni egy vak ember.
zh_cn: 然后尝试在屏幕阅读器和键盘的帮助下使用OTRS。 这应该可以让您了解盲人的感受。

source: Ok, but I don't have a screen reader!
hu: Rendben, de nincs képernyőolvasóm!
zh_cn: 好的，但我没有屏幕阅读软件！

source: While commercial screen readers such as JAWS (perhaps the best known one) can be extremely expensive, there are open source screen readers which you can install and use:
hu: Amíg a kereskedelmi képernyőolvasók - mint például a JAWS (talán a legismertebb) - nagyon drágák lehetnek, léteznek nyílt forrású képernyőolvasók, amelyeket telepíthet és használhat:
zh_cn: 虽然诸如JAWS（可能是最著名的）的商业屏幕阅读软件可能非常昂贵，但是有一些可以安装和使用的开源屏幕阅读软件：

source: `NVDA <http://www.nvaccess.org/>`__, a screen reader for Windows.
hu: `NVDA <http://www.nvaccess.org/>`__, egy képernyőolvasó Windows alá.
zh_cn: `NVDA <http://www.nvaccess.org/>`__，用于Windows的屏幕阅读器。

source: `ORCA <https://wiki.gnome.org/Projects/Orca>`__, a screen reader for Gnome/Linux.
hu: `ORCA <https://wiki.gnome.org/Projects/Orca>`__, egy képernyőolvasó Gnome/Linux alá.
zh_cn: `ORCA <https://wiki.gnome.org/Projects/Orca>`__，用于Gnome/Linux的屏幕阅读器。

source: Now you don't have an excuse any more. ;)
hu: Most már nincs többé mentsége. ;)
zh_cn: 现在你再没有借口了。 ;)

source: Accessibility Standards
hu: Akadálymentesítési szabványok
zh_cn: 无障碍环境标准

source: This section is included for reference only, you do not have to study the standards themselves to be able to work on accessibility issues in OTRS. We'll try to extract the relevant guidelines in this document.
hu: Ez a szakasz csak hivatkozásként szolgál, nem kell magát a szabványokat áttanulmányoznia ahhoz, hogy képes legyen akadálymentesítési problémákon dolgozni az OTRS-ben. Megpróbáljuk kigyűjteni a fontos irányelveket ebben a dokumentumban.
zh_cn: 本部分仅供参考，您无需研究标准本身就能够处理OTRS中的可访问性问题。 我们将尝试在本文档中提取相关指南。

source: Web Content Accessibility Guidelines (WCAG)
hu: Webtartalom akadálymentesítési irányelvek (WCAG)
zh_cn: 网页内容无障碍环境指南（WCAG）

source: This W3C standard gives general guidelines for how to create accessible web pages.
hu: Ez a W3C szabvány általános irányelveket ad ahhoz, hogyan hozhatók létre akadálymentes weboldalak.
zh_cn: 这个W3C标准为如何创建可访问的网页提供了通用指南。

source: `How to Meet WCAG 2.0 <http://www.w3.org/WAI/WCAG20/quickref/>`__
hu: `Hogyan tegyen eleget a WCAG 2.0 szabványnak <http://www.w3.org/WAI/WCAG20/quickref/>`__
zh_cn: `如何满足 WCAG 2.0 <http://www.w3.org/WAI/WCAG20/quickref/>`__

source: `Understanding WCAG 2.0 <http://www.w3.org/TR/UNDERSTANDING-WCAG20/>`__
hu: `A WCAG 2.0 megértése <http://www.w3.org/TR/UNDERSTANDING-WCAG20/>`__
zh_cn: `理解 WCAG 2.0 <http://www.w3.org/TR/UNDERSTANDING-WCAG20/>`__

source: WCAG has different levels of accessibility support. We currently plan to support level A, as AA and AAA deal with matters that seem not relevant for OTRS.
hu: A WCAG az akadálymentesítési támogatás különböző szintjeivel rendelkezik. Jelenleg az A szint támogatását tervezzük, ugyanis az AA és az AAA olyan kérdésekkel foglalkozik, amely nem tűnik fontosnak az OTRS-nél.
zh_cn: WCAG具有不同级别的可访问性支持。 我们目前计划支持A级，因为AA和AAA处理与OTRS无关的事项。

source: Accessible Rich Internet Applications (WAI-ARIA) 1.0
hu: Akadálymentes gazdag internetes alkalmazások (WAI-ARIA) 1.0
zh_cn: 可访问的互联网应用（WAI-ARIA）1.0

source: This standard deals with the special issues arising from the shift away from static content to dynamic web applications. It deals with questions like how a user can be notified of changes in the user interface resulting from AJAX requests, for example.
hu: Ez a szabvány foglalkozik a statikus tartalom eltolásából eredő különleges problémákkal a dinamikus webalkalmazásoknál. Olyan kérdésekkel foglalkozik, mint például hogyan értesülhet a felhasználó az AJAX kérésekből eredményezett felhasználói felület változásairól.
zh_cn: 本标准涉及从静态内容转移到动态Web应用程序引起的特殊问题。 它处理诸如用户如何从AJAX请求产生的用户界面变化得到通知之类的问题。

source: Implementation guidelines
hu: Megvalósítási irányelvek
zh_cn: 实施指南

source: Provide alternatives for non-text content
hu: Alternatívák biztosítása a nem szöveges tartalomhoz
zh_cn: 提供非文本内容的替代方案

source: Goal: *All non-text content that is presented to the user has a text alternative that serves the equivalent purpose.* (WCAG 1.1.1)
hu: Cél: *a felhasználónak megjelenő összes nem szöveges tartalomnak legyen szöveges alternatívája, amely ugyanazt a célt szolgálja.* (WCAG 1.1.1)
zh_cn: 目标： *呈现给用户的所有非文本内容都有一个文本替代方案，用于同等目的* （WCAG 1.1.1）

source: It is very important to understand that screen readers can only present textual information and available metadata to the user. To give you an example, whenever a screen reader sees ``<a href="#" class="CloseLink"></a>``, it can only read *link* to the user, but not the target of this link. With a slight improvement, it would be accessible: ``<a href="#" class="CloseLink" title="Close this widget"></a>``. In this case the user would hear *link close this widget*, voila!
hu: Nagyon fontos megérteni, hogy a képernyőolvasók csak a szöveges információkat és az elérhető metaadatokat tudják megjeleníteni a felhasználónak. Hogy egy példát mondjunk, amikor egy képernyőolvasó a ``<a href="#" class="CloseLink"></a>`` hivatkozást látja, akkor csak a *hivatkozást* tudja felolvasni a felhasználónak, nem a hivatkozás célját. Egy apró fejlesztéssel akadálymentessé válhat: ``<a href="#" class="CloseLink" title="Close this widget"></a>``. Ebben az esetben a felhasználó a *hivatkozás felületi elem bezárása* szöveget hallhatja, íme!
zh_cn: 理解屏幕阅读器只能向用户呈现文本信息和可用元数据是非常重要的。 举个例子，每当屏幕阅读器看到 ``<a href="#" class="CloseLink"></a>`` 时，它只能读取* 链接 *给用户，而不是这个链接的目标。 稍微改进一下就可以访问：``<a href="#" class="CloseLink" title="关闭这个小部件"></a>``。 在这种情况下，用户会听到*链接 关闭这个小部件*，瞧！

source: It is important to always formulate the text in a most *speaking* way. Just imagine it is the only information that you have. Will it help you? Can you understand its purpose just by hearing it?
hu: Fontos, hogy a szöveget mindig a leginkább *beszédes* módon fogalmazza meg. Egyszerűen képzelje el, hogy csak ennyi információval rendelkezik. Segíteni fog önnek? Képes megérteni a célját pusztán hallás után?
zh_cn: 始终以最 *口语* 的方式表述文本非常重要。想象一下，这是你拥有的唯一信息，它会帮到你吗？ 你只听到它就能理解它的目的吗？

source: Please follow these rules when working on OTRS:
hu: Kövesse ezeket a szabályokat, amikor az OTRS-en dolgozik:
zh_cn: 使用OTRS时请遵从这些规则：

source: *Rule*: Wherever possible, use speaking texts and formulate in real, understandable and precise sentences. *Close this widget* is much better than *Close*, because the latter is redundant.
hu: *Szabály*: Ahol csak lehetséges, használjon beszédes szövegeket, és fogalmazzon meg valódi, érthető és pontos mondatokat. A *Felületi elem bezárása* sokkal jobb mint a *Bezárás*, mert az utóbbi fölösleges.
zh_cn: *规则*：尽可能使用口头文本并用真实、可理解和精确的句子表达。 *关闭这个小部件* 比 *关闭* 好得多，因为后者是冗余的。

source: *Rule*: Links always must have either text content that is spoken by the screen reader (``<a href="#" >Delete this entry</a>``), or a ``title`` attribute (``<a href="#" title="Close this widget"></a>``).
hu: *Szabály*: A hivatkozásoknak mindig legyen vagy olyan szöveges tartalma, amelyet a képernyőolvasók kimondanak (``<a href="#" >Delete this entry</a>``), vagy ``title`` attribútuma (``<a href="#" title="Close this widget"></a>``).
zh_cn: *规则*：链接始终必须具有屏幕阅读器能说的文本内容（ ``<a href="#">删除此条目</a>``）或 ``title`` 属性（ ``<a href="#" title="关闭这个小部件"></a>`` ）。

source: *Rule*: Images must always have an alternative text that can be read to the user (``<img src="house.png" alt="Image of a house" />``).
hu: *Szabály*: A képeknek mindig legyen alternatív szövege, amely felolvasható a felhasználónak (``<img src="house.png" alt="Image of a house" />``).
zh_cn: *规则*：图片必须始终有一个可以读给用户的替代文本（ ``<img src="house.png" alt="一座房子的图片" />``）。

source: Make navigation easy
hu: A navigáció könnyűvé tétele
zh_cn: 使导航变得容易

source: Goal: *Allow the user to easily navigate the current page and the entire application.*
hu: Cél: *lehetővé tenni a felhasználónak, hogy könnyen navigáljon az aktuális oldalon és az egész alkalmazásban.*
zh_cn: 目标：*允许用户轻松浏览当前页面和整个应用程序。*

source: The ``title`` tag is the first thing a user hears from the screen reader when opening a web page. For OTRS, there is also always just one ``h1`` element on the page, indicating the current page (it contains part of the information from ``title``). This navigational information helps the user to understand where they are, and what the purpose of the current page is.
hu: A ``title`` címke az első dolog, amit a felhasználó hall a képernyőolvasótól, amikor megnyit egy weboldalt. Az OTRS-nél mindig csak egyetlen ``h1`` elem van az oldalon az aktuális oldalt jelezve (a ``title`` elemből vett információ egy részét tartalmazza). Ez a navigációs információ segít megérteni a felhasználónak, hogy éppen hol van, és mi az aktuális oldal célja.
zh_cn: ``title`` 标签是用户在打开网页时从屏幕阅读器听到的第一项。 对于OTRS，页面上总是只有一个 ``h1`` 元素，表示当前页面（它包含来自 ``title`` 的部分信息）。 该导航信息有助于用户了解它们的位置以及当前页面的用途。

source: *Rule*: Always give a precise title to the page that allows the user to understand where they currently are.
hu: *Szabály*: Mindig pontos címet adjon az oldalnak, amely lehetővé teszi a felhasználónak annak megértését, hogy jelenleg éppen hol van.
zh_cn: *规则*：始终为页面提供一个精确的标题，允许用户了解它们当前的位置。

source: Screen readers can use the built-in document structure of HTML (headings ``h1`` to ``h6``) to determine the structure of a document and to allow the user to jump around from section to section. However, this is not enough to reflect the structure of a dynamic web application. That's why ARIA defines several *landmark* roles that can be given to elements to indicate their navigational significance.
hu: A képernyőolvasók képesek a HTML beépített dokumentumszerkezetét használni (címsorok ``h1`` és ``h6`` között) egy dokumentum szerkezetének meghatározásához, és lehetővé tenni a felhasználónak, hogy egyik szakaszról a másik szakaszra ugorjon. Azonban ez nem elegendő egy dinamikus webalkalmazás szerkezetének kifejezéséhez. Ez az, amiért az ARIA számos olyan *iránypont* szerepet határoz meg, amelyek megadhatók az elemeknek, hogy jelezzék a navigációs jelentésüket.
zh_cn: 屏幕阅读器可以使用HTML的内置文档结构（标题 ``h1`` 到 ``h6`` ）来确定文档的结构，并允许用户从一节跳到另一节。但是，这不足以反映动态Web应用程序的结构。这就是为什么ARIA 定义了几个 *地标* 角色，这些角色可以赋予元素以指示其导航意义。

source: To keep the validity of the HTML documents, the ``role`` attributes (ARIA landmark roles) are not inserted into the source code directly, but instead by classes which will later be used by the JavaScript functions in ``OTRS.UI.Accessibility`` to set the corresponding ``role`` attributes on the node.
hu: A HTML dokumentumok érvényességének megtartásához a ``role`` attribútumok (ARIA iránypont szerepek) nincsenek közvetlenül a forráskódba beszúrva, hanem olyan osztályok által kerülnek beszúrásra, amelyeket később az ``OTRS.UI.Accessibility`` osztályban lévő JavaScript függvények fognak használni a megfelelő ``role`` attribútumok beszúrásához a csomópontba.
zh_cn: 为了保持HTML文档的有效性，``role`` 属性（ARIA地标角色）不是直接插入到源代码中，而是通过以后将被 ``OTRS.UIAccessibility`` 中的JavaScript函数使用的类插入，在节点上设置相应的 ``role`` 属性。

source: *Rule*: Use WAI-ARIA Landmark Roles to structure the content for screen readers.
hu: *Szabály*: Használjon WAI-ARIA iránypont szabályokat a tartalom szerkezetbe foglalásához a képernyőolvasók számára.
zh_cn: *规则*：使用WAI-ARIA 地标角色为屏幕阅读器组织内容。

source: Banner: ``<div class="ARIARoleBanner"></div>`` will become ``<div class="ARIARoleBanner" role="banner"></div>``
hu: Reklámcsík: ``<div class="ARIARoleBanner"></div>`` helyett ``<div class="ARIARoleBanner" role="banner"></div>`` lesz
zh_cn: Banner: ``<div class="ARIARoleBanner"></div>`` 将变成 ``<div class="ARIARoleBanner" role="banner"></div>``

source: Navigation: ``<div class="ARIARoleNavigation"></div>`` will become ``<div class="ARIARoleNavigation" role="navigation"></div>``
hu: Navigáció: ``<div class="ARIARoleNavigation"></div>`` helyett ``<div class="ARIARoleNavigation" role="navigation"></div>`` lesz
zh_cn: 导航: ``<div class="ARIARoleNavigation"></div>`` 将变成 ``<div class="ARIARoleNavigation" role="navigation"></div>``

source: Search function: ``<div class="ARIARoleSearch"></div>`` will become ``<div class="ARIARoleSearch" role="search"></div>``
hu: Keresőfunkció: ``<div class="ARIARoleSearch"></div>`` helyett ``<div class="ARIARoleSearch" role="search"></div>`` lesz
zh_cn: 搜索功能: ``<div class="ARIARoleSearch"></div>`` 将变成 ``<div class="ARIARoleSearch" role="search"></div>``

source: Main application area: ``<div class="ARIARoleMain"></div>`` will become ``<div class="ARIARoleMain" role="main"></div>``
hu: Fő alkalmazásterület: ``<div class="ARIARoleMain"></div>`` helyett ``<div class="ARIARoleMain" role="main"></div>`` lesz
zh_cn: 主应用区域: ``<div class="ARIARoleMain"></div>`` 将变成 ``<div class="ARIARoleMain" role="main"></div>``

source: Footer: ``<div class="ARIARoleContentinfo"></div>`` will become ``<div class="ARIARoleContentinfo" role="contentinfo"></div>``
hu: Lábléc: ``<div class="ARIARoleContentinfo"></div>`` helyett ``<div class="ARIARoleContentinfo" role="contentinfo"></div>`` lesz
zh_cn: 页脚: ``<div class="ARIARoleContentinfo"></div>`` 将变成 ``<div class="ARIARoleContentinfo" role="contentinfo"></div>``

source: For navigation inside of ``<form>`` elements, it is necessary for the impaired user to know what each input elements purpose is. This can be achieved by using standard HTML ``<label>`` elements which create a link between the label and the form element.
hu: A ``<form>`` elemeken belüli navigációnál szükséges a fogyatékos felhasználónak tudnia, hogy mi az egyes beviteli elemek célja. Ezt el lehet érni a szabványos HTML ``<label>`` elemek használatával, amelyek kapcsolatot hoznak létre a címke és az űrlap elem között.
zh_cn: 对于 ``<form>`` 元素内部的导航，受损用户必须知道每个输入元素的用途。 这可以通过使用标准HTML ``<label>`` 元素来实现，这些元素在标签和表单元素之间创建链接。

source: When an input element gets focus, the screen reader will usually read the connected label, so that the user can hear its exact purpose. An additional benefit for seeing users is that they can click on the label, and the input element will get focus (especially helpful for checkboxes, for example).
hu: Amikor egy beviteli elem megkapja a fókuszt, akkor a képernyőolvasó általában fel fogja olvasni a hozzá kapcsolt címkét, így a felhasználó hallhatja annak pontos célját. További előnye a látó felhasználóknak, hogy rákattinthatnak a címkére, és a beviteli elem meg fogja kapni a fókuszt (különösen jelölőnégyzeteknél hasznos például).
zh_cn: 当输入元素获得焦点时，屏幕阅读器通常会读取连接的标签，以便用户可以听到其确切用途。 正常用户的额外好处是，他们可以通过点击标签让此输入元素将获得焦点（例如，对复选框特别有用）。

source: *Rule*: Provide ``<label>`` elements for *all* form element (``input``, ``select``, ``textarea``) fields.
hu: *Szabály*: Adjon meg ``<label>`` elemeket az *összes* űrlapelem (``input``, ``select``, ``textarea``) mezőhöz.
zh_cn: *规则*：为 *所有的* 表单元素（ ``input文本输入框`` 、 ``select选择框`` 、 ``textarea多行文本框`` ）字段提供 ``<label>`` 元素。

source: Example: ``<label for="date">Date:</label><input type="text" name="date" id="date"/>``
hu: Példa: ``<label for="date">Dátum:</label><input type="text" name="date" id="date"/>``
zh_cn: 例如： ``<label for="date">日期:</label><input type="text" name="date" id="date"/>``

source: Make interaction possible
hu: A kölcsönhatás lehetővé tétele
zh_cn: 使交互成为可能

source: Goal: *Allow the user to perform all interactions just by using the keyboard.*
hu: Cél: *lehetővé tenni a felhasználónak, hogy az összes kölcsönhatást végrehajtsa pusztán a billentyűzet használatával.*
zh_cn: 目标：*允许用户仅使用键盘执行所有交互。*

source: While it is technically possible to create interactions with JavaScript on arbitrary HTML elements, this must be limited to elements that a user can interact with by using the keyboard. Specifically, they need to be able to give focus to the element and to interact with it. For example, a push button to toggle a widget should not be realized by using a ``span`` element with an attached JavaScript ``onclick`` event listener, but it should be (or contain) an ``a`` tag to make it clear to the screen reader that this element can cause interaction.
hu: Miközben technikailag lehetséges kölcsönhatásokat létrehozni JavaScript segítségével tetszőleges HTML elemen, ezt korlátozni kell azon elemekre, amelyekkel a felhasználó kölcsönhatásba léphet a billentyűzet használatával. Különösen azt kell lehetővé tenni számukra, hogy fókuszt adjanak az elemnek, és kölcsönhatásba lépjenek vele. Például egy felületi elemet ki-be kapcsoló nyomógombot nem egy JavaScript ``onclick`` eseményfigyelővel összekötött ``span`` elem használatával kellene megoldani, hanem egy ``a`` címkének kellene lennie (vagy tartalmaznia kellene), hogy világossá tegye a képernyőolvasónak, hogy ez az elem kölcsönhatást okozhat.
zh_cn: 虽然在技术上可以在任意HTML元素上创建与JavaScript的交互，但这必须限于用户可以使用键盘与之交互的元素。 具体来说，他们需要能够获取元素的焦点并与元素进行交互。 例如，切换小部件的按钮不应该通过使用带有附加的JavaScript ``onclick`` 事件监听器的 ``span`` 元素来实现，而应该是（或包含） ``a`` 标签 使屏幕阅读器清楚这个元素可以引起交互。

source: *Rule*: For interactions, always use elements that can receive focus, such as ``a``, ``input``, ``select`` and ``button``.
hu: *Szabály*: A kölcsönhatásoknál mindig olyan elemeket használjon, amelyek megkaphatják a fókuszt, mint például ``a``, ``input``, ``select`` és ``button``.
zh_cn: *规则*：对于交互，总是使用可以获得焦点的元素，例如 ``a`` 、 ``input`` 、 ``select`` 和 ``button``。

source: *Rule*: Make sure that the user can always identify the nature of the interaction (see rules about non-textual content and labelling of form elements).
hu: *Rule*: Győződjön meg arról, hogy a felhasználó mindig képes-e azonosítani a kölcsönhatás természetét (nézze meg a szabályokat a nem szöveges tartalommal és az űrlapelemek címkézésével kapcsolatban).
zh_cn: *规则*：确保用户始终能够识别交互的性质（请参阅有关非文本内容和表单元素标签的规则）。

source: Goal: *Make dynamic changes known to the user.*
hu: Cél: *Tudatni a felhasználóval a dinamikus változtatásokat.*
zh_cn: 目标：*让用户了解动态变化。*
