Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: Very similar to ``EditFieldValueGet()``, but uses a different name prefix, adapted for the search dialog screen.
hu: Nagyon hasonló az ``EditFieldValueGet()`` függvényhez, de eltérő név előtagot használ a keresési párbeszédablak képernyőhöz átírva.
zh_cn: 非常类似于 ``EditFieldValueGet()``，但使用了不同的名称前缀，适用于搜索对话框屏幕。

source: This function is used also by the ticket search dialog to set the correct operator and value to do the search on this field. It also returns how the value should be displayed in the used search attributes in the results page.
hu: Ezt a függvényt is a jegykeresés párbeszédablak használja a helyes operátor és érték beállításához, hogy elvégezze a keresést ezen a mezőn. Azt is visszaadja, hogy az értéket hogyan kell megjeleníteni a használt keresési attribútumokban a találatok oldalon.
zh_cn: 工单搜索对话框也使用此函数来设置正确的运算符和值，以便在此字段上进行搜索。 它还返回值应在结果页面中使用的搜索属性中显示的方式。

source: This function is used by the stats modules. It includes the field definition in the stats format. For fields with fixed values it also includes all this possible values and if they can be translated, take a look to the ``BaseSelect`` driver code for an example how to implement those.
hu: Ezt a függvényt a statisztikák moduljai használják. Tartalmazza a mező meghatározást a statisztikák formátumában. A rögzített értékekkel rendelkező mezőknél tartalmazza az összes lehetséges értéket is, és ha azok lefordíthatók, akkor nézze meg a ``BaseSelect`` illesztőprogram kódját példaként arra, hogy azokat hogyan kell megvalósítani.
zh_cn: 统计模块使用此函数。 它包括统计信息格式的字段定义。 对于具有固定值的字段，它还包括所有这些可能的值，如果它们可以被转换，请查看 ``BaseSelect`` 驱动程序代码，以获取如何实现它们的示例。

source: This function is very similar to the ``SearchFieldParameterBuild()``. The difference is that the latter gets the value from the search profile and this one gets the value directly from its parameters.
hu: Ez a függvény nagyon hasonló a ``SearchFieldParameterBuild()`` függvényhez. A különbség az, hogy az utóbbi a keresési profilból kapja meg az értéket, és ez pedig közvetlenül a paramétereiből kapja meg az értéket.
zh_cn: 这个函数非常类似于 ``SearchFieldParameterBuild()``。 不同之处在于后者从搜索配置文件中获取值，并且此值直接从其参数中获取值。

source: This function is used by statistics module.
hu: Ezt a függvényt a statisztikák modul használja.
zh_cn: 此函数用于统计模块。

source: This function is used to know how the dynamic field values stored on a profile should be retrieved, as a scalar or as an array, and it also defines the correct name of the field in the profile.
hu: Ezt a függvényt annak megismeréséhez használják, hogy a dinamikus mező értékei hogyan vannak eltárolva egy olyan profilnál, amelyet le kell kérni skalár vagy tömb formában, és meghatározza a mező helyes nevét is a profilban.
zh_cn: 此函数用于了解如何检索存储在配置文件中的动态字段值，如标量或数组，还可以定义配置文件中字段的正确名称。

source: This function is used by ``otrs.FillDB.pl`` script to populate the database with some test and random data. The value inserted by this function is not really relevant. The only restriction is that the value must be compatible with the field value type.
hu: Ezt a függvényt az ``otrs.FillDB.pl`` parancsfájl használja, hogy feltöltse az adatbázist néhány teszt és véletlenszerű adattal. A függvény által beszúrt érték nem igazán fontos. Az egyetlen megkötés az, hogy az értéknek kompatibilisnek kell lennie a mezőérték típusával.
zh_cn: ``otrs.FillDB.pl`` 脚本使用此函数用一些测试和随机数据填充数据库。 此函数插入的值并不真实相关。 唯一的限制是该值必须与字段值类型兼容。

source: Used by the notification modules. This function returns 1 if the field is present in the ``$Param{ObjectAttributes}`` parameter and if it matches the given value.
hu: Az értesítési modulok használják. Ez a függvény 1-et ad vissza, ha a mező jelen van a ``$Param{ObjectAttributes}`` paraméterben, és ha megegyezik a megadott értékkel.
zh_cn: 由通知模块使用。 如果字段出现在 ``$Param{ObjectAttributes}`` 参数中并且它与给定值匹配，则此函数返回1。

source: Overview
hu: Áttekintés
zh_cn: 概览

source: Dynamic fields are custom fields that can be added to a screen to enhance and add information to an object (e.g. a ticket or an article).
hu: A dinamikus mezők olyan egyéni mezők, amelyek hozzáadhatók egy képernyőhöz, hogy javítsák és információkat adjanak hozzá egy objektumhoz (például egy jegyhez vagy egy bejegyzéshez).
zh_cn: 动态字段是可以添加到屏幕的自定义字段，以增强和添加信息到对象（例如工单或信件）。

source: Tickets or articles could have as many fields as needed. It is also possible to use the dynamic fields framework for other objects rather than just ticket or article.
hu: A jegyek vagy a bejegyzések annyi mezővel rendelkezhetnek, amennyi szükséges. Lehetséges a dinamikus mezők keretrendszerének használata egyéb objektumoknál is, ahelyett hogy csak a jegynél vagy a bejegyzésnél lenne használható.
zh_cn: 工单或信件可以根据需要包含多个字段。 也可以将动态字段框架用于其它对象，而不仅仅是工单或信件。

source: Due to its modular design each dynamic field type can be seen as a plug-in to a framework, and this plug-in can be an OTRS standard package to extend the available types of the dynamic fields or even to extend current dynamic field with more functions.
hu: A moduláris tervezésének köszönhetően az egyes dinamikus mező típusok egy keretrendszerhez tartozó bővítményként láthatók, és ez a bővítmény lehet egy szabványos OTRS csomag is a dinamikus mezők elérhető típusainak kiterjesztéséhez, vagy akár a jelenlegi dinamikus mező további függvényekkel való kiterjesztéséhez.
zh_cn: 由于其模块化设计，每个动态字段类型都可以看作框架的插件，这个插件可以是OTRS标准包，用于扩展动态字段的可用类型，甚至可以扩展当前动态字段更多的功能。

source: Invoker
hu: Meghívó
zh_cn: 调用程序

source: The invoker is used to create a request from OTRS to a remote system. This part of the GI is in charge of perform necessary tasks in OTRS side, to gather the necessary data in order to construct the request.
hu: A meghívót arra használják, hogy egy kérést hozzon létre az OTRS-ből egy távoli rendszerhez. Az általános ügyintéző ezen része felelős a szükséges feladatok végrehajtásáért az OTRS oldalán, illetve a szükséges adatok begyűjtéséért a kérés felépítésének érdekében.
zh_cn: 调用程序用于创建从OTRS到远程系统的请求。 通用接口的这一部分负责在OTRS侧执行必要的任务，以收集必要的数据以构建请求。

source: Invoker Back End
hu: Meghívó háttérprogram
zh_cn: 调用程序后端

source: Next we will show how to develop a new invoker. Each invoker has to implement these subroutines:
hu: Ezután be fogjuk mutatni, hogy hogyan kell egy új meghívót kifejleszteni. Minden egyes meghívónak meg kell valósítania ezeket a szubrutinokat:
zh_cn: 接下来我们将展示如何开发一个新的调用程序。 每个调用程序都必须实现这些子程序：

source: We should implement each one of this methods in order to be able to execute a request using the request handler (``Kernel/GenericInterface/Requester.pm``).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk végrehajtani egy kérést a kéréskezelő használatával (``Kernel/GenericInterface/Requester.pm``).
zh_cn: 我们应该实现这些方法中的每一个，以便能够使用请求处理程序（``Kernel/GenericInterface/Requester.pm``）执行请求。

source: Invoker Code Example
hu: Meghívó kódpélda
zh_cn: 调用程序代码示例

source: In this section a sample invoker module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta meghívómodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.
zh_cn: 在本节中，将显示一个调用程序模块的样本，并解释每个子程序。

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the ``package`` keyword. Invokers can not be instantiated by the object manager.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a ``package`` kulcsszón keresztül van deklarálva. A meghívók nem példányosíthatók az objektumkezelővel.
zh_cn: 这是可在常见OTRS模块中找到的通用标头。类/包名称通过 ``package`` 关键字声明。 调用程序无法由对象管理器实例化。

source: The constructor ``new`` creates a new instance of the class. According to the coding guidelines only objects of other classes not handled by the object manager that are needed in this module have to be created in ``new``.
hu: A ``new`` konstruktor hozza létre az osztály új példányát. A kódolási irányelvek szerint az objektumkezelő által nem kezelt más osztályoknak csak azon objektumait kell a ``new`` konstruktorban létrehozni, amelyek ebben a modulban szükségesek.
zh_cn: 构造函数 ``new`` 创建了一个新的类实例。 根据编码指南，只有对象管理器没有处理的其它类的对象才需要在在 ``new`` 中创建。

source: The ``PrepareRequest`` function is used to handle and collect all needed data to be sent into the request. Here we can receive data from the request handler, use it, extend it, generate new data, and after that, we can transfer the results to the mapping layer.
hu: A ``PrepareRequest`` függvényt használják a kérésbe küldendő összes szükséges adat kezeléséhez és összegyűjtéséhez. Itt fogadhatunk adatokat a kéréskezelőtől, használhatjuk azokat, kiterjeszthetjük azokat, új adatokat állíthatunk elő, és ezután átvihetjük az eredményeket a leképező réteghez.
zh_cn: ``PrepareRequest`` 函数用于处理和收集要发送到请求中的所有需要的数据。 在这里，我们可以从请求处理程序接收数据，使用它、扩展它、生成新数据并随后将结果传输到映射层。

source: For this example we are expecting to receive a ticket number. If there isn't then we use the debugger method ``Error()`` that creates an entry in the debug log and also returns a structure with the parameter ``Success`` as 0 and an error message as the passed ``Summary``.
hu: Ennél a példánál azt várjuk, hogy kapunk egy jegyszámot. Ha nem, akkor az ``Error()`` hibakeresési metódust használjuk, amely létrehoz egy bejegyzést a hibakeresési naplóban, és visszaad egy szerkezetet is a ``Success`` paraméterrel 0-ként, és egy hibaüzenetet az átadott ``Summary`` értékként.
zh_cn: 对于此示例，我们希望收到一个工单编号。 如果没有那么我们使用调试器方法 ``Error()`` 在调试日志中创建一个条目，并返回一个参数 ``Success`` 为0的结构和一个错误消息作为传递 ``Summary``。

source: Also this example appends the word *Test* to the parameter ``Action`` and if ``GetSystemTime`` is requested, it will fill the ``SystemTime`` parameter with the current system time. This part of the code is to prepare the data to be sent. On a real invoker some calls to core modules (``Kernel/System/*.pm``) should be made here.
hu: Ez a példa hozzáfűzi a *Test* szót is az ``Action`` paraméterhez, és ha a ``GetSystemTime`` kérve volt, akkor ki fogja tölteni a ``SystemTime`` paramétert az aktuális rendszeridővel. A kód ezen része azért van, hogy előkészítse az elküldendő adatokat. Egy valódi meghívónál itt kell elvégezni néhány hívást az alapmodulokhoz (``Kernel/System/*.pm``).
zh_cn: 此示例还将单词 *Test* 附加到 ``Action`` 参数，如果请求 ``GetSystemTime``，它将使用当前系统时间填充 ``SystemTime`` 参数。 这部分代码是准备要发送的数据。 在一个真正的调用程序上，应该在这里调用核心模块(``Kernel/System/*.pm``)。

source: If during any part of the ``PrepareRequest`` function the request need to be stop without generating and error an entry in the debug log the following code can be used:
hu: Ha a kérést a ``PrepareRequest`` függvény bármely része közben le kell állítani a hibakeresési naplóba való bejegyzés előállítása és hibajelzése nélkül, akkor a következő kód használható:
zh_cn: 如果在 ``PrepareRequest`` 函数的任何部分期间需要停止请求而不生成并在调试日志中输入错误，则可以使用以下代码：

source: Using this, the requester will understand that the request should not continue (it will not be sent to mapping layer and will also not be sent to the network transport). The requester will not send an error on the debug log, it will only silently stop.
hu: Ennek használatával a kérelmező meg foga érteni, hogy a kérést nem szabad folytatni (nem kerül elküldésre a leképező réteghez, és nem kerül elküldésre a hálózati átvitelhez sem). A kérelmező nem fog hibát küldeni a hibakeresési naplóba, hanem csak csendben le fog állni.
zh_cn: 使用此方法，请求者将理解请求不应继续（它不会被发送到映射层，也不会被发送到网络传输）。 请求者不会在调试日志上发送错误，它只会静默停止。

source: The ``HandleResponse`` function is used to receive and process the data from the previous request, that was made to the remote system. This data already passed by mapping layer, to transform it from remote system format to OTRS format (if needed).
hu: A ``HandleResponse`` függvényt használják az előző kérésből származó adatok fogadásához és feldolgozásához, amelyet a távoli rendszernek készítettek. Ezeket az adatokat már átadta a leképező réteg, hogy átalakítsa azokat a távoli rendszer formátumáról az OTRS formátumára (ha szükséges).
zh_cn: ``HandleResponse`` 函数用于接收和处理来自先前请求的数据，该数据是对远程系统进行的。 此数据已由映射层传递，以将其从远程系统格式转换为OTRS格式（如果需要）。

source: For this particular example it checks the ticket number again and check if the action ends with the word *Test* (as was done in the ``PrepareRequest`` function).
hu: Ennél a bizonyos példánál ismét ellenőrzi a jegyszámot, és azt is ellenőrzi, hogy a művelet a *Test* szóval végződik-e (amint az a ``PrepareRequest`` függvényben történt).
zh_cn: 对于这个特定的例子，它再次检查工单编号并检查操作是否以单词 *Test* 结束（如在 ``PrepareRequest`` 函数中所做的那样）。

source: This invoker is only used for tests, a real invoker will check if the response was on the format described by the remote system and can perform some actions like: call another invoker, perform a call to a core module, update the database, send an error, etc.
hu: Ez a meghívó csak tesztelésekhez van, egy valódi meghívó ellenőrizni fogja, hogy a válasz a távoli rendszer által leírt formátumban volt-e, és végrehajthat néhány műveletet, mint például: egy másik meghívó meghívása, egy hívás végrehajtása egy alapmodulhoz, az adatbázis frissítése, hiba küldése, stb.
zh_cn: 这个调用程序仅用于测试，真正的调用程序将检查响应是否采用远程系统描述的格式，并且可以执行以下操作：调用另一个调用者、执行对核心模块的调用、更新数据库、发送一个错误等。

source: Invoker Configuration Example
hu: Meghívó beállítási példa
zh_cn: 调用程序配置示例

source: There is the need to register this invoker module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen meghívómodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要注册此调用程序模块才能在OTRS GUI中访问。 这可以使用下面的XML配置来完成。

source: Mapping
hu: Leképezés
zh_cn: 映射

source: The mapping is used to convert data from OTRS to the external systems, and vice versa. This data can be represented as key => value pairs. Mapping modules can be developed to transform not just values but also the keys.
hu: A leképezést adatok átalakításához használják az OTRS és a távoli rendszer között, illetve fordítva. Ezek az adatok kulcs => érték párokként vannak ábrázolva. Leképező modulok fejleszthetők ki nem csak az értékek, hanem a kulcsok átalakításához is.
zh_cn: 映射用于将数据从OTRS转换为外部系统，反之亦然。 该数据可以表示为key => value对。 可以开发映射模块，不仅可以转换值，还可以转换键。

source: For example:
hu: Például:
zh_cn: 例如：

source: Mapping from
hu: Leképezés erről
zh_cn: 映射自

source: Mapping to
hu: Leképezés erre
zh_cn: 映射至

source: The mapping layer is not absolutely necessary, a web service can skip it completely depending on the web service configuration and how invokers and operation are implemented. But if some data transformations are needed, is highly recommended to use an existing mapping module or create a new one.
hu: A leképező réteg nem feltétlenül szükséges, egy webszolgáltatás teljesen kihagyhatja azt a webszolgáltatás beállításaitól, valamint a meghívók és műveletek megvalósításának módjától függően. De ha egy kis átalakítás szükséges, akkor erősen ajánlott egy meglévő leképezőmodul használata, vagy egy új létrehozása.
zh_cn: 映射层不是绝对必要的，Web服务可以完全跳过它，具体取决于Web服务配置以及如何实现调用程序和操作。 但是，如果需要进行某些数据转换，强烈建议使用现有的映射模块或创建新的映射模块。

source: Mapping modules can be called more than one time during a normal communication, take a look to the following examples.
hu: A leképező modulok egynél több alkalommal is meghívhatók egy normál kommunikáció közben. Vessen egy pillantást a következő példákra.
zh_cn: 在正常通信期间，可以多次调用映射模块，请看下面的示例。

source: OTRS as provider example
hu: OTRS mint szolgáltató példa
zh_cn: OTRS作为提供程序示例

source: The remote system sends the request with the data in the remote system format.
hu: A távoli rendszer elküldi a kérést az adatokkal a távoli rendszer formátumában.
zh_cn: 远程系统使用远程系统格式的数据发送请求。

source: The data is mapped from the remote system format to the OTRS format.
hu: Az adatok leképezésre kerülnek a távoli rendszer formátumáról az OTRS formátumára.
zh_cn: 数据从远程系统格式映射到OTRS格式。

source: OTRS performs the operation and return the response in OTRS format.
hu: Az OTRS végrehajtja a műveletet, és visszaadja a választ az OTRS formátumában.
zh_cn: OTRS执行操作并以OTRS格式返回响应。

source: The data is mapped from the OTRS format to the remote system format.
hu: Az adatok leképezésre kerülnek az OTRS formátumáról a távoli rendszer formátumára.
zh_cn: 数据从OTRS格式映射到远程系统格式。

source: The response with the data in the remote system format is sent to the remote system.
hu: A válasz a távoli rendszer formátumában lévő adatokkal elküldésre kerül a távoli rendszernek.
zh_cn: 将远程系统格式的数据响应发送到远程系统。

source: OTRS as requester example
hu: OTRS mint kérelmező példa
zh_cn: OTRS作为请求程序的例子

source: OTRS prepares the request to the remote system using the data in the OTRS format.
hu: Az OTRS előkészíti a kérést a távoli rendszerhez az OTRS formátumában használt adatokkal.
zh_cn: OTRS使用OTRS格式的数据准备对远程系统的请求。

source: The request is sent to the remote system which performs the action and sends the response back to OTRS with the data in remote system format.
hu: A kérés elküldésre kerül a távoli rendszernek, amely végrehajtja a műveletet, és visszaküldi a választ az OTRS-nek a távoli rendszer formátumában lévő adatokkal.
zh_cn: 请求被发送到执行操作的远程系统，并使用远程系统格式的数据将响应发送回OTRS。

source: The data is mapped form remote system format (again) to the OTRS format.
hu: Az adatok (ismét) leképezésre kerülnek a távoli rendszer formátumáról az OTRS formátumára.
zh_cn: 数据以远程系统格式（再次）映射到OTRS格式。

source: OTRS processes the response.
hu: Az OTRS feldolgozza a választ.
zh_cn: OTRS处理响应内容。

source: Mapping Back End
hu: Leképező háttérprogram
zh_cn: 映射后端

source: Generic interface provides a mapping module called *Simple*. With this module most of the data transformations including key and value mapping can be done, and also it defines rules for to handling the default mappings for both keys and values.
hu: Az általános felület biztosít egy *Simple* nevű leképezőmodult. Ezzel a modullal a legtöbb adatátalakítás (beleértve a kulcs és érték leképezést) elvégezhető, és szabályokat is meghatároz az alapértelmezett leképezések kezeléséhez mind a kulcsoknál, mind az értékeknél.
zh_cn: 通用接口提供了一个名为 *Simple* 的映射模块。 使用此模块，可以完成大多数数据转换，包括键和值映射，还定义了处理键和值的默认映射的规则。

source: So it is highly probable that you don't need to develop a custom mapping module. Please check *Simple* mapping module (``Kernel/GenericInterface/Mapping/Simple.pm``) and its on-line documentation before continue.
hu: Ezért erősen valószínű, hogy nem lesz szüksége egy egyéni leképezőmodul kifejlesztésére. A folytatás előtt nézze meg a *Simple* leképezőmodult (``Kernel/GenericInterface/Mapping/Simple.pm``) és annak internetes dokumentációját.
zh_cn: 因此，您很可能不需要开发自定义映射模块。 在继续之前，请检查 *Simple* 映射模块（``Kernel/GenericInterface/Mapping/Simple.pm``）及其在线文档。

source: If *Simple* mapping module does not match your needs then we will show how to develop a new mapping back end. Each mapping back end has to implement these subroutines:
hu: Ha a *Simple* leképezőmodul nem felel meg az igényeinek, akkor meg fogjuk mutatni, hogy hogyan lehet kifejleszteni egy új leképező háttérprogramot. Minden egyes leképező háttérprogramnak meg kell valósítania ezeket a szubrutinokat:
zh_cn: 如果 *Simple* 映射模块不符合您的需求，那么我们将展示如何开发新的映射后端。 每个映射后端都必须实现这些子程序：

source: We should implement each one of this methods in order to be able to map the data in the communication, handled either by the requester or provider. All mapping back ends are handled by the mapping module (``Kernel/GenericInterface/Mapping.pm``).
hu: Meg kell valósítanunk ezen metódusok mindegyikét azért, hogy képesek legyünk az adatok leképezésére a kommunikációban, amelyet vagy a kérelmező, vagy a szolgáltató kezel. Az összes leképező háttérprogramot a leképezőmodul kezeli (``Kernel/GenericInterface/Mapping.pm``).
zh_cn: 我们应该实现这些方法中的每一个，以便能够映射通信中的数据，由请求者或提供者处理。 所有映射后端都由映射模块处理（``Kernel/GenericInterface/Mapping.pm``）。

source: Mapping Code Example
hu: Leképezés kódpélda
zh_cn: 映射码示例

source: In this section a sample mapping module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta leképezőmodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.
zh_cn: 在本节中，将显示一个映射模块的样本，并解释每个子程序。

source: We also include ``VariableCheck`` module to perform certain validation over some variables. Mappings can not be instantiated by the object manager.
hu: Felveszünk egy ``VariableCheck`` modult is bizonyos ellenőrzések végrehajtásához néhány változón. A leképezések nem példányosíthatók az objektumkezelővel.
zh_cn: 我们还包括 ``VariableCheck`` 模块，用于对某些变量执行某些验证。 对象管理器无法实例化映射。

source: The ``Map`` function is the main part of each mapping module. It receives the mapping configuration (rules) and the data in the original format (either OTRS or remote system format) and converts it to a new format, even if the structure of the data can be changed during the mapping process.
hu: A ``Map`` függvény az egyes leképezőmodulok fő része. Fogadja a leképezési beállításokat (szabályokat) és az eredeti formátumban lévő adatokat (vagy az OTRS vagy a távoli rendszer formátumában lévőket), és átalakítja azokat egy új formátumra még akkor is, ha az adatok szerkezete megváltozhat a leképezési folyamat során.
zh_cn: ``Map`` 函数是每个映射模块的主要部分。 它接收映射配置（规则）和原始格式的数据（OTRS或远程系统格式）并将其转换为新格式，在映射过程中甚至可以更改数据结构。

source: In this particular example there are three rules to map the values. This rules are set in the mapping configuration key ``TestOption`` and they are ``ToUpper``, ``ToLower`` and ``Empty``.
hu: Ebben a bizonyos példában három szabály van az értékek leképezéséhez. Ezek a szabályok a leképezési beállítások ``TestOption`` kulcsában vannak beállítva, és a következők: ``ToUpper``, ``ToLower`` és ``Empty``.
zh_cn: 在此特定示例中，有三个规则来映射值。 此规则在映射配置键 ``TestOption`` 中设置，它们是 ``ToUpper``、 ``ToLower`` 和 ``Empty``。

source: ``ToUpper``: converts each data value to upper case.
hu: ``ToUpper``: nagybetűsre alakít át minden egyes adatértéket.
zh_cn: ``ToUpper``：将每个数据值转换为大写。

source: ``ToLower``: converts each data value to lower case.
hu: ``ToLower``: kisbetűsre alakít át minden egyes adatértéket.
zh_cn: ``ToLower``：将每个数据值转换为小写。

source: ``Empty``: converts each data value into an empty string.
hu: ``Empty``: egy üres szövegre alakít át minden egyes adatértéket.
zh_cn: ``Empty``：将每个数据值转换为空字符串。

source: In this example no data key transformations were implemented.
hu: Ebben a példában nem lettek adatkulcs átalakítások megvalósítva.
zh_cn: 在此示例中，未实现任何数据键转换。

source: This are the helper functions that actually performs the string conversions.
hu: Ezek azok a segédfüggvények, amelyek ténylegesen végrehajtják a szövegátalakításokat.
zh_cn: 这是实际执行字符串转换的辅助函数。

source: Mapping Configuration Example
hu: Leképezés beállítási példa
zh_cn: 映射配置示例

source: There is the need to register this mapping module to be accessible in the OTRS GUI. This can be done using the XML configuration below.
hu: Szükség van ezen leképezőmodul regisztrálására, hogy elérhető legyen az OTRS grafikus felhasználói felületén. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要将此映射模块注册以便在OTRS GUI中访问。 这可以使用下面的XML配置来完成。

source: Operation
hu: Művelet
zh_cn: 操作

source: The operation is used to perform an action within OTRS. This action is requested by the external system and can include special parameters in order to correctly execute the action. After the action is performed, OTRS sends a defined confirmation to the external system.
hu: A műveletet egy tevékenység végrehajtásához használják az OTRS-en belül. Ezt a tevékenységet a távoli rendszer kéri, és tartalmazhat különleges paramétereket azért, hogy helyesen végrehajtsa a tevékenységet. A tevékenység végrehajtása után az OTRS elküld egy meghatározott megerősítést a távoli rendszernek.
zh_cn: 操作（operation ）用于在OTRS内执行一个动作（action）。 此动作由外部系统请求，并且可以包含特殊参数以便正确执行动作。 执行此动作后，OTRS会向外部系统发送已定义的确认。

source: Operation Back End
hu: Műveleti háttérprogram
zh_cn: 操作的后端
