Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: OTRS has a large number of so-called *module layers* which make it very easy to extend the system without patching existing code. One example is the number generation mechanism for tickets. It is a *module layer* with pluggable modules, and you can add your own custom number generator modules if you wish to do so. Let's look at the different layers in detail!
hu: Az OTRS nagyszámú úgynevezett *modulréteggel* rendelkezik, amely nagyon egyszerűvé teszi a rendszer kibővítését a meglévő kód foltozása nélkül. Egy példa erre a számelőállító mechanizmus a jegyeknél. Ez egy csatlakoztatható modulokkal rendelkező *modulréteg*, és ha szeretné, hozzáadhatja a saját egyéni számelőállító moduljait is. Nézzük meg részletesen a különböző rétegeket!
zh_cn: OTRS具有大量所谓的 *模块层*，这使得在不修补现有代码的情况下扩展系统变得非常容易。 一个例子是工单的数字生成机制。 它是一个带有可插拔模块的 *模块层*，如果您愿意，可以添加自己的自定义数字生成器模块。 让我们详细看看不同的层！

source: Authentication and User Management
hu: Hitelesítés és felhasználókezelés
zh_cn: 身份验证和用户管理

source: Preferences
hu: Beállítások
zh_cn: 首选项

source: Other Core Functions
hu: Egyéb alapfüggvények
zh_cn: 其它核心功能

source: Daemon And Scheduler
hu: Démon és ütemező
zh_cn: 守护进程和调度程序

source: Dynamic Fields
hu: Dinamikus mezők
zh_cn: 动态字段

source: Email Handling
hu: E-mail kezelés
zh_cn: 邮件处理

source: Process Management
hu: Folyamatkezelés
zh_cn: 流程管理

source: Agent Authentication Module
hu: Ügyintézői hitelesítő modul
zh_cn: 服务人员身份验证模块

source: There are several agent authentication modules (DB, LDAP and HTTPBasicAuth) which come with the OTRS framework. It is also possible to develop your own authentication modules. The agent authentication modules are located under ``Kernel/System/Auth/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of a simple agent auth module. Save it under ``Kernel/System/Auth/Simple.pm``. You just need 3 functions: ``new()``, ``GetOption()`` and ``Auth()``. Return the uid, then the authentication is ok.
hu: Számos ügyintézői hitelesítő modul létezik (DB, LDAP és HTTPBasicAuth), amelyek az OTRS keretrendszerrel érkeznek. Lehetőség van saját hitelesítő modulok fejlesztésére is. Az ügyintézői hitelesítő modulok a ``Kernel/System/Auth/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. Ezt követően egy egyszerű ügyintézői hitelesítő modul példája található. Mentse el a ``Kernel/System/Auth/Simple.pm`` helyre. Mindössze három függvényre van szüksége: ``new()``, ``GetOption()`` és ``Auth()``. Adja vissza az uid-t, és ezután a hitelesítés rendben van.
zh_cn: OTRS框架附带了几个服务人员身份验证模块（DB、LDAP和HTTPBasicAuth）。 您也可以开发自己的身份验证模块。服务人员验证模块位于 ``Kernel/System/Auth/*.pm``。 有关其配置的更多信息，请参阅管理员手册。 下面是一个简单服务人员验证模块的示例。 将它保存为 ``Kernel/System/Auth/Simple.pm``。 你只需要3个函数：``new()``、 ``GetOption()`` 和 ``Auth()``。 返回uid，然后验证就可以了。

source: Agent Authentication Module Code Example
hu: Ügyintézői hitelesítő modul kódpélda
zh_cn: 服务人员身份验证模块代码示例

source: The interface class is called ``Kernel::System::Auth``. The example agent authentication may be called ``Kernel::System::Auth::CustomAuth``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::Auth``. A példa ügyintézői hitelesítés hívható ``Kernel::System::Auth::CustomAuth`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::Auth``。 示例服务人员身份验证可以叫做 ``Kernel::System::Auth::CustomAuth``。 你可以在下面找到一个例子。

source: Agent Authentication Module Configuration Example
hu: Ügyintézői hitelesítő modul beállítási példa
zh_cn: 服务人员身份验证模块配置示例

source: There is the need to activate your custom agent authenticate module. This can be done using the Perl configuration below. It is not recommended to use the XML configuration because you can lock you out via the system configuration.
hu: Szükség van az egyéni ügyintézői hitelesítés modul bekapcsolására. Ezt a lenti Perl beállítás használatával lehet megtenni. Nem ajánlott az XML beállítás használata, mert kizárhatja magát a rendszerbeállításokon keresztül.
zh_cn: 需要激活自定义服务人员身份验证模块。 这可以使用下面的Perl配置来完成。 建议不要使用XML配置，因为您可能通过系统配置将您关在外面。

source: Agent Authentication Module Use Case Example
hu: Ügyintézői hitelesítő modul használati eset példa
zh_cn: 服务人员身份验证模块用例示例

source: A useful example of an authentication implementation could be a SOAP back end.
hu: Egy hitelesítési megvalósítás hasznos példája lehet egy SOAP háttérprogram.
zh_cn: 身份验证实现的有用示例可以是一个SOAP后端。

source: Authentication Synchronization Module
hu: Hitelesítés szinkronizációs modul
zh_cn: 身份验证同步模块

source: There is an LDAP authentication synchronization module which come with the OTRS framework. It is also possible to develop your own authentication modules. The authentication synchronization modules are located under ``Kernel/System/Auth/Sync/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of an authentication synchronization module. Save it under ``Kernel/System/Auth/Sync/CustomAuthSync.pm``. You just need 2 functions: ``new()`` and ``Sync()``. Return 1, then the synchronization is ok.
hu: Létezik egy LDAP hitelesítés szinkronizációs modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját hitelesítés modulok fejlesztésére is. A hitelesítés szinkronizációs modulok a ``Kernel/System/Auth/Sync/*.pm`` alatt találhatók. A beállításaikkal kapcsolatban további információkért nézze meg az adminisztrációs kézikönyvet. A következőkben egy hitelesítés szinkronizációs modul példája található. Mentse el a ``Kernel/System/Auth/Sync/CustomAuthSync.pm`` fájlba. Mindössze két függvényre van szüksége: ``new()`` és ``Sync()``. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.
zh_cn: OTRS框架自带有一个LDAP认证同步模块。 您也可以开发自己的身份验证模块。 认证同步模块位于 ``Kernel/System/Auth/Sync/*.pm`` 下。 有关其配置的更多信息，请参阅管理员手册。 下面是一个身份验证同步模块的示例。 将其保存在 ``Kernel/System/Auth/Sync/CustomAuthSync.pm`` 下。 你只需要2个函数：``new()`` 和 ``Sync()``。 返回1，然后同步就可以了。

source: Authentication Synchronization Module Code Example
hu: Hitelesítés szinkronizációs modul kódpélda
zh_cn: 身份验证同步模块代码示例

source: The interface class is called ``Kernel::System::Auth``. The example agent authentication may be called ``Kernel::System::Auth::Sync::CustomAuthSync``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::Auth``. A példa ügyintézői hitelesítés hívható ``Kernel::System::Auth::Sync::CustomAuthSync`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::Auth``。 示例服务人员身份验证可以叫做 ``Kernel::System::Auth::Sync::CustomAuthSync``。 你可以在下面找到一个例子。

source: Authentication Synchronization Module Configuration Example
hu: Hitelesítés szinkronizációs modul beállítási példa
zh_cn: 身份验证同步模块配置示例

source: You should activate your custom synchronization module. This can be done using the Perl configuration below. It is not recommended to use the XML configuration because this would allow you to lock yourself out via system configuration.
hu: Be kell kapcsolnia az egyéni szinkronizációs modult. Ezt a lenti Perl beállítás használatával lehet megtenni. Nem ajánlott az XML beállítás használata, mert az lehetővé teheti, hogy kizárja magát a rendszerbeállításokon keresztül.
zh_cn: 您应该激活自定义同步模块。 这可以使用下面的Perl配置来完成。 建议不要使用XML配置，因为您可能通过系统配置将您关在外面。

source: Authentication Synchronization Module Use Case Example
hu: Hitelesítés szinkronizációs modul használati eset példa
zh_cn: 身份验证同步模块用例示例

source: Useful synchronization implementation could be a SOAP or RADIUS back end.
hu: Hasznos szinkronizációs megvalósítás lehet egy SOAP vagy egy RADIUS háttérprogram.
zh_cn: 同步实现的有用示例可以是一个SOAP或RADIUS后端。

source: Customer Authentication Module
hu: Ügyfél hitelesítő modul
zh_cn: 客户身份验证模块

source: There are several customer authentication modules (DB, LDAP and HTTPBasicAuth) which come with the OTRS framework. It is also possible to develop your own authentication modules. The customer authentication modules are located under ``Kernel/System/CustomerAuth/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of a simple customer auth module. Save it under ``Kernel/System/CustomerAuth/Simple.pm``. You just need 3 functions: ``new()``, ``GetOption()`` and ``Auth()``. Return the uid, then the authentication is ok.
hu: Számos ügyfél hitelesítő modul létezik (DB, LDAP és HTTPBasicAuth), amelyek az OTRS keretrendszerrel érkeznek. Lehetőség van saját hitelesítő modulok fejlesztésére is. Az ügyfél hitelesítő modulok a ``Kernel/System/CustomerAuth/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. Ezt követően egy egyszerű ügyfél hitelesítő modul példája található. Mentse el a ``Kernel/System/CustomerAuth/Simple.pm`` helyre. Mindössze három függvényre van szüksége: ``new()``, ``GetOption()`` és ``Auth()``. Adja vissza az uid-t, és ezután a hitelesítés rendben van.
zh_cn: OTRS框架附带了几个客户身份验证模块（DB、LDAP和HTTPBasicAuth）。 您也可以开发自己的身份验证模块。 客户认证模块位于 ``Kernel/System/CustomerAuth/*.pm`` 下。 有关其配置的更多信息，请参阅管理员手册。 下面是一个简单的客户验证模块的示例。 将它保存为 ``Kernel/System/CustomerAuth/Simple.pm``。 你只需要3个函数：``new()``、``GetOption()`` 和 ``Auth()``。 返回uid，然后验证就可以了。

source: Customer Authentication Module Code Example
hu: Ügyfél hitelesítő modul kódpélda
zh_cn: 客户身份验证模块代码示例

source: The interface class is called ``Kernel::System::CustomerAuth``. The example customer authentication may be called ``Kernel::System::CustomerAuth::CustomAuth``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::CustomerAuth``. A példa ügyfél hitelesítés hívható ``Kernel::System::CustomerAuth::CustomAuth`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::CustomerAuth``。 示例客户认证可以叫做 ``Kernel::System::CustomerAuth::CustomAuth``。 你可以在下面找到一个例子。

source: Customer Authentication Module Configuration Example
hu: Ügyfél hitelesítő modul beállítási példa
zh_cn: 客户身份验证模块配置示例

source: There is the need to activate your custom customer authenticate module. This can be done using the XML configuration below.
hu: Szükség van az egyéni ügyfél hitelesítő modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要激活自定义客户身份验证模块。 这可以使用下面的XML配置来完成。

source: Customer Authentication Module Use Case Example
hu: Ügyfél hitelesítő modul használati eset példa
zh_cn: 客户身份验证模块用例示例

source: Useful authentication implementation could be a SOAP back end.
hu: Hasznos hitelesítés megvalósítás lehet egy SOAP háttérprogram.
zh_cn: 有用的身份验证实现可以是一个SOAP后端。

source: Customer User Preferences Module
hu: Ügyfél-felhasználó beállítások modul
zh_cn: 客户用户首选项模块

source: There is a DB customer-user preferences module which come with the OTRS framework. It is also possible to develop your own customer-user preferences modules. The customer-user preferences modules are located under ``Kernel/System/CustomerUser/Preferences/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of a customer-user preferences module. Save it under ``Kernel/System/CustomerUser/Preferences/Custom.pm``. You just need 4 functions: ``new()``, ``SearchPreferences()``, ``SetPreferences()`` and ``GetPreferences()``.
hu: Létezik egy DB ügyfél-felhasználó beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját ügyfél-felhasználó beállítási modulok fejlesztésére is. Az ügyfél-felhasználó beállítási modulok a ``Kernel/System/CustomerUser/Preferences/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy ügyfél-felhasználó beállítások modul példája található. Mentse el a ``Kernel/System/CustomerUser/Preferences/Custom.pm`` helyre. Mindössze négy függvényre van szüksége: ``new()``, ``SearchPreferences()``, ``SetPreferences()`` és ``GetPreferences()``.
zh_cn: OTRS框架自带有一个DB客户用户首选项模块。 您也可以开发自己的客户用户首选项模块。 客户用户首选项模块位于 ``Kernel/System/CustomerUser/Preferences/*.pm`` 下。 有关其配置的更多信息，请参阅管理员手册。 下面是一个客户用户首选项模块的示例。 将其保存为 ``Kernel/System/CustomerUser/Preferences/Custom.pm``。 你只需要4个函数：``new()``、 ``SearchPreferences()``、 ``SetPreferences()`` 和 ``GetPreferences()``。

source: Customer User Preferences Module Code Example
hu: Ügyfél-felhasználó beállítások modul kódpélda
zh_cn: 客户用户首选项模块代码示例

source: The interface class is called ``Kernel::System::CustomerUser``. The example customer-user preferences may be called ``Kernel::System::CustomerUser::Preferences::Custom``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::CustomerUser``. A példa ügyfél-felhasználó beállítások hívhatók ``Kernel::System::CustomerUser::Preferences::Custom`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::CustomerUser``。 示例客户用户首选项可以叫做 ``Kernel::System::CustomerUser::Preferences::Custom``。 你可以在下面找到一个例子。

source: Customer User Preferences Module Configuration Example
hu: Ügyfél-felhasználó beállítások modul beállítási példa
zh_cn: 客户用户首选项模块配置示例

source: There is the need to activate your custom customer-user preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni ügyfél-felhasználó beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要激活自定义客户用户首选项模块。 这可以使用下面的XML配置来完成。

source: Customer User Preferences Module Use Case Example
hu: Ügyfél-felhasználó beállítások modul használati eset példa
zh_cn: 客户用户首选项模块用例示例

source: Useful preferences implementation could be a SOAP or LDAP back end.
hu: Hasznos beállítások megvalósítás lehet egy SOAP vagy egy LDAP háttérprogram.
zh_cn: 有用的首选项实现可以是一个SOAP或LDAP 后端。

source: OTRS Daemon
hu: OTRS démon
zh_cn: OTRS守护进程

source: The OTRS daemon is a separated process that helps OTRS to execute certain actions asynchronously and detached of the web server process, but sharing the same database.
hu: Az OTRS démon egy elkülönített folyamat, amely segít az OTRS-nek bizonyos műveleteket aszinkron módon és a webszolgáltatás folyamattól leválasztva végrehajtani, de ugyanazt az adatbázist megosztva.
zh_cn: OTRS守护进程是一个独立的进程，可帮助OTRS异步执行某些操作并独立于Web服务器进程，但共享同一个数据库。

source: OTRS Daemon Modules
hu: OTRS démonmodulok
zh_cn: OTRS守护进程模块

source: The OTRS daemon ``bin/otrs.Daemon.pl`` main purpose is to call (daemonize) all the registered daemon modules in the system configuration.
hu: A ``bin/otrs.Daemon.pl`` OTRS démon fő célja, hogy meghívja (démonizálja) a rendszerbeállításokban lévő összes regisztrált démonmodult.
zh_cn: OTRS守护进程 ``bin/otrs.Daemon.pl`` 的主要目的是在系统配置中调用（守护进程）所有已注册的守护进程模块。

source: Each daemon module must implement a common API in order to be correctly called by the OTRS daemon and be a semi persistent process in the system. Persistent process could grow in size and memory usage over the time and normally they do not respond to changes in the configuration. That is why the daemon modules should implement a discard mechanism to be stopped and re-spawned again from time to time, freeing system resources and re-reading the configuration.
hu: Minden egyes démonmodulnak meg kell valósítania egy közös API-t annak érdekében, hogy az OTRS démon helyesen tudja meghívni, és félig állandó folyamat legyen a rendszeren. Az állandó folyamat megnövelheti a méretét és memóriahasználatát az idő múlásával, és normális esetben nem válaszolnak a beállításokban lévő változásokra. Ezért kell a démonmoduloknak megvalósítaniuk egy eldobási mechanizmust, hogy leállíthatók és újra meghívhatók legyenek időről időre, felszabadítva a rendszer erőforrásait és újraolvasva a beállításokat.
zh_cn: 每个守护程序模块必须实现一个通用API才能被OTRS守护程序正确调用，并且是系统中的半持久进程。 持久化进程的大小和内存使用量会随着时间的推移而增长，通常它们不会响应配置中的更改。 这就是为什么守护程序模块应该实现丢弃机制以便不时地中止并重新生成，从而释放系统资源并重新读取配置。

source: A daemon module could be an all-in-one solution to perform a certain job, but there could be the case that a solution requires different daemon modules due to its complexity. That is exactly the case of the OTRS scheduler daemon that is split into several daemon modules including some daemon modules for task management and task execution.
hu: Egy démonmodul lehet mindenre jó megoldás bizonyos feladat végrehajtásánál, de lehet olyan eset is, amikor egy megoldás különböző démonmodulokat igényel az összetettsége miatt. Pontosan ez az eset az OTRS ütemező démonjával, amely fel van osztva számos démonmodulra, beleértve a feladatkezeléshez és a feladat-végrehajtáshoz szükséges néhány démonmodult.
zh_cn: 守护进程模块可以是执行特定作业的一体化解决方案，但由于其复杂性，可能存在解决方案需要不同守护进程模块的情况。 这正是OTRS调度程序守护进程的情况，它被分成几个守护程序模块，包括用于任务管理和任务执行的一些守护进程模块。

source: It is not always necessary to create a new daemon module to perform certain task, usually the OTRS scheduler daemon can deal with the majority of them, either if it is an OTRS function that needs to be executed on a regular basis (CRON like) or if it's triggered by an OTRS event, the OTRS scheduler should be capable to deal with it out of the box or by adding a new scheduler task worker module.
hu: Nem szükséges mindig új démonmodult létrehozni bizonyos feladatok végrehajtásához. Általában az OTRS ütemező démon elboldogul ezek jelentős részével – akár ha egy olyan OTRS függvényről van szó, amelyet rendszeresen végre kell hajtani (CRON-szerűen), vagy ha egy OTRS esemény aktiválta azt – az OTRS ütemezőnek képesnek kell lenni kezelnie mindenféle beállítás nélkül, vagy egy új ütemező feladatelvégző modul hozzáadásával.
zh_cn: 并不总是需要创建一个新的守护进程模块来执行某些任务，通常OTRS调度程序守护进程可以处理它们中的大多数，如果它是需要定期执行的OTRS函数（类似CRON）或者 如果它是由OTRS事件触发的，那么OTRS调度程序应该能够开箱即用或者通过添加新的调度程序任务工作模块来处理它。

source: Creating A New Daemon Module
hu: Új démonmodul létrehozása
zh_cn: 创建一个新的守护进程模块

source: All daemon modules requires to be registered in the system configuration in order to be called by the main OTRS daemon.
hu: Az összes démonmodulnak regisztrálva kell lennie a rendszerbeállításokban azért, hogy a fő OTRS démon meg tudja hívni azokat.
zh_cn: 所有守护进程模块都需要在系统配置中注册，以便由主OTRS守护进程调用。

source: Daemon Module Registration Code Example
hu: Démonmodul regisztrációs kódpélda
zh_cn: 守护进程模块注册代码示例

source: Daemon Module Code Example
hu: Démonmodul kódpélda
zh_cn: 守护进程模块代码示例

source: The following code implements a daemon module that displays the system time every 2 seconds.
hu: A következő kód egy olyan démonmodult valósít meg, amely megjeleníti a rendszeridőt 2 másodpercenként.
zh_cn: 以下代码实现了一个守护进程模块，该模块每2秒显示一次系统时间。

source: This is common header that can be found in common OTRS modules. The class/package name is declared via the ``package`` keyword.
hu: Ez egy gyakori fejléc, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a ``package`` kulcsszón keresztül van deklarálva.
zh_cn: 这是可在常见OTRS模块中找到的通用标头。 类/包名称通过 ``package`` 关键字声明。

source: In this case we are inheriting from ``BaseDaemon`` class, and the object manager dependencies are set.
hu: Ebben az esetben a ``BaseDaemon`` osztályból származtatunk le, és az objektumkezelő függőségei be vannak állítva.
zh_cn: 在这个例子中，我们继承自 ``BaseDaemon`` 类，并设置了对象管理器依赖项。

source: The constructor ``new`` creates a new instance of the class. Some used objects are also created here. It is highly recommended to disable in-memory cache in daemon modules especially if OTRS runs in a cluster environment.
hu: A ``new`` konstruktor hozza létre az osztály új példányát. Néhány felhasznált objektum is itt lesz létrehozva. Erősen ajánlott a memóriába történő gyorsítótárazás letiltása a démonmodulokban, különösen akkor, ha az OTRS fürtözött környezetben fut.
zh_cn: 构造函数 ``new`` 创建了一个新的类实例。 这里也创建了一些使用过的对象。 强烈建议在守护进程模块中禁用内存高速缓存，尤其是在OTRS在集群环境中运行时。

source: In order to make this daemon module to be executed every two seconds it is necessary to define a sleep time accordingly, otherwise it will be executed as soon as possible.
hu: Azért, hogy ez a démonmodul minden második másodpercben végrehajtható legyen, egy alvási idő meghatározása szükséges annak megfelelően, egyébként azonnal végrehajtásra kerül, amint lehetséges.
zh_cn: 为了使该守护进程模块每两秒执行一次，必须相应地定义休眠时间，否则将会尽快执行。

source: Refreshing the daemon module from time to time is necessary in order to define when it should be discarded.
hu: A démonmodul frissítése időről időre azért szükséges, hogy meghatározható legyen, mikor kell eldobni.
zh_cn: 必须不时刷新守护进程模块，以便定义何时应该丢弃它。

source: For the following functions (``PreRun``, ``Run`` and ``PostRun``) if they return false, the main OTRS daemon will discard the object and create a new one as soon as possible.
hu: A következő függvényeknél (``PreRun``, ``Run`` és ``PostRun``) ha azok hamis értékkel térnek vissza, akkor a fő OTRS démon el fogja dobni az objektumot, és egy újat hoz létre, amint lehetséges.
zh_cn: 对于以下函数（``PreRun``、``Run`` 和 ``PostRun``）如果它们返回false，主OTRS守护进程将丢弃该对象并尽快创建一个新对象。

source: The ``PreRun`` method is executed before the main daemon module method, and the its purpose is to perform some test before the real operation. In this case a check to the database is done (always recommended), otherwise it sleeps for 10 seconds. This is needed in order to wait for DB connection to be reestablished.
hu: A ``PreRun`` metódus a fő démonmodul metódusa előtt kerül végrehajtásra, és a célja néhány teszt elvégzése a valódi műfelet előtt. Ebben az esetben az adatbázis ellenőrzése készen van (mindig javasolt), egyébként 10 másodpercet alszik. Ez azért szükséges, hogy megvárja az adatbázis-kapcsolat ismételt felépítését.
zh_cn: ``PreRun`` 方法在主守护进程模块方法之前执行，其目的是在实际操作之前执行一些测试。 在这个例子中，对数据库进行检查（始终建议），否则它将休眠10秒。 这是为了等待重新建立DB连接所必需的。

source: The ``Run`` method is where the main daemon module code resides, in this case it only prints the current time.
hu: A ``Run`` metódus az, ahol a fő démonmodul kódja található. Ebben az esetben csak az aktuális időt írja ki.
zh_cn: ``Run`` 方法是主守护进程模块代码所在的位置，在这个例子中它只打印当前时间。

source: The ``PostRun`` method is used to perform the sleeps (preventing the daemon module to be executed too often) and also to manage the safe discarding of the object. Other operations like verification or cleanup can be done here.
hu: A ``PostRun`` metódus használható az alvások végrehajtásához (annak megakadályozásához, hogy a démonmodul túl gyakran legyen végrehajtva), valamint az objektum biztonságos eldobásának kezeléséhez is. Egyéb műveletek is elvégezhetők itt, mint például ellenőrzés vagy tisztítás.
zh_cn: ``PostRun`` 方法用于执行休眠（防止守护进程模块执行得太频繁），并且还用于管理对象的安全丢弃。 其它操作如验证或清理可以在这里完成。

source: The ``Summary`` method is called by the console command ``Maint::Daemon::Summary`` and it's required to return ``Header``, ``Column``, ``Data`` and ``NoDataMessages`` keys. ``Column`` and ``Data`` needs to be an array of hashes. It is used to display useful information of what the daemon module is currently doing, or what has been done so far. This method is optional.
hu: A ``Summary`` metódust a ``Maint::Daemon::Summary`` konzolparancs hívja meg, és ``Header``, ``Column``, ``Data`` és ``NoDataMessages`` kulcsokat kell visszaadnia. A ``Column`` és a ``Data`` kulcsoknak tömböknek vagy kivonatoknak kell lenniük. Arra használható, hogy hasznos információkat jelenítsen meg arról, amit a démonmodul éppen csinál, vagy ami eddig történt. Ez a metódus elhagyható.
zh_cn: ``Summary`` 方法由控制台命令 ``Maint::Daemon::Summary`` 调用，它需要返回 ``Header``、``Column``、``Data`` 和 ``NoDataMessages`` 键。 ``Column`` 和 ``Data`` 需要是一个哈希数组。 它用于显示守护进程模块当前正在执行的操作的有用信息，或者到目前为止已完成的操作。 此方法是可选的。

source: End of file.
hu: Fájl vége.
zh_cn: 文件结束。

source: OTRS Scheduler
hu: OTRS ütemező
zh_cn: OTRS调度程序

source: The OTRS scheduler is a conjunction of daemon modules and task workers that runs together in order to perform all needed OTRS tasks asynchronously from the web server process.
hu: Az OTRS ütemező a démonmodulok és a feladatelvégzők együttese, amelyek együtt futnak azért, hogy az összes szükséges OTRS feladatot aszinkron módon végrehajtsák a webkiszolgáló folyamatából.
zh_cn: OTRS调度程序是守护进程模块和任务工作程序的组合，它们一起运行，以便从Web服务器进程异步执行所有需要的OTRS任务。

source: OTRS Scheduler Task Managers
hu: OTRS ütemező feladatkezelők
zh_cn: OTRS调度程序任务管理器
