Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: All outputs are customized on the build server. If you want to setup a developer environment in your local machine for testing and writing the documentation, the outputs can be different.
hu: Az összes kimenet személyre van szabva az összeállító kiszolgálón. Ha a helyi gépén szeretne egy fejlesztői környezetet felállítani a teszteléshez és a dokumentáció írásához, akkor a kimenetek eltérőek lehetnek.
zh_cn: 所有输出都在构建服务器上自定义。 如果要在本地计算机中设置开发人员环境以进行测试和编写文档，则输出可能会有所不同。

source: reStructuredText Primer
hu: reStructuredText alapozó
zh_cn: reStructuredText 入门

source: The documentation format name is **reStructuredText** (one word, this is the correct spelling). This is an easy to read documentation format using plain text and small inline markers.
hu: A dokumentációformátum neve **reStructuredText** (egybe írva, ez a helyes írásmód). Ez egy könnyen olvasható dokumentumformátum, amely egyszerű szöveget és kisebb sorközi jelölőket használ.
zh_cn: 文档格式名称是 **reStructuredText** （一个单词，这是正确的拼写）。这是一种使用纯文本和小型内联标记的易于阅读的文档格式。

source: This short tutorial will guide you through to create or update documentations. To give a full featured tutorial about how to use the *reStructuredText* format is beyond the scope of this document, and many tutorials (e. g. `Sphinx reStructuredText primer <http://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`__ and `reStructuredText user documentation <http://docutils.sourceforge.net/rst.html>`__) and `on-line editors <http://rst.ninjs.org>`__ are available on the internet.
hu: Ez a rövid ismertető végigvezeti Önt a dokumentációk létrehozásán és frissítésén. A *reStructuredText* formátum használatáról szóló teljes körű ismertető biztosítása túlmutat ezen dokumentáció hatókörén, de számos ismertető (például a `Sphinx reStructuredText alapozó <http://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`__ és a `reStructuredText felhasználói dokumentáció <http://docutils.sourceforge.net/rst.html>`__) és `internetes szerkesztő <http://rst.ninjs.org>`__ érhető el az interneten.
zh_cn: 这个简短的教程将指导您创建或更新文档。 提供有关如何使用 *reStructuredText* 格式的全功能教程超出了本文档的范围，可在互联网上找到许多教程（例如 `Sphinx reStructuredText primer <http://www.sphinx-doc.org/en/master/usage /restructuredtext/basics.html>`__ 和 `reStructuredText用户文档 <http://docutils.sourceforge.net/rst.html>`__ ）和 `在线编辑器 <http://rst.ninjs.org>`__ 。

source: The following examples shows the most commonly used documentation elements.
hu: A következő példák a leggyakrabban használt dokumentációs elemeket mutatják be.
zh_cn: 以下示例显示了最常用的文档元素。

source: Headings
hu: Címsorok
zh_cn: 标题

source: To use heading in the documentation, you have to underline the titles with special characters. The underline must start from the first letter of the title and end at the last letter of the title. The hierarchy of the special characters are the following: =, -, ~, ^, .
hu: Címsorok használatához a dokumentációban alá kell húznia a címeket különleges karakterekkel. Az aláhúzásnak a cím első karakterétől kell kezdődnie és a cím utolsó karakterénél kell végződnie. A különleges karakterek hierarchiája a következő: =, -, ~, ^, .
zh_cn: 要在文档中使用标题，必须在标题下加上特殊字符。下划线必须从标题的第一个字母开始，并以标题的最后一个字母结束。特殊字符的层次结构如下：=、-、~、^、. 。

source: The following example shows the usage of the headings:
hu: A következő példa a címsorok használatát mutatja be:
zh_cn: 以下示例显示了标题的用法：

source: Paragraphs
hu: Bekezdések
zh_cn: 段落

source: For writing paragraphs, you have to start sentences at the beginning of the line. To create a new paragraph, just leave a blank line between the paragraphs. Example:
hu: Bekezdések írásához a mondatokat a sor elején kell kezdenie. Új bekezdés létrehozásához egyszerűen hagyjon egy üres sort a bekezdések között. Példa:
zh_cn: 要写段落，您必须从行首开始句子。要创建新段落，只需在段落之间留一行空白。示例：

source: Inline Markups
hu: Sorközi jelölők
zh_cn: 内联标记

source: The standard inline markup is quite simple:
hu: A szabványos sorközi jelölők viszonylag egyszerűek:
zh_cn: 标准的内联标记非常简单：

source: One asterisk: \*text\* for *emphasis* (italics).
hu: Egy csillag: \*szöveg\* a *hangsúlyozáshoz* (döntött).
zh_cn: 一个星号：\*text\*表示 *重点* （斜体）。

source: Two asterisks: \*\*text\*\* for **strong emphasis** (boldface).
hu: Két csillag: \*\*szöveg\*\* az **erős hangsúlyozáshoz** (vastagított).
zh_cn: 两个星号：\*\*text\*\* 表示 **强调** （粗体）。

source: Grave accents: \`\`text\`\` for ``literal texts`` (code samples).
hu: Hangsúlyjelek: \`\`szöveg\`\` a ``szó szerinti szövegekhez`` (kódpéldák).
zh_cn: 反引号：\`\`text\`\` 表示 ``常量文本`` （示例代码）。

source: If asterisks or grave accents appear in running text which could be confused with inline markup delimiters, they have to be escaped with a backslash, like \\*.
hu: Ha csillagok vagy hangsúlyjelek fordulnak elő a futó szövegben, amelyek összekeverhetők a sorközi jelölők határolóival, akkor el kell fedni azokat egy visszafelé álló perjellel, mint például \\*.
zh_cn: 如果正在运行的文本中出现星号或反引号，可能与内联标记分隔符混淆，则必须使用反斜杠进行转义，例如\\*。

source: Lists
hu: Listák
zh_cn: 列表项目

source: To create unordered lists, start a line with asterisk (\*) or dash (-). To create ordered list, start a line with numbers or hash mark (#). If you need nested lists, leave a blank line between the list items and use indentation with 3 spaces. Example:
hu: Felsorolások létrehozásához kezdje a sort egy csillaggal (\*) vagy kötőjellel (-). Számozott listák létrehozásához kezdje a sort számokkal vagy kettős kereszttel (#). Ha egymásba ágyazott listákra van szüksége, akkor hagyjon egy üres sort a listaelemek között, és használjon 3 szóköznyi behúzást. Példa:
zh_cn: 要创建无序列表，请使用星号（\*）或短划线（ - ）开始一行。 要创建有序列表，请使用数字或井号（＃）开始一行。 如果需要嵌套列表，请在列表项之间留一个空行，并使用3个空格的缩进。 例：

source: Nested list example:
hu: Példa egymásba ágyazott listára:
zh_cn: 嵌套列表的例子：

source: Literal Blocks
hu: Szó szerinti blokkok
zh_cn: 文字块

source: Literal blocks are texts that should be displayed as verbatim. To create literal blocks, do the following:
hu: A szó szerinti blokkok olyan szövegek, amelyeket betűhelyesen kell megjeleníteni. Szó szerinti blokkok létrehozásához a következőt tegye:
zh_cn: 文字块是应逐字显示的文本。 要创建文字块，请执行以下操作：

source: Type 2 colons (::) in a new line.
hu: Írjon be 2 kettőspontot (::) egy új sorba.
zh_cn: 在新行中输入2冒号（::)。

source: Leave a blank line.
hu: Hagyjon egy üres sort.
zh_cn: 留一个空行。

source: Write the text with indentation of 3 spaces.
hu: Írja be a szöveget 3 szóköznyi behúzással.
zh_cn: 用3个空格的缩进写出文本。

source: Use literal blocks for code snippets, terminal outputs, configuration files, etc. Example:
hu: Használjon szó szerinti blokkokat kódrészletekhez, terminálkimenetekhez, beállítófájlokhoz, stb. Példa:
zh_cn: 对代码片段、终端输出、配置文件等使用文本块。示例：

source: If the language of the code snippet is known, you can specify it for syntax highlighting:
hu: Ha ismert a kódrészlet nyelve, akkor megadhatja azt a szintaxis kiemeléséhez:
zh_cn: 如果代码片段的语言是已知的，则可以将其指定为语法突出显示：

source: Tables
hu: Táblázatok
zh_cn: 表格

source: To create grid tables, you have to draw the table. Example:
hu: Rácsos táblázatok létrehozásához meg kell rajzolnia a táblázatot. Példa:
zh_cn: 要创建表格，必须绘制表格。示例：

source: Hyperlinks
hu: Hiperhivatkozások
zh_cn: 超链接

source: Hyperlinks can be used inline or referenced. For inline use, encapsulate the text of the link and the URL with grave accents and two trailing underscore characters.
hu: A hiperhivatkozások lehetnek sorköziek vagy hivatkozottak. Sorközi használathoz fogja közre a hivatkozás szövegét és az URL-t hangsúlyjelekkel, és zárja két aláhúzás karakterrel.
zh_cn: 超链接可以用于内联或引用。 对于内联使用，请使用反引号和两个尾随下划线字符封装链接的文本和URL。

source: The link above will display as: `OTRS website <https://otrs.com>`__.
hu: A fenti hivatkozás így lesz megjelenítve: `OTRS website <https://otrs.com>`__.
zh_cn: 上面的链接将显示为： `OTRS网站 <https://otrs.com>`__。

source: To create referenced links, you have to separate the text and the link. Example:
hu: Hivatkozott hivatkozások létrehozásához külön kell választani a szöveget és a hivatkozást. Példa:
zh_cn: 要创建引用的链接，您必须分隔文本和链接。 例：

source: Images
hu: Képek
zh_cn: 图片

source: To insert an image into the documentation:
hu: A dokumentációba egy kép beszúráshoz:
zh_cn: 要将图片插入文档：

source: Put the image in the ``images`` folder.
hu: Tegye a képet az ``images`` mappába.
zh_cn: 将图片放在 ``images`` 文件夹中。

source: Create a reference to the image with:
hu: Hozzon létre egy hivatkozást a képre ezzel:
zh_cn: 创建对图片的引用：

source: Colored Boxes
hu: Színes dobozok
zh_cn: 彩色的框

source: These boxes have special meanings and will be highlighted as default.
hu: Ezeknek a dobozoknak különleges jelentésük van, és alapértelmezetten kiemelésre kerülnek.
zh_cn: 这些框具有特殊含义，默认情况下会突出显示。

source: Warning box:
hu: Figyelmeztetés doboz:
zh_cn: 警告框：

source: This is a warning box.
hu: Ez egy figyelmeztetés doboz.
zh_cn: 这是一个警告框。

source: Note box:
hu: Megjegyzés doboz:
zh_cn: 备注框：

source: This is a note box.
hu: Ez egy megjegyzés doboz.
zh_cn: 这是一个备注框。

source: See also box:
hu: Lásd még doboz:
zh_cn: 参见框：

source: This is a see also box.
hu: Ez egy lásd még doboz.
zh_cn: 这是一个参见框。

source: Style Guide
hu: Stílus irányelvek
zh_cn: 样式指南

source: This part of the documentation is only for visual style and wording.
hu: A dokumentáció ezen része csak a látható stílushoz és a fogalmazáshoz van.
zh_cn: 这部分文档仅用于视觉风格和措辞。

source: Writing Content
hu: Tartalom írása
zh_cn: 编写内容

source: There is an internet slang **TL;DR**, which means *too long, didn't read* (see more information on `Wikipedia <https://en.wikipedia.org/wiki/TL;DR>`__). Many people don't like reading long texts, so please keep the documentation as short as possible. Use step-by-step tutorials instead of writing wall of text.
hu: Létezik egy **TL;DR** internetes szleng, amely azt jelenti, hogy *túl hosszú, nem olvastam el* (további információért nézze meg a `Wikipédiát <https://hu.wikipedia.org/wiki/TL;DR>`__). Sok ember nem szeret hosszú szövegeket olvasni, ezért arra kérjük, hogy tartsa a dokumentációt olyan röviden, amennyire csak lehetséges. Használjon lépésről lépésre bemutató ismertetőt a tömör szöveg írása helyett.
zh_cn: 有一个互联网俚语 **TL; DR**，这意味着 *太长，不看* （更多信息请参阅 `Wikipedia维基百科 <https://en.wikipedia.org/wiki/TL;DR>`__）。 很多人不喜欢阅读长篇文章，所以请尽量缩短文档。 使用分步教程而不是编写文本墙。

source: For example this is a **wrong** example for writing content:
hu: Például ez egy **rossz** példa a tartalom írására:
zh_cn: 例如，这是一个 **错误的** 编写内容示例：

source: The same content in **suggested** *human understandable* format:
hu: Ugyanez a tartalom az *ember által is olvasható* **ajánlott** formátumban:
zh_cn: 同样的内容采用 **建议的**、 *人类可理解的* 格式：

source: The latter is easier to translate, because 6 short sentences will be included in the language file. If a content is changed in one of the sentences, only the changed sentence need to be reviewed and translated again. The first wrong example puts only one huge string to the language file, and if some changes will be made in the source string, the translator needs to review and re-translate the whole string.
hu: Az utóbbit egyszerűbb lefordítani, mert 6 rövid mondat kerül felvételre a nyelvi fájlba. Ha a tartalom megváltozik a mondatok egyikében, akkor csak a megváltozott mondatot kell átnézni és újra lefordítani. Az első rossz példa csak egyetlen hatalmas karakterláncot tesz a nyelvi fájlba, és ha valamilyen változtatást végeznek a forrásszövegen, akkor a fordítónak a teljes szöveget át kell néznie és újrafordítania.
zh_cn: 后者更容易翻译，因为语言文件中将包含6个短句。 如果在其中一个句子中更改了内容，则只需要再次检查和翻译已更改的句子。 第一个错误示例只将一个大字符串放入语言文件中，如果在源字符串中进行某些更改，则翻译程序需要检查并重新翻译整个字符串。

source: Screenshots
hu: Képernyőképek
zh_cn: 屏幕截图

source: Don't use the native resolution of your machine. Usually it is full HD or bigger, so creating a screenshot with this resolution will became unreadable in some output, because all the images have to be shrink to the width of A4 paper in case of PDF. OTRS uses responsive design, so 1025 pixels is the minimum, that OTRS assumes it is a large display. Please use this as width of your screenshots.
hu: Ne használja a számítógépe natív felbontását. Általában az teljes HD vagy nagyobb, így az ezzel a felbontással készített képernyőkép olvashatatlanná válik egyes kimeneteken, mert egy PDF esetén az összes képet össze kell zsugorítani az A4-es papír szélességére. Az OTRS alkalmazkodó megjelenítést használ, így 1025 képpont a minimum, amelyet az OTRS nagy kijelzőnek feltételez. Használja ezt a képernyőképek szélességeként.
zh_cn: 不要使用电脑的原始分辨率。 通常它是全高清或更高，因此在某些输出中创建具有此分辨率的屏幕截图将变得不可读，因为在PDF的情况下所有图像必须缩小到A4纸的宽度。 OTRS使用响应式设计，因此1025像素是最小的，OTRS假设它是一个大的显示器。 请将此值用作屏幕截图的宽度。

source: The resolution can be set in all web browser with a feature called *mobile mode* or *responsive design*. Check your browser user manual for the usage of the feature and set the width of the screen to 1025 pixels.
hu: A felbontást az összes webböngészőben be lehet állítani egy úgynevezett *mobil mód* vagy *alkalmazkodó megjelenés* funkcióval. Nézze meg a böngészője felhasználói kézikönyvét a funkció használatához, és állítsa a képernyő szélességét 1025 képpontra.
zh_cn: 可以在所有Web浏览器中使用称为 *移动模式* 或 *响应式设计* 的功能设置分辨率。 查看浏览器用户手册以了解该功能的用法，并将屏幕宽度设置为1025像素。

source: This is an example for a **wrong** screenshot, as it has resolution of full HD. Due to the automatic shrinking the texts on the screenshot are hard to read:
hu: Ez egy példa egy **rossz** képernyőképre, mivel az teljes HD felbontású. Az automatikus zsugorítás miatt a szövegeket nehéz elolvasni a képernyőképen:
zh_cn: 这是一个 **错误的** 截图示例，因为它具有全高清分辨率。 由于自动收缩，屏幕截图上的文字难以阅读：

source: Agent Dashboard (1920 pixels width)
hu: Ügyintézői vezérlőpult (1920 képpont szélességben)
zh_cn: 服务人员仪表板（1920像素宽）

source: The same screenshot with **suggested** resolution. The texts are much easier to read:
hu: Ugyanaz a képernyőkép az **ajánlott** felbontásban. A szövegeket sokkal könnyebb elolvasni:
zh_cn: 与 **建议的** 分辨率相同的屏幕截图。 文本更容易阅读：

source: Agent Dashboard (1025 pixels width)
hu: Ügyintézői vezérlőpult (1025 képpont szélességben)
zh_cn: 服务人员仪表板（1025像素宽）

source: It is also wrong, if the screenshot has good resolution in pixels, but with high DPI. For example this screenshot is **wrong**, because the texts on it is much bigger than the other texts in the documentation:
hu: Az szintén rossz, ha a képernyőkép jó képpontfelbontással rendelkezik, de magas DPI értékkel. Például ez a képernyőkép **rossz**, mert a rajta lévő szöveg sokkal nagyobb a dokumentációban lévő szövegnél:
zh_cn: 如果屏幕截图具有良好的像素分辨率，但具有高DPI，则也是错误的。 例如，这个截图是 **错误的** ，因为它上面的文本比文档中的其它文本大得多：

source: Video Invitation Dialog (756 pixels width but with high DPI)
hu: Videomeghívási párbeszédablak (756 képpont szélességben, de magas DPI értékkel)
zh_cn: 视频邀请对话框（宽度为756像素但具有高DPI）

source: Create Screenshots with Firefox
hu: Képernyőképek készítése Firefox használatával
zh_cn: 使用Firefox创建屏幕截图

source: If only a part of the screenshot is required, the screenshot needs to be cropped. The administrator interface of OTRS consist of a left sidebar and a main content column. To create screenshots with Firefox:
hu: Ha csak a képernyőkép egy része szükséges, akkor a képernyőképet meg kell vágni. Az OTRS adminisztrátori felülete egy bal oldalsávból és egy fő tartalmi oszlopból áll. A Firefox használatával történő képernyőkép készítéséhez:
zh_cn: 如果只需要部分屏幕截图，则需要裁剪屏幕截图。 OTRS的管理员界面由左侧边栏和主内容列组成。 要使用Firefox创建屏幕截图：

source: Right click on an element in the browser and select *Inspect element*.
hu: Kattintson a jobb egérgombbal egy elemre a böngészőben, és válassza az *Elem vizsgálata* lehetőséget.
zh_cn: 右键单击浏览器中的元素，然后选择 *查看元素*。

source: Select the element in the DOM, if it was not selected.
hu: Válassza ki az elemet a DOM-ban, ha nem lett kiválasztva.
zh_cn: 如果未选中，则选择DOM中的元素。

source: Right click on the node and select *Screenshot Node*.
hu: Kattintson a jobb egérgombbal a csomópontra, és válassza a *Képernyőkép a csomópontról* lehetőséget.
zh_cn: 右键单击节点并选择 *节点截图*。

source: Example screenshot for the main content
hu: Példa képernyőkép a fő tartalomról
zh_cn: 主要内容的示例屏幕截图

source: Example screenshot for the left sidebar
hu: Példa képernyőkép a bal oldalsávról
zh_cn: 左侧边栏的示例屏幕截图

source: Example screenshot for the main content column
hu: Példa képernyőkép a fő tartalom oszlopáról
zh_cn: 主内容列的示例屏幕截图

source: Capitalization in Documentation
hu: Nagybetűs írás a dokumentációban
zh_cn: 文档中的大写

source: For titles always have to use sentence case capitalization, which means, that in titles always capitalize:
hu: A címeknél mindig minden szót nagybetűvel kezdjen, ami azt jelenti, hogy a címekben mindig nagybetűvel kezdődnek a következők:
zh_cn: 对于标题总是必须使用句子大小写，这意味着，标题总是大写：

source: Nouns (man, bus, book).
hu: Főnevek (ember, busz, könyv).
zh_cn: 名词（man, bus, book）。

source: Adjectives (angry, lovely, small).
hu: Melléknevek (mérges, kedves, kicsi).
zh_cn: 形容词（angry, lovely, small）。

source: Verbs (run, eat, sleep).
hu: Igék (fut, eszik, alszik).
zh_cn: 动词（run, eat, sleep）。

source: Adverbs (slowly, quickly, quietly).
hu: Határozószavak (lassan, gyorsan, csendben).
zh_cn: 副词（slowly, quickly, quietly）。

source: Pronouns (he, she, it).
hu: Névmások (ő, mi, az).
zh_cn: 代词（he, she, it）。

source: Subordinating conjunctions (as, because, that).
hu: Alárendelt kötőszavak (mivel, mert, amely).
zh_cn: 从属连词（as, because, that）。

source: In titles do not capitalize:
hu: A címekben ne kezdje nagybetűvel a következőket:
zh_cn: 在标题中不大写：

source: Articles: a, an, the.
hu: Névelők: a, az, egy.
zh_cn: 冠词： a, an, the。

source: Coordinating conjunctions: and, but, or, for, nor, etc.
hu: Mellérendelt kötőszavak: és, de, vagy, stb.
zh_cn: 并列连词： and、 but、 or、 for、 nor 等。

source: Prepositions (fewer than five letters): on, at, to, from, by, etc.
hu: Elöljárószavak (öt betűnél rövidebbek): rá, oda, tőle, stb.
zh_cn: 介词（少于五个字母）：on、 at、 to、from、 by 等。

source: In normal sentences don't capitalize any words, only names and reference to titles have to be capitalized. This is a **wrong** example:
hu: A normál mondatokban ne kezdjen nagybetűvel semmilyen szót, csak a neveket és a címekre hivatkozásokat kell nagybetűvel kezdeni. Ez egy **rossz** példa:
zh_cn: 在普通句子中，不要将任何单词大写，只有名称和标题的引用必须大写。 这是 **错误的** 示例：

source: The **suggested** sentence with proper capitalization. Besides, *Ticket Zoom* is the name of the screen, so it should be emphasized:
hu: Az **ajánlott** mondat megfelelő nagybetűs írással. Kivéve a *Ticket Zoom* nevet, ami a képernyő neve, ezért ki kell hangsúlyozni:
zh_cn: **建议的** 句子有适当的大写字母。 此外，*Ticket Zoom* 是屏幕的名称，因此需要强调：

source: Buttons and Screen Names
hu: Gombok és képernyőnevek
zh_cn: 按钮和屏幕名称

source: In the content sentences all buttons and screens should be emphasized and should be written with capital letters or in sentence case. Don't use apostrophes or quotation marks for emphasizing.
hu: A tartalom mondataiban az összes gombot és képernyőt ki kell hangsúlyozni, és nagy kezdőbetűkkel vagy minden szót nagy kezdőbetűvel kell írni. Ne használjon aposztrófot vagy idézőjelet a hangsúlyozáshoz.
zh_cn: 在内容句子中，应强调所有按钮和屏幕，并应使用大写字母或句子大小写。 不要使用撇号或引号来强调。

source: This sentence is **wrong**, because apostrophes are used for emphasizing:
hu: Ez a mondat **rossz**, mert aposztrófokat használnak a hangsúlyozáshoz:
zh_cn: 这句话是 **错误的** ，因为用撇号来强调：

source: The **suggested** way is to use asterisks for emphasizing:
hu: Az **ajánlott** mód a csillagok használata a hangsúlyozáshoz:
zh_cn: **建议的** 方法是用星号来强调：

source: Wording
hu: Fogalmazás
zh_cn: 措词

source: Don't use variable names in sentences. This sentence is **wrong**, because a variable name is meaningless for some people:
hu: Ne használjon változóneveket a mondatokban. Ez a mondat **rossz**, mert egy változónév néhány ember számára értelmetlen:
zh_cn: 不要在句子中使用变量名。 这句话是 **错误的** ，因为变量名对某些人来说毫无意义：

source: The same sentence without variable name, this is **suggested**:
hu: Ugyanaz a mondat változónév nélkül, ez az **ajánlott**:
zh_cn: 没有变量名的同一个句子，这是 **建议的** ：

source: Variable Names
hu: Változónevek
zh_cn: 变量名

source: Variable names should always marked as ``literal`` content. This is useful for translators, as they can exactly know, that the string mustn't be translated. If a string is not marked as literal content, it usually should be translated. For example:
hu: A változóneveket mindig ``szó szerinti`` tartalomként kell megjelölni. Ez hasznos a fordítók számára, mivel így pontosan tudják, hogy a karakterláncot nem szabad lefordítani. Ha egy karakterlánc nem szó szerinti szövegként van megjelölve, akkor általában le kell fordítani. Például:
zh_cn: 变量名应始终标记为 ``literal（原封不动显示文字）`` 内容。 这对翻译人员非常有用，因为他们可以确切地知道，字符串不得翻译。 如果字符串未标记为文字内容，则通常应将其翻译。 例如：

source: Translating the Documentation
hu: A dokumentáció fordítása
zh_cn: 翻译文档

source: Here are some examples.
hu: Itt van néhány példa.
zh_cn: 这里有些例子。

source: Emphases
hu: Hangsúlyozás
zh_cn: 重点

source: Emphasized texts are between two asterisks. The text should be translated. This is usually used for screen names, titles, buttons and labels. Please check the user interface translations to find and use the same wording in the documentation.
hu: A hangsúlyos szövegek két csillag közt találhatók. A szöveget le kell fordítani. Ezt általában képernyőneveknél, címeknél, gomboknál és címkéknél használják. Nézze meg a felhasználói felület fordításait, hogy megtalálja és ugyanazt a megfogalmazást használja a dokumentációban is.
zh_cn: 强调文本在两个星号之间。 文本应该翻译。 这通常用于屏幕名称、标题、按钮和标签。 请检查用户界面翻译以查找和使用文档中的相同措辞。

source: Example original sentence:
hu: Példa az eredeti szövegre:
zh_cn: 示例原句：

source: Example translation into Hungarian:
hu: Példa a magyarra történő fordításra:
zh_cn: 匈牙利语翻译示例：

source: Strong
hu: Hangsúlyozás
zh_cn: 强调

source: Strong texts are between two double asterisks. The text should be translated. This is usually used for important information.
hu: A hangsúlyos szövegek két dupla csillag között vannak. A szöveget le kell fordítani. Ezt általában fontos információknál használják.
zh_cn: 强文本位于两个双星号之间。应翻译该文本。这通常用于重要信息。

source: Literal texts
hu: Szó szerinti szövegek
zh_cn: 常量文本

source: Literal texts are between two double back-tick characters. This is usually used for variable names, configuration names and file paths, and **must not** be translated, otherwise it will break the structure.
hu: A szó szerinti szövegek két dupla hangsúlyjel között vannak. Ezt általában változóneveknél, beállítások neveinél és fájlok útvonalainál használják. **Tilos** lefordítani, különben tönkre fogja tenni a szerkezetet.
zh_cn: 常量文本介于两个双反引号之间。 这通常用于变量名、配置名和文件路径， **不能** 翻译，否则会破坏结构。

source: Internal links
hu: Belső hivatkozások
zh_cn: 内部链接

source: Internal links point to other pages or headings of the pages. ``:doc:`page-name``` is used for referring to a page and ``:ref:`Heading Title``` is used for referring to a heading. There is a custom tag ``:sysconfig:`System Configuration Name``` for referring to a system configuration. The texts *page-name*, *Heading Title* and *System Configuration Name* **must not** be translated, otherwise it will break the structure.
hu: A belső hivatkozások más oldalakra vagy oldalak címsoraira mutatnak. A ``:doc:`page-name``` használható egy oldalra történő hivatkozáshoz és a ``:ref:`Heading Title``` használható egy címsorra való hivatkozáshoz. Létezik egy egyéni ``:sysconfig:`System Configuration Name``` címke egy rendszerbeállításra való hivatkozáshoz. A *page-name*, *Heading Title* és *System Configuration Name* szövegeket **tilos** lefordítani, különben tönkre fogják tenni a szerkezetet.
zh_cn: 内部链接指向页面的其它页面或标题。 ``:doc:`page-name``` 用于引用页面， ``:ref:`Heading Title``` 用于引用标题。 有一个自定义标签 ``:sysconfig:`System Configuration Name``` 用于引用系统配置。 **不得** 翻译 *页面名称*、 *标题* 和 *系统配置名称* 文本，否则将破坏结构。

source: External links
hu: Külső hivatkozások
zh_cn: 外部链接
