Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: The loader solves this problem by performing the steps outlined in the short description above. Please turn on the Loader again and reload your page now. Now you can see that there are only very few CSS and JavaScript tags in the HTML code, like this:
hu: A betöltő megoldja ezt a problémát a fenti rövid leírásban felvázolt lépések végrehajtásával. Kapcsolja be ismét a betöltőt, és most töltse újra az oldalt. Most azt láthatja, hogy csak nagyon kevés CSS és JavaScript címke van a HTML kódban ehhez hasonlóan:
zh_cn: 加载器通过执行上面简短描述中概述的步骤来解决此问题。 请再次打开Loader并立即重新加载您的页面。 现在您可以看到HTML代码中只有非常少的CSS和JavaScript标记，如下所示：

source: What just happened? During the original request generating the HTML code for this page, the Loader generated these two files (or took them from the cache) and put the shown ``<script>`` tags on the page which link to these files, instead of linking to all relevant JavaScript files separately (as you saw it without the loader being active).
hu: Mi történt most? Ennél az oldalnál a HTML kódot előállító eredeti kérés közben a betöltő előállította ezt a két fájlt (vagy kivette azokat a gyorsítótárból), és betette a látható ``<script>`` címkébe azon az oldalon, amely ezekhez a fájlokhoz van kapcsolva, ahelyett, hogy az összes ide vonatkozó JavaScript fájlt különállóan kapcsolta volna hozzá (amint a bekapcsolt betöltő nélkül láthatta).
zh_cn: 刚刚发生了什么？ 在为该页面生成HTML代码的原始请求期间，加载器生成了这两个文件（或从缓存中获取它们）并在页面上显示链接到这些文件的 ``<script>`` 标签，而不是到所有相关的JavaScript文件的链接（正如您关闭加载器状态时看到的那样）。

source: The CSS section looks a little more complicated:
hu: A CSS szakasz egy kicsivel bonyolultabbnak tűnik:
zh_cn: CSS部分看起来有点复杂：

source: The reason is that Internet Explorer 7 and 8 need special treatment in addition to the default CSS because of their lacking support of web standard technologies. So we have some normal CSS that is loaded in all browsers, and some special CSS that is inside of so-called *conditional comments* which cause it to be loaded **only** by Internet Explorer 7/8. All other browsers will ignore it.
hu: Ennek az az oka, hogy az Internet Explorer 7 és 8 esetén speciális bánásmód szükséges az alapértelmezett CSS mellett a webes szabványtechnológiák hiányos támogatásuk miatt. Ezért van néhány normál CSS-fájlunk, amelyek minden böngészőben betöltődnek, és néhány speciális CSS-fájl az úgynevezett *feltételes megjegyzéseken* belül, amely azt idézi elő, hogy **csak** az Internet Explorer 7/8 töltse be azokat. Az összes többi böngésző figyelmen kívül fogja hagyni.
zh_cn: 原因是Internet Explorer 7和8除了缺省CSS之外还需要特殊处理，因为它们缺乏对Web标准技术的支持。 所以我们在所有浏览器中加载了一些普通的CSS，以及一些特殊的CSS，这些CSS在所谓的 *条件注释* 中，这使得它 **只能** 由Internet Explorer 7/8加载。 所有其它浏览器都会忽略它。

source: Now we have outlined how the loader works. Let's look at how you can utilize that in your own OTRS extensions by adding configuration data to the loader, telling it to load additional or alternative CSS or JavaScript content.
hu: Most felvázoltuk, hogy a betöltő hogyan működik. Nézzük meg, hogy hogyan hasznosíthatja azt a saját OTRS kiterjesztéseiben a betöltőhöz történő konfigurációs adatok hozzáadásával, azt mondva neki, hogy további vagy alternatív CSS vagy JavaScript tartalmat töltsön be.
zh_cn: 现在我们已经概述了加载器的工作原理。 让我们看一下如何通过向加载器添加配置数据，告诉它加载额外的或替代的CSS或JavaScript内容，在自己的OTRS扩展中利用它。

source: Configuring the Loader: JavaScript
hu: A betöltő beállítása: JavaScript
zh_cn: 配置加载器：JavaScript

source: To be able to operate correctly, the loader needs to know which content it has to load for a particular OTRS application module. First, it will look for JavaScript files which *always* have to be loaded, and then it looks for special files which are only relevant for the current application module.
hu: Hogy képes legyen helyesen működni, a betöltőnek tudnia kell, hogy mely tartalmat kell betöltenie egy bizonyos OTRS alkalmazásmodulnál. Először olyan JavaScript fájlokat fog keresni, amelyeket *mindig* be kell tölteni, és ezután keres olyan speciális fájlokat, amelyek csak a jelenlegi alkalmazásmodulnál fontosak.
zh_cn: 为了能够正确操作，加载器需要知道必须为特定OTRS应用程序模块加载哪些内容。 首先，它将查找 *始终* 必须加载的JavaScript文件，然后查找仅与当前应用程序模块相关的特殊文件。

source: Common JavaScript
hu: Közös JavaScript
zh_cn: 共用Javascript

source: The list of JavaScript files to be loaded is configured in the configuration settings ``Loader::Agent::CommonJS`` (for the agent interface) and ``Loader::Customer::CommonJS`` (for the customer interface).
hu: A betöltendő JavaScript fájlok listája a ``Loader::Agent::CommonJS`` (az ügyintézői felülethez) és a ``Loader::Customer::CommonJS`` (az ügyfélfelülethez) konfigurációs beállításokban állítható be.
zh_cn: 要加载的JavaScript文件列表在配置设置 ``Loader::Agent::CommonJS`` (用于服务人员界面）和 ``Loader::Customer::CommonJS`` （用于客户界面）中配置。

source: These settings are designed as hashes, so that OTRS extensions can add their own hash keys for additional content to be loaded. Let's look at an example:
hu: Ezek a beállítások kivonatokként vannak tervezve azért, hogy az OTRS kiterjesztések hozzáadhassák a saját kivonatkulcsaikat a további betöltendő tartalomhoz. Nézzünk egy példát:
zh_cn: 这些设置被设计为哈希值，因此OTRS扩展可以为要加载的其它内容添加自己的哈希键。 我们来看一个例子：

source: This is the list of JavaScript files which always need to be loaded for the agent interface of OTRS.
hu: Ez azon JavaScript fájlok listája, amelyeket mindig be kell tölteni az OTRS ügyintézői felületénél.
zh_cn: 这是始终需要为OTRS的服务人员界面加载的JavaScript文件列表。

source: To add new content which is supposed to be loaded always in the agent interface, just add an XML configuration file with another hash entry:
hu: Olyan új tartalom hozzáadásához, amelyet mindig be kellene tölteni az ügyintézői felületen, egyszerűen adjon hozzá egy XML beállítófájlt egy másik kivonatbejegyzéssel:
zh_cn: 要添加应该始终在服务人员界面中加载的新内容，只需添加带有另一个哈希条目的XML配置文件：

source: Simple, isn't it?
hu: Egyszerű, nemde?
zh_cn: 很简单，不是吗？

source: Module Specific JavaScript
hu: Modulspecifikus JavaScript
zh_cn: 特定于模块的JavaScript

source: Not all JavaScript is usable for all application modules of OTRS. Therefore it is possible to specify module specific JavaScript files. Whenever a certain module is used (such as ``AgentDashboard``), the module specific JavaScript for this module will also be loaded. The configuration is done in the front end module registration in the XML configurations. Again, an example:
hu: Nem minden JavaScript használható az OTRS összes alkalmazásmoduljánál. Ezért lehetséges modulspecifikus JavaScript fájlok megadása. Amikor egy bizonyos modult használnak (mint például ``AgentDashboard``), akkor ennek a modulnak a modulspecifikus JavaScript fájlja is be lesz töltve. A beállítás az XML beállításokban lévő előtétprogram-modul regisztrációban történik. Ismét egy példa:
zh_cn: 并非所有JavaScript都可用于OTRS的所有应用程序模块。 因此，可以指定特定于模块的JavaScript文件。 每当使用某个模块（例如 ``AgentDashboard``）时，也会加载该模块的模块特定JavaScript。 配置在XML配置中的前端模块注册中完成。 再举一个例子：

source: It is possible to put a ``<Item Key="JavaScript">`` tag in the front end module registrations which may contain ``<Array>`` and one tag ``<Item>`` for each JavaScript file that is supposed to be loaded for this application module.
hu: Lehetséges egy ``<Item Key="JavaScript">`` címke elhelyezése az előtétprogram-modul regisztrációkban, amely tartalmazhat ``<Array>`` tömböt és egy ``<Item>`` címkéket minden egyes JavaScript fájlhoz, amelyet be kellene tölteni ennél az alkalmazásmodulnál.
zh_cn: 可以在前端模块注册中放置一个 ``<Item Key="JavaScript">`` 标签，包含 ``<Array>`` 和为此应用程序模块加载的每个JavaScript文件一个 ``<Item>`` 标签 。

source: Now you have all information you need to configure the way the loader handles JavaScript code.
hu: Most már rendelkezik az összes olyan információval, amely annak a módszernek a beállításhoz szükséges, hogy a betöltő kezelje a JavaScript kódot.
zh_cn: 现在，您拥有配置加载器处理JavaScript代码的方式所需的所有信息。

source: Configuring the Loader: CSS
hu: A betöltő beállítása: CSS
zh_cn: 配置加载器：CSS

source: The loader handles CSS files very similar to JavaScript files, as described in the previous section, and extending the settings works in the same way too.
hu: A betöltő a CSS-fájlokat nagyon hasonlóan kezeli a JavaScript fájlokhoz, ahogy az előző szakaszban le van írva, és a beállítások kiterjesztése is ugyanolyan módon működik.
zh_cn: 加载器处理与JavaScript文件非常相似的CSS文件，如上一节所述，扩展设置也以相同的方式工作。

source: Common CSS
hu: Közös CSS
zh_cn: 共用CSS

source: The way common CSS is handled is very similar to the way :ref:`Common JavaScript` is loaded.
hu: Annak a módja, ahogy a közös CSS-t kezelik, nagyon hasonló a :ref:`Common JavaScript` betöltésének módjához.
zh_cn: 处理共用CSS的加载方式非常类似于 :ref:`Common JavaScript`。

source: Log Mechanism
hu: Naplózó mechanizmus
zh_cn: 日志机制

source: System Log
hu: Rendszernapló
zh_cn: 系统日志

source: OTRS comes with a system log back end that can be used for application logging and debugging.
hu: Az OTRS egy olyan rendszernaplózó háttérprogrammal érkezik, amely használható az alkalmazás naplózásánál és a hibakeresésnél.
zh_cn: OTRS带有一个系统日志后端，可用于应用程序日志记录和调试。

source: The ``Log`` object can be accessed and used via the object manager like this:
hu: A ``Log`` objektum az objektumkezelőn keresztül érhető el és használható ehhez hasonlóan:
zh_cn: 可以通过对象管理器访问和使用 ``Log`` 对象，如下所示：

source: Depending on the configured log level via ``MinimumLogLevel`` option in system configuration, logged message will either be saved or not, based on their ``Priority`` flag.
hu: A rendszerbeállításokban a ``MinimumLogLevel`` beállításon keresztül beállított naplózási szinttől függően a naplózott üzenetek a ``Priority`` jelzőjük alapján mentésre kerülnek vagy sem.
zh_cn: 根据系统配置中 ``MinimumLogLevel`` 选项配置的日志级别，记录的消息将根据其 ``Priority（优先级）`` 标志保存或不保存。

source: If ``error`` is set, just errors are logged. With ``debug``, you get all logging messages. The order of log levels is:
hu: Ha ``error`` van beállítva, akkor csak a hibák lesznek naplózva. A ``debug`` értékkel megkapja az összes naplózási üzenetet. A naplózási szintek sorrendje a következő:
zh_cn: 如果设置了 ``error``，则只记录错误。 使用 ``debug``，您可以获得所有日志消息。 日志级别的顺序是：

source: The output of the system log can be directed to either a syslog daemon or log file, depending on the configured ``LogModule`` option in system configuration.
hu: A rendszernapló kimenete a rendszerbeállításokban lévő ``LogModule`` beállításban megadottak alapján átirányítható egy rendszernaplózó démonba vagy naplófájlba.
zh_cn: 系统日志的输出可以定向到syslog守护进程或日志文件，具体取决于系统配置中配置的 ``LogModule`` 选项。

source: Communication Log
hu: Kommunikációs napló
zh_cn: 通信日志

source: In addition to system log, OTRS provides specialized logging back end for any communication related logging. The system comes with dedicated tables and front ends to track and display communication logs for easier debugging and operational overview.
hu: A rendszernapló mellett az OTRS különleges naplózó háttérprogramot biztosít az összes, a kommunikációra vonatkozó naplózáshoz. Az OTRS 6 óta a rendszer dedikált táblázatokkal és előtétprogramokkal érkezik a kommunikációs naplók követéséhez és megjelenítéséhez, hogy egyszerűbb legyen hibát keresni és a működést áttekinteni.
zh_cn: 除系统日志外，OTRS还为任何与通信相关的日志记录提供专门的日志记录后端。 该系统配有专用的表和前端，用于跟踪和显示通信日志，以便于调试和状态概览。

source: To take advantage of the new system, first create a non-singleton instance of communication log object:
hu: Az új rendszer előnyeinek kihasználásához először hozzon létre egy nem egyke példányt a kommunikációs napló objektumból:
zh_cn: 要利用新系统，首先要创建一个非单例的通信日志对象实例：

source: When you have a communication log object instance, you can start an object log for logging individual messages. There are two object logs currently implemented: ``Connection`` and ``Message``.
hu: Amikor megvan a kommunikációs napló objektum példánya, akkor elindíthat egy objektumnaplózást az egyéni üzenetek naplózásához. Jelenleg két objektumnapló van megvalósítva: ``Connection`` és ``Message``.
zh_cn: 拥有通信日志对象实例时，可以启动对象日志以记录单个消息。 目前有两个对象日志：``Connection`` 和 ``Message``。

source: ``Connection`` object log should be used for logging any connection related messages (for example: authenticating on server or retrieving incoming messages).
hu: A ``Connection`` objektumnaplót kell használni minden, a kommunikációra vonatkozó üzenet naplózásához (például hitelesítés egy kiszolgálón vagy bejövő üzenetek fogadása).
zh_cn: ``Connection`` 对象日志应该用于记录任何与连接相关的消息（例如：在服务器上进行身份验证或检索传入消息）。

source: Simply, start the object log by declaring its type, and you can use it immediately:
hu: Egyszerűen indítsa el az objektumnaplót a típusának meghatározásával, és már azonnal használhatja:
zh_cn: 简单地说，通过声明其类型来启动对象日志，您可以立即使用它：

source: The communication log object instance handles the current started object logs, so you don't need to remember and bring them around everywhere, but it also means that you can only start one object per type.
hu: A kommunikációs napló objektum példánya kezeli a jelenleg elindított objektumnaplókat, így nem kell megjegyeznie és előhoznia mindenhol, de ez azt is jelenti, hogy csak egyetlen objektumot indíthat típusonként.
zh_cn: 通信日志对象实例处理当前启动的对象日志，因此您无需记住并随处携带它们，但这也意味着您只能为每种类型启动一个对象。

source: If you encounter an unrecoverable error, you can choose to close the object log and mark it as failed:
hu: Ha javíthatatlan hibával találkozik, akkor választhatja az objektumnapló bezárását és sikertelenként való megjelölését:
zh_cn: 如果遇到不可恢复的错误，可以选择关闭对象日志并将其标记为失败：

source: In turn, you can mark the communication log as failure as well:
hu: Viszont megjelölheti a kommunikációs naplót sikertelennek is:
zh_cn: 接下来，同样将通信日志标记为失败：

source: Otherwise, stop the object log and in turn communication log as success:
hu: Egyébként állítsa le az objektumnaplót és jelölje a kommunikációs naplót sikeresként:
zh_cn: 否则，请停止对象日志，然后将通信日志视为成功：

source: ``Message`` object log should be used for any log entries regarding specific messages and their processing. It is used in a similar way, just make sure to start it before using it:
hu: A ``Message`` objektumnaplót kell használni minden olyan naplóbejegyzésnél, amelyek bizonyos üzenetek és azok feldolgozását érintik. Hasonló módon használható, egyszerűen győződjön meg arról, hogy elindította-e a használta előtt:
zh_cn: ``Message`` 对象日志应该用于任何有关特定消息及其处理的日志条目。 它以类似的方式使用，只需确保在使用它之前启动它：

source: You also have the possibility to link the log object and later lookup the communications for a certain object type and ID:
hu: Lehetősége van hivatkozni a naplóobjektumra és később megkeresni a kommunikációkat egy bizonyos objektumtípus vagy azonosító esetén:
zh_cn: 您还可以链接日志对象，然后查找特定对象类型和ID的通信：

source: You should make sure to always stop communication and flag it as failed, if any log object failed as well. This will allow administrators to see failed communications in the overview, and take any action if needed.
hu: Meg kell győződnie arról, hogy mindig leállította-e a kommunikációt és megjelölte-e sikertelenként, ha valamelyik naplóobjektum sikertelen lenne. Ez lehetővé fogja tenni az adminisztrátorok számára, hogy megtekintsék a sikertelen kommunikációkat az áttekintőben, és megtegyék a szükséges lépéseket.
zh_cn: 如果任何日志对象都失败，您应该确保始终停止通信并将其标记为失败。 这将允许管理员在概览中查看失败的通信，并在需要时执行任何操作。

source: It's important to preserve the communication log for duration of a single process. If your work is spanning over multiple modules and any of them can benefit from logging, make sure to pass the existing communication log instance around so all methods can use the same one. With this approach, you will make sure any log entries spawned for the same process are contained in a single communication.
hu: Fontos megőrizni a kommunikációs naplót egyetlen folyamat időtartamára. Ha munkája több modult is érint, és bármelyikük kihasználhatja a naplózás előnyeit, akkor győződjön meg arról, hogy átadta-e a létező kommunikációs napló példányát, így az összes metódus ugyanazt tudja használni. Ezzel a megközelítéssel biztosíthatja, hogy az azonos folyamathoz tartozó naplóbejegyzések egyetlen kommunikációban legyenek tárolva.
zh_cn: 在单个进程的持续时间内保留通信日志非常重要。 如果您的工作跨越多个模块，并且其中任何一个都可以从日志记录中受益，请确保传递现有的通信日志实例，以便所有方法都可以使用相同的模块。 使用此方法，您将确保为同一进程生成的任何日志条目都包含在单个通信中。

source: If passing the communication log instance is not an option (async tasks!), you can also choose to recreate the communication log object in the same state as in previous step. Just get the communication ID and pass it to the new code, and then create the instance with this parameter supplied:
hu: Ha a kommunikációs napló példányának átadása nem lehetséges (aszinkron feladatok!), akkor választhatja a kommunikációs napló objektum újra létrehozását ugyanabban az állapotban, amiben az előző lépésben volt. Egyszerűen fogja a kommunikációs azonosítót, és adja át az új kódnak, majd hozza létre az új példányt ezzel a megadott paraméterrel:
zh_cn: 如果无法传递通信日志实例（异步任务！），您还可以选择以与上一步相同的状态重新创建通信日志对象。 只需获取通信ID并将其传递给新代码，然后使用提供的此参数创建实例：

source: You can then continue to use this instance as previously stated, start any object logs if needed, adding entries and setting status in the end.
hu: Ezután folytathatja ennek a példánynak a használatát, amint azt korábban említettük. Indítson el valamilyen objektumnaplót, ha szükséges, adjon hozzá bejegyzéseket és állítsa be az állapotot a végén.
zh_cn: 然后，您可以继续使用此实例，如前所述，根据需要启动任何对象日志，最后添加条目和设置状态。

source: If you need to retrieve the communication log data or do something else with it, please also take a look at ``Kernel::System::CommunicationLog::DB.pm``.
hu: Ha a kommunikációs napló adatainak lekérésére van szüksége vagy valami mást szeretne csinálni vele, akkor vessen egy pillantást a ``Kernel::System::CommunicationLog::DB.pm`` fájlra.
zh_cn: 如果您需要检索通信日志数据或使用它做其它事情，请同时查看 ``Kernel::System::CommunicationLog::DB.pm``。

source: Skins
hu: Felszínek
zh_cn: 皮肤

source: The visual appearance of OTRS is controlled by *skins*.
hu: Az OTRS látható megjelenése *felszínekkel* szabályozható.
zh_cn: OTRS的视觉外观由 *皮肤* 控制。

source: A skin is a set of CSS and image files, which together control how the GUI is presented to the user. Skins do not change the HTML content that is generated by OTRS (this is what *themes* do), but they control how it is displayed. With the help of modern CSS standards it is possible to change the display thoroughly (e.g. repositioning parts of dialogs, hiding elements, etc.).
hu: Egy felszín CSS-fájlok és képfájlok halmaza, amelyek együtt azt vezérlik, hogy a grafikus felhasználói felület hogyan jelenjen meg a felhasználónak. A felszínek nem változtatják meg az OTRS által előállított HTML tartalmát (ez az, amit a *témák* csinálnak), hanem azt szabályozzák, hogy az hogyan jelenjen meg. A modern CSS szabványok segítségével lehetőség van a megjelenítés teljes megváltoztatására (például pérbeszédablakok egyes részeinek áthelyezésére, elemek elrejtésére, stb.).
zh_cn: 一个皮肤是一组CSS和图像文件，它们共同控制GUI呈现给用户的方式。 皮肤不会更改由OTRS生成的HTML内容（这是 *主题* 所做的），但它们控制着它的显示方式。 在现代CSS标准的帮助下，可以彻底改变显示（例如，重新定位对话框的各部分、隐藏元素等）。

source: Skin Basics
hu: Felszín alapok
zh_cn: 皮肤基础

source: All skins are in ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/$SKIN_NAME``.
hu: Az összes felszín az ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/$SKIN_NAME`` mappában van.
zh_cn: 所有皮肤都在 ``$OTRS_HOME/var/httpd/htdocs/skins/Agent/$SKIN_NAME`` 中。

source: Each of the agents can select individually, which of the installed agent skins they want to *wear*.
hu: Az ügyintézők mindegyike egyénileg választhatja ki, hogy melyik telepített ügyintézői felszínt szeretnék *viselni*.
zh_cn: 每个服务人员可以单独选择 *穿着* 哪一款已安装的服务人员皮肤。

source: Skin support for customer interface was dropped with the new external interface. To create customized layout for external interface, use the *Layout* module of the admin interface.
hu: A felszíntámogatás az ügyfélfelületnél el lett dobva az új külső felülettel. A külső felület személyre szabott elrendezésének létrehozásához használja az adminisztrációs területen lévő *Megjelenés* modult.
zh_cn: 使用新的外部人员界面删除了客户界面的皮肤支持。 要为外部人员界面创建自定义布局，请使用管理员界面的 *排版布局* 模块。

source: How Skins Are Loaded
hu: Hogyan töltődnek be a felszínek
zh_cn: 如何加载皮肤

source: It is important to note that the ``default`` skin will **always** be loaded **first**. If the agent selected another skin than the default one, the other one will be loaded only **after** the default skin. By loading here we mean that OTRS will put tags into the HTML content which cause the CSS files to be loaded by the browser. Let's see an example of this:
hu: Fontos megjegyezni, hogy **mindig** a ``default`` felszín fog **először** betöltődni. Ha az ügyintéző egy másik felszínt választott az „alapértelmezett” helyett, akkor a másik felszín csak az alapértelmezett felszín **után** lesz betöltve. A betöltésen itt azt értjük, hogy az OTRS olyan címkéket fog elhelyezni a HTML tartalmában, amelyek a CSS-fájlok betöltését idézik elő a böngészőnél. Nézzünk egy példát erre:
zh_cn: 重要的是要注意，``default`` 皮肤将 **始终** **首先加载**。 如果服务人员选择了默认皮肤之外的另一个皮肤，则它将仅在默认皮肤 **之后** 加载。 在这里的加载，我们的意思是OTRS会将标记放入HTML内容中，这会导致浏览器加载CSS文件。 让我们看一个这样的例子：

source: Here it can clearly be seen that the ``default`` skin is loaded first, and then the custom skin specified by the agent. In this example, we see the result of the activated loader (``Loader::Enabled`` set to 1), which gathers all CSS files, concatenates and minifies them and serves them as one chunk to the browser. This saves bandwidth and also reduces the number of HTTP requests. Let's see the same example with the loader turned off:
hu: Itt tisztán látható, hogy a ``default`` felszín töltődik be először, majd ezután az ügyintéző által megadott egyéni felszín. Ebben a példában a bekapcsolt betöltő (a ``Loader::Enabled`` 1-re állítva) eredményét látjuk, amely begyűjti az összes CSS-fájlt, összefűzi és minimalizálja azokat, majd egyetlen nagy egységként szolgálja ki a böngészőnek. Ezzel sávszélességet spórol, és csökkenti a HTTP-kérések számát is. Nézzük meg ugyanezt a példát kikapcsolt betöltővel:
zh_cn: 在这里可以清楚地看到，首先加载 ``default`` 皮肤，然后加载服务人员指定的自定义皮肤。 在这个例子中，我们看到激活的加载器的结果（``Loader::Enabled`` 设置为1），它收集所有CSS文件，连接并缩小它们并将它们作为浏览器的一个块提供。 这样可以节省带宽并减少HTTP请求的数量。 让我们看一下关闭加载器的相同示例：

source: Here we can better see the individual files that come from the skins.
hu: Itt jobban láthatjuk az egyes fájlokat, amelyek a felszínekből jönnek.
zh_cn: 在这里，我们可以更好地查看来自皮肤的各个文件。

source: There are different types of CSS files: common files which must always be loaded, and module-specific files which are only loaded for special modules within the OTRS framework.
hu: Különböző típusú CSS-fájlok vannak: közös fájlok, amelyeket mindig be kell tölteni, és modul specifikus fájlok, amelyek csak az OTRS keretrendszeren belüli speciális moduloknál vannak betöltve.
zh_cn: 有不同类型的CSS文件：必须始终加载的公用文件，以及仅为OTRS框架内的特殊模块加载的特定于模块的文件。

source: In addition, it is possible to specify CSS files which only must be loaded on IE7 or IE8 (in the case of the customer interface, also IE6). This is unfortunate, but it was not possible to develop a modern GUI on these browsers without having special CSS for them.
hu: Továbbá lehetséges olyan CSS-fájlok megadása, amelyeket csak IE7 vagy IE8 böngészőknél kell betölteni (az ügyfélfelület esetén IE6 böngészőnél is). Ez szerencsétlen ugyan, de ezeknél a böngészőknél nem volt lehetséges egy modern grafikus felhasználói felület kifejlesztése a hozzájuk elkészített speciális CSS nélkül.
zh_cn: 此外，可以指定只能在IE7或IE8上加载的CSS文件（在客户界面的情况下，还有IE6）。 这是不幸的，但是在这些浏览器上开发现代GUI没有特殊的CSS是不可能的。

source: For details regarding the CSS file types, please see the :doc:`loader` section.
hu: A CSS-fájltípusokra vonatkozó részletekért nézze meg a :doc:`loader` szakaszt.
zh_cn: 有关CSS文件类型的详细信息，请参阅 :doc:`loader` 部分。
