Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: External links consist of a visible text and an URL in form *\`visible text <https://example.com>\`__*. The *visible text* should be translated.
hu: A külső hivatkozások egy látható szövegből és egy URL-ből állnak *\`látható szöveg <https://example.com>\`__* formában. A *látható szöveget* le kell fordítani.
zh_cn: 外部链接由可见文本和表单中的URL按 *\`visible text <https://example.com>\`__* 格式组成。 应翻译 *visible text*。

source: Getting Started
hu: Kezdeti lépések
zh_cn: 入门

source: OTRS is a multi-platform web application framework which was originally developed for a trouble ticket system. It supports different web servers and databases.
hu: Az OTRS egy többplatformos webes alkalmazás-keretrendszer, amelyet eredetileg hibajegyrendszernek fejlesztettek. Különböző webkiszolgálókat és adatbázisokat támogat.
zh_cn: OTRS是一个多平台的Web应用程序框架，最初是为故障单系统开发的。 它支持不同的Web服务器和数据库。

source: This manual shows how to develop your own OTRS modules and applications based on the OTRS styleguides.
hu: Ez a kézikönyv azt mutatja be, hogy hogyan fejleszthet saját OTRS modulokat és alkalmazásokat az OTRS stílus útmutatók alapján.
zh_cn: 本手册介绍了如何基于OTRS样式指南开发自己的OTRS模块和应用程序。

source: Architecture Overview
hu: Szerkezeti áttekintés
zh_cn: 架构概述

source: The OTRS framework is modular. The following picture shows the basic layer architecture of OTRS.
hu: Az OTRS keretrendszer moduláris. A következő kép az OTRS alapvető rétegszerkezetét jeleníti meg.
zh_cn: OTRS框架是模块化的。 下图显示了OTRS的基本层架构。

source: OTRS Architecture
hu: Az OTRS szerkezete
zh_cn: OTRS架构

source: The OTRS Generic Interface continues OTRS modularity. The next picture shows the basic layer architecture of the Generic Interface.
hu: Az OTRS általános felület folytatja az OTRS modularitását. A következő kép az általános felület alapvető rétegszerkezetét jeleníti meg.
zh_cn: OTRS通用接口继续OTRS模块化。 下图显示了通用接口的基本层架构。

source: Generic Interface Architecture
hu: Az általános felület szerkezete
zh_cn: 通用接口架构

source: Directories
hu: Könyvtárak
zh_cn: 目录

source: Directory
hu: Könyvtár
zh_cn: 目录

source: Description
hu: Leírás
zh_cn: 描述

source: command line tools
hu: parancssori eszközök
zh_cn: 命令行工具

source: web handle
hu: webes kezelő

source: fast CGI web handle
hu: fast CGI webes kezelő
zh_cn: 快速的CGI Web句柄

source: application code base
hu: alkalmazás kódbázisa
zh_cn: 应用程序代码库

source: configuration files
hu: beállítófájlok
zh_cn: 配置文件

source: the Generic Interface API
hu: az általános felület API-ja
zh_cn: 通用接口API

source: invoker modules for Generic Interface
hu: meghívó modulok az általános felülethez
zh_cn: 通用接口的调用程序模块

source: mapping modules for Generic Interface, e.g. Simple
hu: leképező modulok az általános felülethez, például: Simple
zh_cn: 用于通用接口的映射模块，例如Simple

source: operation modules for Generic Interface
hu: műveleti modulok az általános felülethez
zh_cn: 通用接口的操作模块

source: transport modules for Generic Interface, e.g. "HTTP SOAP"
hu: átviteli modulok az általános felülethez, például: „HTTP SOAP”
zh_cn: 通用接口的传输模块，例如 "HTTP SOAP"

source: language translation files
hu: nyelvi fordítási fájlok
zh_cn: 语言翻译文件

source: Scheduler files
hu: az ütemező fájljai
zh_cn: 调度程序文件

source: handler modules for scheduler tasks, e.g. GenericInterface
hu: kezelőmodulok az ütemező feladatokhoz, például: GenericInterface
zh_cn: 调度程序任务的处理程序模块，例如GenericInterface

source: core modules, e.g. Log, Ticket
hu: alapmodulok, például: Log, Ticket
zh_cn: 核心模块，例如日志、工单

source: front end modules, e.g. QueueView
hu: előtétprogram-modulok, például: QueueView
zh_cn: 前端模块，例如QueueView

source: html templates
hu: HTML sablonok
zh_cn: HTML模板

source: variable data
hu: változó adatok
zh_cn: 可变的数据

source: logfiles
hu: naplófájlok
zh_cn: 日志文件

source: cron files
hu: cron fájlok
zh_cn: cron 文件

source: htdocs directory with index.html
hu: htdocs könyvtár az index.html fájllal
zh_cn: 带有index.html的htdocs目录

source: available skins for the Agent interface
hu: az ügyintéző felületéhez elérhető felszínek
zh_cn: 服务人员界面的可用皮肤

source: available skins for the Customer interface
hu: az ügyfélfelülethez elérhető felszínek
zh_cn: 客户界面的可用皮肤

source: JavaScript files
hu: JavaScript fájlok
zh_cn: JavaScript 文件

source: misc files
hu: egyéb fájlok
zh_cn: 杂项文件

source: unit test files
hu: egységteszt fájlok
zh_cn: 单元测试文件

source: unit test sample data files
hu: egységteszt példaadat fájlok
zh_cn: 单元测试样本数据文件

source: Files
hu: Fájlok
zh_cn: 文件

source: .pm = Perl Module
hu: .pm = Perl-modul
zh_cn: .pm = Perl 模块

source: .tt = Template::Toolkit template files
hu: .tt = Template::Toolkit sablonfájlok
zh_cn: .tt = Template::Toolkit模板文件

source: .dist = Default templates of files
hu: .dist = Fájlok alapértelmezett sablonjai
zh_cn: .dist =文件的默认模板

source: .yaml or .yml = YAML files, used for Web Service configuration
hu: .yaml vagy .yml = A webszolgáltatás beállításaihoz használt YAML-fájlok
zh_cn: .yaml or .yml = YAML文件，用于Web服务配置

source: Core Modules
hu: Alapmodulok
zh_cn: 核心模块

source: Core modules are located under ``$OTRS_HOME/Kernel/System/*``. This layer is for the logical work. Core modules are used to handle system routines like *lock ticket* and *create ticket*. A few main core modules are:
hu: Az alapmodulok az ``$OTRS_HOME/Kernel/System/*`` alatt találhatók. Ez a réteg a logikai munkához van. Az alapmodulok a rendszer rutinjai kezeléséhez használhatók, mint például *jegy zárolása* és *jegy létrehozása*. Néhány fő alapmodul a következő:
zh_cn: 核心模块位于 ``$OTRS_HOME/Kernel/System/*`` 下。 该层用于逻辑工作。 核心模块用于处理系统例程，如 *锁定工单* 和 *创建工单*。 一些主要的核心模块是：

source: ``Kernel::System::Config`` to access configuration options.
hu: ``Kernel::System::Config`` a beállítási lehetőségek eléréséhez.
zh_cn: ``Kernel::System::Config`` 用于访问配置选项。

source: ``Kernel::System::Log`` to log into OTRS log back end.
hu: ``Kernel::System::Log`` a naplózáshoz az OTRS naplózó háttérprogramjába.
zh_cn: ``Kernel::System::Log`` 用于记录到OTRS日志后端。

source: ``Kernel::System::DB`` to access the database back end.
hu: ``Kernel::System::DB`` az adatbázis háttérprogram eléréséhez.
zh_cn: ``Kernel::System::DB`` 用于访问数据库后端。

source: ``Kernel::System::Auth`` to check user authentication.
hu: ``Kernel::System::Auth`` a felhasználói hitelesítés ellenőrzéséhez.
zh_cn: ``Kernel::System::Auth`` 用于检查用户认证。

source: ``Kernel::System::User`` to manage users.
hu: ``Kernel::System::User`` a felhasználók kezeléséhez.
zh_cn: ``Kernel::System::User`` 用于管理用户。

source: ``Kernel::System::Group`` to manage groups.
hu: ``Kernel::System::Group`` a csoportok kezeléséhez.
zh_cn: ``Kernel::System::Group`` 用于管理组。

source: ``Kernel::System::Email`` for sending emails.
hu: ``Kernel::System::Email`` az e-mailek küldéséhez.
zh_cn: ``Kernel::System::Email`` 用于发送电子邮件。

source: For more information see the `Documentation Portal <https://doc.otrs.com/doc/>`__.
hu: További információkért nézze meg a `dokumentációs portált <https://doc.otrs.com/doc/>`__.
zh_cn: 有关更多信息，请访问 `文档门户网站 <https://doc.otrs.com/doc/>`__。

source: Front End Handle
hu: Előtétprogram kezelés
zh_cn: 前端句柄

source: The interface between the browser, web server and the front end modules. A front end module can be used via the HTTP link.
hu: A böngésző, a webkiszolgáló és az előtétprogram-modulok közti felület. Egy előtétprogram-modul használható HTTP-hivatkozáson keresztül.
zh_cn: 浏览器、Web服务器和前端模块之间的接口。 可以通过HTTP链接使用前端模块。

source: Front End Modules
hu: Előtétprogram-modulok
zh_cn: 前端模块

source: Front end modules are located under ``$OTRS_HOME/Kernel/Modules/*.pm``. There are two public functions in there - ``new()`` and ``run()`` - which are accessed from the front end handle (e.g. ``index.pl``).
hu: Az előtétprogram-modulok az ``$OTRS_HOME/Kernel/Modules/*.pm`` alatt találhatók. Két nyilvános függvény van ebben - ``new()`` és ``run()`` - amelyek az előtétprogram kezelésből érhetők el (például ``index.pl``).
zh_cn: 前端模块位于 ``$OTRS_HOME/Kernel/Modules/*.pm`` 下。 那里有两个公共函数 - ``new()`` 和 ``run()``- 可以从前端句柄访问（例如 ``index.pl``）。

source: ``new()`` is used to create a front end module object. The front end handle provides the used front end module with the basic framework objects. These are, for example:
hu: A ``new()`` előtétprogram-modul objektumok létrehozásához használható. Az előtétprogram kezelés biztosítja a használt előtétprogram-modulokat az alapvető keretrendszer objektumokkal. Ezek például a következők:
zh_cn: ``new()`` 用于创建前端模块对象。 前端句柄为使用过的前端模块提供基本框架对象。 这些对象是以下示例：

source: ``ParamObject`` to get web form params.
hu: ``ParamObject`` a webes űrlapparaméterek lekéréséhez.
zh_cn: ``ParamObject`` 用于获取WEB表单参数。

source: ``DBObject`` to use existing database connections.
hu: ``DBObject`` a meglévő adatbázis-kapcsolatok használatához.
zh_cn: ``DBObject`` 用于使用现有的数据库连接。

source: ``LayoutObject`` to use templates and other HTML layout functions.
hu: ``LayoutObject`` a sablonok és egyéb HTML elrendezés függvények használatához.
zh_cn: ``LayoutObject`` 用于使用模板和其它的HTML布局函数。

source: ``ConfigObject`` to access config settings.
hu: ``ConfigObject`` a konfigurációs beállítások hozzáféréséhez.
zh_cn: ``ConfigObject`` 用于访问配置设置。

source: ``LogObject`` to use the framework log system.
hu: ``LogObject`` a keretrendszer naplózó rendszerének használatához.
zh_cn: ``LogObject`` 用于使用框架日志系统。

source: ``UserObject`` to get the user functions from the current user.
hu: ``UserObject`` a felhasználói függvények lekéréséhez a jelenlegi felhasználótól.
zh_cn: ``UserObject`` 用于获取当前用户的用户函数。

source: ``GroupObject`` to get the group functions.
hu: ``GroupObject`` a csoportfüggvények lekéréséhez.
zh_cn: ``GroupObject`` 用于获取组函数。

source: CMD Front End
hu: Parancssori előtétprogram
zh_cn: CMD前端

source: The CMD (command line) front end is like the web front end handle and the web front end module in one (just without the ``LayoutObject``) and uses the core modules for some actions in the system.
hu: A CMD (parancssori) előtétprogram a webes előtétprogram kezeléshez és a webes előtétprogram-modulokhoz együtt hasonló (csak a ``LayoutObject`` nélkül), és az alapmodulokat használja néhány műveletnél a rendszeren.
zh_cn: CMD（命令行）前端就像Web前端句柄和Web前端模块一样（只是没有 ``LayoutObject``），使用核心模块进行系统中的某些操作。

source: Generic Interface Modules
hu: Általános felület modulok
zh_cn: 通用接口模块

source: Generic interface modules are located under ``$OTRS_HOME/Kernel/GenericInterface/*``. Generic interface modules are used to handle each part of a web service execution on the system. The main modules for the generic interface are:
hu: Az általános felület modulok az ``$OTRS_HOME/Kernel/GenericInterface/*`` alatt találhatók. Az általános felület modulok egy webszolgáltatás végrehajtásának egyes részei kezeléséhez használhatók a rendszeren. Az általános felület fő moduljai a következők:
zh_cn: 通用接口模块位于 ``$OTRS_HOME/Kernel/GenericInterface/*`` 下。 通用接口模块用于处理系统上Web服务执行的每个部分。 通用接口的主要模块是：

source: ``Kernel::GenericInterface::Transport`` to interact with remote systems.
hu: ``Kernel::GenericInterface::Transport`` a kölcsönhatásba lépéshez távoli rendszerekkel.
zh_cn: ``Kernel::GenericInterface::Transport`` 用于与远程系统交互。

source: ``Kernel::GenericInterface::Mapping`` to transform data into a required format.
hu: ``Kernel::GenericInterface::Mapping`` az adatok átalakításához egy szükséges formátumba.
zh_cn: ``Kernel::GenericInterface::Mapping`` 用于将数据转换为所需格式。

source: ``Kernel::GenericInterface::Requester`` to use OTRS as a client for the web service.
hu: ``Kernel::GenericInterface::Requester`` az OTRS kliensként való használatához a webszolgáltatásnál.
zh_cn: ``Kernel::GenericInterface::Requester`` 用于将OTRS作为Web服务的客户端。

source: ``Kernel::GenericInterface::Provider`` to use OTRS as a server for web service.
hu: ``Kernel::GenericInterface::Provider`` az OTRS kiszolgálóként való használatához a webszolgáltatásnál.
zh_cn: ``Kernel::GenericInterface::Provider`` 用于将OTRS作为Web服务的服务器端。

source: ``Kernel::GenericInterface::Operation`` to execute provider actions.
hu: ``Kernel::GenericInterface::Operation`` a szolgáltató műveletek végrehajtásához.
zh_cn: ``Kernel::GenericInterface::Operation`` 用于执行提供者操作。

source: ``Kernel::GenericInterface::Invoker`` to execute requester actions.
hu: ``Kernel::GenericInterface::Invoker`` a kérelmező műveletek végrehajtásához.
zh_cn: ``Kernel::GenericInterface::Invoker`` 用于执行请求者操作。

source: ``Kernel::GenericInterface::Debugger`` to track web service communication, using log entries.
hu: ``Kernel::GenericInterface::Debugger`` a webszolgáltatás kommunikációjának követéséhez naplóbejegyzések használatával.
zh_cn: ``Kernel::GenericInterface::Debugger`` 使用日志条目跟踪Web服务通信。

source: Generic Interface Invoker Modules
hu: Általános felület meghívó modulok
zh_cn: 通用接口调用程序模块

source: Generic interface invoker modules are located under ``$OTRS_HOME/Kernel/GenericInterface/Invoker/*``. Each invoker is contained in a folder called ``Controller``. This approach helps to define a name space not only for internal classes and methods but for filenames too. For example: ``$OTRS_HOME/Kernel/GenericInterface/Invoker/Test/`` is the controller for all test type invokers.
hu: Az általános felület meghívó modulok az ``$OTRS_HOME/Kernel/GenericInterface/Invoker/*`` alatt találhatók. Minden egyes meghívót egy ``Controller`` elnevezésű mappa tartalmaz. Ez a megközelítés nem csak a belső osztályoknak és metódusoknak segít egy névteret meghatározni, hanem a fájlneveknek is. Például az ``$OTRS_HOME/Kernel/GenericInterface/Invoker/Test/`` az összes teszt típusú meghívó vezérlője.
zh_cn: 通用接口调用程序模块位于 ``$OTRS_HOME/Kernel/GenericInterface/Invoker/*`` 下。每个调用程序都包含在一个名为 ``Controller`` 的文件夹中。此方法不仅有助于为内部类和方法定义名称空间，而且还有助于为文件名定义名称空间。例如：``$OTRS_HOME/Kernel/GenericInterface/Invoker/Test/`` 是所有测试类型调用程序的控制器。

source: Generic interface invoker modules are used as a back end to create requests for remote systems to execute actions.
hu: Az általános felület meghívó modulok háttérprogramként használhatók kérések létrehozásához a távoli rendszereknél műveletek végrehajtásához.
zh_cn: 通用接口调用程序模块用作后端，以创建远程系统执行操作的请求。

source: Generic Interface Mapping Modules
hu: Általános felület leképező modulok
zh_cn: 通用接口映射模块

source: Generic interface mapping modules are located under ``$OTRS_HOME/Kernel/GenericInterface/Mapping/*``. These modules are used to transform data (keys and values) from one format to another.
hu: Az általános felület leképező modulok az ``$OTRS_HOME/Kernel/GenericInterface/Mapping/*`` alatt találhatók. Ezek a modulok adatok (kulcsok és értékek) átalakításához használhatók az egyik formátumról egy másikra.
zh_cn: 通用接口映射模块位于 ``$OTRS_HOME/Kernel/GenericInterface/Mapping/*`` 下。 这些模块用于将数据（键和值）从一种格式转换为另一种格式。

source: Generic Interface Operation Modules
hu: Általános felület műveleti modulok
zh_cn: 通用接口操作模块

source: Generic interface operation modules are located under ``$OTRS_HOME/Kernel/GenericInterface/Operation/*``. Each operation is contained in a folder called ``Controller``. This approach help to define a name space not only for internal classes and methods but for filenames too. For example: ``$OTRS_HOME/Kernel/GenericInterface/Operation/Ticket/`` is the controller for all ticket type operations.
hu: Az általános felület műveleti modulok az ``$OTRS_HOME/Kernel/GenericInterface/Operation/*`` alatt találhatók. Minden egyes műveletet egy ``Controller`` elnevezésű mappa tartalmaz. Ez a megközelítés nem csak a belső osztályoknak és metódusoknak segít egy névteret meghatározni, hanem a fájlneveknek is. Például az ``$OTRS_HOME/Kernel/GenericInterface/Operation/Ticket/`` az összes jegy típusú művelet vezérlője.
zh_cn: 通用接口操作模块位于 ``$OTRS_HOME/Kernel/GenericInterface/Operation/*`` 下。 每个操作都包含在一个名为 ``Controller`` 的文件夹中。 此方法不仅可以为内部类和方法定义名称空间，还可以为文件名定义名称空间。 例如： ``$OTRS_HOME/Kernel/GenericInterface/Operation/Ticket/`` 是所有工单类型操作的控制器。

source: Generic interface operation modules are used as a back end to perform actions requested by a remote system.
hu: Az általános felület műveleti modulok háttérprogramként használhatók egy távoli rendszer által kért műveletek végrehajtásához.
zh_cn: 通用接口操作模块用作后端以执行远程系统请求的动作。

source: Generic Interface Transport Modules
hu: Általános felület átviteli modulok
zh_cn: 通用接口传输模块

source: Generic interface network transport modules are located under ``$OTRS_HOME/Kernel/GenericInterface/Transport/*``. Each transport module should be placed in a directory named as the network protocol used. For example: The HTTP SOAP transport module, located in ``$OTRS_HOME/Kernel/GenericInterface/Transport/HTTP/SOAP.pm``.
hu: Az általános felület átviteli modulok az ``$OTRS_HOME/Kernel/GenericInterface/Transport/*`` alatt találhatók. Minden egyes átviteli modult egy olyan elnevezésű könyvtárba kell elhelyezni, ahogy a használt hálózati protokollt hívják. Például a „HTTP SOAP” átviteli modul a ``$OTRS_HOME/Kernel/GenericInterface/Transport/HTTP/SOAP.pm`` fájlban található.
zh_cn: 通用接口网络传输模块位于 ``$OTRS_HOME/Kernel/GenericInterface/Transport/*`` 下。 应将每个传输模块放在名为所用网络协议的目录中。 例如：HTTP SOAP传输模块，位于 ``$OTRS_HOME/Kernel/GenericInterface/Transport/HTTP/SOAP.pm`` 中。

source: Generic interface transport modules are used send data to, and receive data from a remote system.
hu: Az általános felület átviteli modulok adatok küldéséhez használhatók egy távoli rendszer számára, valamint adatok fogadásához tőle.
zh_cn: 通用接口传输模块用于向远程系统发送数据和从远程系统接收数据。

source: Scheduler Task Handler Modules
hu: Ütemező feladatkezelő modulok
zh_cn: 调度程序任务处理程序模块

source: Scheduler task handler modules are located under ``$OTRS_HOME/Kernel/Scheduler/TaskHandler/*``. These modules are used to perform asynchronous tasks. For example, the ``GenericInterface`` task handler perform generic interface requests to remote systems outside the Apache process. This helps the system to be more responsive, preventing possible performance issues.
hu: Az ütemező feladatkezelő modulok az ``$OTRS_HOME/Kernel/Scheduler/TaskHandler/*`` alatt találhatók. Ezek a modulok aszinkron feladatok végrehajtásához használhatók. Például a ``GenericInterface`` feladatkezelő általános felület kéréseket hajt végre a távoli rendszerekhez az Apache folyamaton kívül. Ez abban segíti a rendszert, hogy fogékonyabb legyen, megelőzve a lehetséges teljesítményproblémákat.
zh_cn: 调度程序任务处理程序模块位于 ``$OTRS_HOME/Kernel/Scheduler/TaskHandler/*`` 下。 这些模块用于执行异步任务。 例如，``GenericInterface`` 任务处理程序对Apache进程外的远程系统执行通用接口请求。 这有助于系统提高响应速度，防止出现可能的性能问题。

source: Database
hu: Adatbázis
zh_cn: 数据库

source: The database interface supports different databases.
hu: Az adatbázis-felület különböző adatbázisokat támogat.
zh_cn: 数据库接口支持不同的数据库。

source: For the OTRS data model please refer to the files in your ``/doc`` directory. Alternatively you can look at the data model on `GitHub <https://github.com/OTRS/otrs/blob/rel-6_0/development/diagrams/Database/OTRSDatabaseDiagram.png>`__.
hu: Az OTRS adatmodelljéhez nézze meg a ``/doc`` könyvtárban lévő fájlokat. Alternatívaként megnézheti az adatmodellt a `GitHubon <https://github.com/OTRS/otrs/blob/rel-6_0/development/diagrams/Database/OTRSDatabaseDiagram.png>`__ is.
zh_cn: 对于OTRS数据模型，请参阅 ``/doc`` 目录中的文件。 或者，您可以在 `GitHub <https://github.com/OTRS/otrs/blob/rel-6_0/development/diagrams/Database/OTRSDatabaseDiagram.png>`__ 上查看数据模型。

source: Development Environment
hu: Fejlesztői környezet
zh_cn: 开发环境

source: To facilitate the writing of OTRS expansion modules, the creation of a development environment is necessary. The source code of OTRS and additional public modules can be found on `GitHub <http://otrs.github.io>`__.
hu: Az OTRS bővítőmodulok írásának megkönnyítéséhez egy fejlesztői környezet létrehozása szükséges. Az OTRS és a további nyilvános modulok forráskódja megtalálható a `GitHubon <http://otrs.github.io>`__.
zh_cn: 为了便于编写OTRS扩展模块，必须创建开发环境。 可以在 `GitHub <http://otrs.github.io>`__ 上找到OTRS和其它公共模块的源代码。

source: Framework checkout
hu: A keretrendszer letöltése
zh_cn: 检出框架

source: First of all a directory must be created in which the modules can be stored. Then switch to the new directory using the command line and check them out by using the following command:
hu: Először is létre kell hozni egy könyvtárat, amelyben eltárolhatók a modulok. Ezután lépjen be az új könyvtárba a parancssor használatával, és töltse le azokat a következő parancs használatával:
zh_cn: 首先，必须创建一个可以存储模块的目录。 然后使用命令行切换到新目录，并使用以下命令检出它们：

source: Check out the ``module-tools`` module (from GitHub) too, for your development environment. It contains a number of useful tools:
hu: Töltse le a ``module-tools`` modult is (a GitHubról) a fejlesztői környezetéhez. Ez számos hasznos eszközt tartalmaz:
zh_cn: 对于您的开发环境，也可以检出 ``module-tools`` 模块（来自GitHub）。 它包含许多有用的工具：

source: Please configure the OTRS system according to the `installation instructions`_.
hu: Állítsa be az OTRS rendszert a `telepítési utasítások`_ szerint.

source: Useful Tools
hu: Hasznos eszközök
zh_cn: 有用的工具

source: There are two modules that are highly recommended for OTRS development:
hu: Létezik két modul, amely erősen ajánlott az OTRS fejlesztésnél:
zh_cn: 强烈建议OTRS开发使用这两个模块：

source: *OTRSCodePolicy* is a code quality checker that enforces the use of common coding standards also for the OTRS development team. It is highly recommended to use it if you plan to make contributions. You can use it as a standalone test script or even register it as a git commit hook that runs every time that you create a commit. Please see `the module documentation <https://github.com/OTRS/otrscodepolicy/blob/master/doc/en/OTRSCodePolicy.xml>`__ for details.
hu: Az *OTRSCodePolicy* egy kódolási minőség-ellenőrző, amely kikényszeríti a közös kódolási szabványok használatát az OTRS fejlesztőcsapatnál is. Erősen ajánlott ennek használata, ha hozzájárulásokat tervez készíteni. Használhatja önálló tesztelő parancsfájlként, vagy akár regisztrálhatja egy olyan git véglegesítés horogként, amely minden alkalommal lefut, amikor egy véglegesítést készít. A részletekért nézze meg a `modul dokumentációját <https://github.com/OTRS/otrscodepolicy/blob/master/doc/en/OTRSCodePolicy.xml>`__.
zh_cn: *OTRSCodePolicy* 是一个代码质量检查器，可以为OTRS开发团队强制使用通用编码标准。 如果您计划做贡献，强烈建议您使用它。 您可以将它用作独立的测试脚本，甚至可以将其注册为每次创建提交时运行的git commit hook。 有关详细信息，请参阅 `模块文档 <https://github.com/OTRS/otrscodepolicy/blob/master/doc/en/OTRSCodePolicy.xml>`__。

source: *Fred* is a little development helper module that you can actually install or link (as described below) into your development system. It features several helpful modules that you can activate, such as an SQL logger or an STDERR console. You can find some more details in its `module documentation <https://github.com/OTRS/Fred/blob/master/doc/en/Fred.xml>`__.
hu: A *Fred* egy kicsi fejlesztést segítő modul, amelyet ténylegesen telepíthet vagy hozzákapcsolhat (a lent leírt módon) a fejlesztői rendszeréhez. Számos hasznos modult szerepeltet, amelyet bekapcsolhat, mint például egy SQL naplózóként vagy egy szabványos hibakimenet konzolként. Néhány további részletet találhat a `modul dokumentációjában <https://github.com/OTRS/Fred/blob/master/doc/en/Fred.xml>`__.
zh_cn: *Fred* 是一个小型开发助手模块，您可以将其实际安装或链接（如下所述）到您的开发系统中。 它具有几个可以激活的有用模块，例如SQL记录器或STDERR控制台。 您可以在其 `模块文档 <https://github.com/OTRS/Fred/blob/master/doc/en/Fred.xml>`__ 中找到更多详细信息。

source: By the way, these tools are also open source, and we will be happy about any improvements that you can contribute.
hu: Mellesleg ezek az eszközök szintén nyílt forrásúak, és nagyon örülnénk bármilyen továbbfejlesztésnek, amellyel hozzájárul.
zh_cn: 顺便说一句，这些工具也是开源的，我们将为您可以贡献的任何改进感到高兴。

source: Linking Expansion Modules
hu: Bővítőmodulok hozzákapcsolása
zh_cn: 链接扩展模块
