Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: This reads registered cron tasks from the OTRS system configuration and determines the correct time to create a task to be executed.
hu: Ez kiolvassa a regisztrált cron-feladatokat az OTRS rendszerbeállításaiból, és meghatározza a helyes időt a végrehajtandó feladat létrehozásához.
zh_cn: 这将从OTRS系统配置中读取已注册的cron任务，并确定创建要执行的任务的正确时间。

source: This checks the tasks that are set to be executed just one time in the future and sets this task to be executed in time. For example, when a generic interface invoker can not reach the remote server, it can self schedule to be run again 5 minutes later.
hu: Ez ellenőrzi azokat a feladatokat, amelyek úgy vannak beállítva, hogy csak egy alkalommal fussanak a jövőben, és beállítja, hogy a feladat időben kerüljön végrehajtásra. Például amikor egy általános felület meghívónak nem sikerül elérnie a távoli kiszolgálót, akkor ütemezni tudja magát, hogy 5 perccel később újra fusson.
zh_cn: 这将检查设置为将来仅执行一次的任务，并将此任务设置为及时执行。 例如，当通用接口调用程序无法访问远程服务器时，它可以自行调度在5分钟后再次运行。

source: This continuously reads the generic agent tasks that are set to be run on regular time basis and sets their execution accordingly.
hu: Ez folyamatosan olvassa az általános ügyintéző feladatokat, amelyek rendszeres időközönkénti futáshoz vannak beállítva, és annak megfelelően állítja be azok végrehajtását.
zh_cn: 这将持续读取设置为定期运行的自动任务的任务，并相应地设置其执行时间。

source: Whenever these tasks managers are not enough, a new daemon module can be created. At a certain point of its ``Run()`` method it needs to call ``TaskAdd()`` from the ``chedulerDB`` object to register a task, and as soon as it is registered, it will be executed in the next free slot by the ``SchedulerTaskWorker``.
hu: Amikor ezek a feladatkezelők nem elegendőek, akkor egy új démonmodul hozható létre. Egy feladat regisztrálásához a ``Run()`` metódusuk egy bizonyos pontján meg kell hívni a ``TaskAdd()`` függvényt a ``chedulerDB`` objektumból, és amint regisztrálva lett, akkor a ``SchedulerTaskWorker`` végrehajtja a következő szabad időszeletben.
zh_cn: 只要这些任务管理器不够，就可以创建一个新的守护进程模块。 在它的 ``Run()`` 方法的某一点，它需要从 ``chedulerDB`` 对象调用 ``TaskAdd()`` 来注册一个任务，一旦它被注册，它就会在 ``SchedulerTaskWorker`` 的下一个空闲槽中被执行。

source: OTRS Scheduler Task Workers
hu: OTRS ütemező feladatelvégzők
zh_cn: OTRS调度程序任务工作程序

source: This executes all tasks planned by the previous tasks managers plus the ones that come directly from the code by using the asynchronous executor.
hu: Ez az aszinkron végrehajtó használatával végrehajtja az előző feladatkezelő által tervezett összes feladatot, és még azokat is, amelyek közvetlenül a kódból jönnek.
zh_cn: 这将执行先前任务管理器计划的所有任务以及通过异步执行程序直接来自代码的任务。

source: In order to execute each task, the ``SchedulerTaskWorker`` calls a back end module (task worker) to perform the specific task. The worker module is determined by the task type. If a new task type is added, it will require a new task worker.
hu: Annak érdekében, hogy az összes feladatot végrehajtsa, a ``SchedulerTaskWorker`` meghív egy háttérprogram-modult (feladatelvégzőt) az adott feladat végrehajtásához. Az elvégző modult a feladat típusa határozza meg. Ha új feladattípus kerül hozzáadásra, akkor az új feladatelvégzőt is igényel.
zh_cn: 为了执行每个任务，``SchedulerTaskWorker`` 调用一个后端模块（任务工作者）来执行特定任务。 工作程序模块由任务类型确定。 如果添加了新任务类型，则需要新的任务工作程序。

source: Creating A New Scheduler Task Worker
hu: Új ütemező feladatelvégző létrehozása
zh_cn: 创建一个新的调度程序任务工作程序

source: All files placed under ``Kernel/System/Daemon/DaemonModules/SchedulerTaskWorker`` could potentially be task workers and they do not require any registration in the system configuration.
hu: A ``Kernel/System/Daemon/DaemonModules/SchedulerTaskWorker`` mappa alatt elhelyezett összes fájl lehet potenciális feladatelvégző, és azok nem igényelnek semmilyen regisztrációt a rendszerbeállításokban.
zh_cn: 放在 ``Kernel/System/Daemon/DaemonModules/SchedulerTaskWorker`` 下的所有文件都可能是任务工作程序，并且它们不需要在系统配置中进行任何注册。

source: Scheduler Task Worker Code Example
hu: Ütemező feladatelvégző kódpélda
zh_cn: 调度程序任务工作程序代码示例

source: In this case we are inheriting from ``BaseTaskWorker`` class, and the object manager dependencies are set.
hu: Ebben az esetben a ``BaseTaskWorker`` osztályból származtatunk le, és az objektumkezelő függőségei be vannak állítva.
zh_cn: 在这个例子中，我们继承自 ``BaseTaskWorker`` 类，并设置了对象管理器依赖项。

source: The constructor ``new`` creates a new instance of the class.
hu: A ``new`` konstruktor hozza létre az osztály új példányát.
zh_cn: 构造函数 ``new`` 创建了一个新的类实例。

source: The ``Run`` is the main method. A call to ``_CheckTaskParams()`` from the base class will save some lines of code. Executing the task while capturing the STDERR is a very good practice, since the OTRS scheduler runs normally unattended, and saving all errors to a variable will make it available for further processing. ``_HandleError()`` provides a common interface to send the error messages as email to the recipient specified in the system configuration.
hu: A ``Run`` a fő metódus. Egy ``_CheckTaskParams()`` hívás az alaposztályból megspórol néhány kódsort. A feladat végrehajtása a szabványos hibakimenet megszerzése közben nagyon jó gyakorlat, mivel az OTRS ütemező normális esetben felügyelet nélkül fut, és az összes hiba egy változóba történő mentése lehetővé fogja tenni a későbbi feldolgozást. A ``_HandleError()`` közös felületet biztosít a hibaüzenetek e-mailben történő küldéséhez a rendszerbeállításokban megadott címzetteknek.
zh_cn: ``Run`` 是主要方法。 从基类调用 ``_CheckTaskParams()`` 将节约一些代码行。 在捕获STDERR时执行任务是一种非常好的做法，因为OTRS调度程序通常无人值守运行，并且将所有错误保存到变量将使其可用于进一步处理。 ``_HandleError()`` 提供了一个通用接口，可以将错误消息作为电子邮件发送给系统配置中指定的收件人。

source: Dashboard Module
hu: Vezérlőpult modul
zh_cn: 仪表板模块

source: Dashboard module to display statistics in the form of a line graph.
hu: Vezérlőpult modul statisztikák megjelenítéséhez vonaldiagram formájában.
zh_cn: 仪表板模块以折线图的形式显示统计信息。

source: Dashboard Widget
hu: Vezérlőpult felületi elem
zh_cn: 仪表板小部件

source: To use this module add the following to the ``Kernel/Config.pm`` and restart your web server (if you use ``mod_perl``).
hu: Ezen modul használatához adja hozzá a következőket a ``Kernel/Config.pm`` fájlhoz, és indítsa újra a webkiszolgálóját (ha a ``mod_perl`` modult használja).
zh_cn: 要使用此模块，请将以下内容添加到 ``Kernel/Config.pm`` 并重新启动Web服务器（如果使用 ``mod_perl``）。

source: An excessive number of days or individual lines may lead to performance degradation.
hu: A napok vagy az önálló sorok túlzott száma teljesítmény-csökkenéshez vezethet.
zh_cn: 天数或个别的折线过多可能会导致性能下降。

source: Creating a Dynamic Field Functionality Extension
hu: Egy dinamikus mező funkcionalitás kiterjesztés létrehozása
zh_cn: 创建一个动态字段功能扩展

source: To illustrate this process a new dynamic field functionality extension for the function ``Foo`` will be added to the back end object as well as in the text field driver.
hu: Ezen folyamat bemutatásához a ``Foo`` függvénynél egy új dinamikus mező funkcionalitás kiterjesztés lesz hozzáadva a háttérprogram objektumhoz, valamint a szövegmező illesztőprogramba.
zh_cn: 为了说明这个过程，``Foo`` 函数的一个新的动态字段功能扩展将添加到后端对象和文本字段驱动程序中。

source: To create this extension we will create 3 files:
hu: A kiterjesztés létrehozásához három fájlt fogunk létrehozni:
zh_cn: 要创建此扩展，我们将创建3个文件：

source: A configuration file (XML) to register the modules.
hu: Egy beállítófájlt (XML) a modulok regisztrálásához.
zh_cn: 一个用于注册模块的配置文件（XML）。

source: A back end extension (Perl) to define the new function.
hu: Egy háttérprogram kiterjesztést (Perl) az új függvény meghatározásához.
zh_cn: 一个用于定义新函数的后端扩展（Perl）。

source: A text field driver extension (Perl) that implements the new function for text fields.
hu: Egy szövegmező illesztőprogram kiterjesztést (Perl), amely megvalósítja az új függvényt a szövegmezőknél.
zh_cn: 一个文本字段驱动程序扩展（Perl），用于实现文本字段的新功能。

source: File structure:
hu: Fájlszerkezet:
zh_cn: 文件结构：

source: Dynamic Field Foo Extension files
hu: Dinamikus mező Foo kiterjesztés fájlok
zh_cn: 动态字段Foo扩展文件

source: Dynamic Field Extension Configuration File Example
hu: Dinamikus mező kiterjesztés beállítófájl példa
zh_cn: 动态字段扩展文件示例

source: The configuration files are used to register the extensions for the back end and drivers as well as new behaviors for each drivers.
hu: A beállítófájlokat használják a kiterjesztések regisztrálásához a háttérprogramnál és az illesztőprogramoknál, valamint az egyes illesztőprogramok új viselkedéseihez.
zh_cn: 该配置文件用于注册后端和驱动程序的扩展以及每个驱动程序的新行为。

source: If a driver is extended with a new function, the back end will need also an extension for that function.
hu: Ha egy illesztőprogramot kiterjesztenek egy új függvénnyel, akkor a háttérprogramnak is szüksége lesz egy kiterjesztésre ahhoz a függvényhez.
zh_cn: 如果使用新功能扩展一个驱动程序，则后端也需要一个该功能的扩展。

source: In this section a configuration file for ``Foo`` extension is shown and explained.
hu: Ebben a szakaszban a ``Foo`` kiterjesztéshez egy beállítófájl van megjelenítve és elmagyarázva.
zh_cn: 在本节中，将显示和解释 ``Foo`` 扩展的配置文件。

source: This is the normal header for a configuration file.
hu: Ez a normál fejléc egy beállítófájlhoz.
zh_cn: 这是配置文件的正常头文件。

source: This setting registers the extension in the back end object. The module will be loaded from ``Backend`` as a base class.
hu: Ez a beállítás regisztrálja a kiterjesztést a háttérprogram objektumban. A modul alaposztályként lesz betöltve a ``Backend`` objektumból.
zh_cn: 此设置在后端对象中注册扩展名。该模块将从 ``Backend`` 作为基类加载。

source: This is the registration for an extension in the text dynamic field driver. The module will be loaded as a base class in the driver. Notice also that new behaviors can be specified. These extended behaviors will be added to the behaviors that the driver has out of the box, therefore a call to ``HasBehavior()`` to check for these new behaviors will be totally transparent.
hu: Ez egy kiterjesztés regisztrációja a szöveg dinamikus mező illesztőprogramban. A modul alaposztályként lesz betöltve az illesztőprogramban. Figyeljen arra is, hogy új viselkedések is megadhatók. Ezek a kiterjesztett viselkedések lesznek hozzáadva azokhoz a viselkedésekhez, amelyekkel az illesztőprogram eredetileg rendelkezik, ebből adódóan a ``HasBehavior()`` hívásával azt ellenőrizve, hogy ezeknél az új viselkedéseknél teljesen átlátszó legyen.
zh_cn: 这是在文本动态字段驱动程序中注册扩展。 该模块将作为基类加载到驱动程序中。 另请注意，可以指定新行为。 这些扩展的行为将被添加到驱动程序开箱即用的行为中，因此调用 ``HasBehavior()`` 来检查这些新行为将是完全透明的。

source: Standard closure of a configuration file.
hu: Egy beállítófájl szabványos lezárása.
zh_cn: 一个配置文件的标准关闭。

source: Dynamic Field Back End Extension Example
hu: Dinamikus mező háttérprogram kiterjesztés példa
zh_cn: 动态字段后端扩展示例

source: Back end extensions will be loaded transparently into the back end itself as a base class. All defined object and properties from the back end will be accessible in the extension.
hu: A háttérprogram kiterjesztések átláthatóan lesznek betöltve magába a háttérprogramba egy alaposztályként. A háttérprogramból az összes meghatározott objektum és tulajdonság elérhető lesz a kiterjesztésben.
zh_cn: 后端扩展将作为基类透明地加载到后端本身。 可以在扩展中访问后端的所有已定义对象和属性。

source: All new functions defined in the back end extension should be implemented in a driver extension.
hu: A háttérprogram kiterjesztésben meghatározott összes új függvényt meg kell valósítani egy illesztőprogram kiterjesztésben.
zh_cn: 后端扩展中定义的所有新功能都应在驱动程序扩展中实现。

source: In this section the ``Foo`` extension for back end is shown and explained. The extension only defines the function ``Foo()``.
hu: Ebben a szakaszban a háttérprogramhoz készített ``Foo`` kiterjesztés van megjelenítve és elmagyarázva. A kiterjesztés csak a ``Foo()`` függvényt határozza meg.
zh_cn: 在本节中，将显示和解释后端的 ``Foo`` 扩展。 该扩展只定义函数 ``Foo()``。

source: The function ``Foo()`` is only used for test purposes. First it checks the dynamic field configuration, then it checks if the dynamic field driver (type) exists and was already loaded. To prevent the function call on a driver where is not defined it first check if the driver can execute the function, then executes the function in the driver passing all parameters.
hu: A ``Foo()`` függvényt kizárólag tesztelési célokra használják. Először leellenőrzi a dinamikus mező beállításait, majd azt ellenőrzi, hogy a dinamikus mező illesztőprogram (típus) létezik-e, és betöltésre került-e. Annak megakadályozásához, hogy egy olyan illesztőprogramnál történjen függvényhívás, ahol nincs meghatározva, először azt ellenőrzi, hogy az illesztőprogram képes-e végrehajtani a függvényt, majd végrehajtja a függvényt az illesztőprogramban az összes paramétert átadva.
zh_cn: ``Foo()`` 函数仅用于测试目的。 首先，它检查动态字段配置，然后检查动态字段驱动程序（类型）是否存在且是否已加载。 为了防止对未定义的驱动程序的函数调用，首先检查驱动程序是否可以执行该函数，然后在驱动程序中执行传递所有参数的函数。

source: It is also possible to skip the step that tests if the driver can execute the function. To do that it is necessary to implement a mechanism in the front end module to require a special behavior on the dynamic field, and only after call the function in the back end object.
hu: Lehetséges annak a lépésnek a kihagyása is, amely azt próbálja, hogy az illesztőprogram képes-e végrehajtani a függvényt. Ennek elvégzéséhez szükséges egy mechanizmus megvalósítása az előtétprogram-modulban egy különleges viselkedés megköveteléséhez a dinamikus mezőnél, és csak azután hívja meg a függvényt a háttérprogram objektumban.
zh_cn: 也可以跳过测试驱动程序是否可以执行该功能的步骤。为此，有必要在前端模块中实现一种机制，以要求在动态字段上有一个特殊的行为，并且仅在调用后端对象中的函数之后。

source: Dynamic Field Driver Extension Example
hu: Dinamikus mező illesztőprogram kiterjesztés példa
zh_cn: 动态字段驱动程序扩展示例

source: Driver extensions will be loaded transparently into the driver itself as a base class. All defined object and properties from the driver will be accessible in the extension.
hu: Az illesztőprogram kiterjesztések átláthatóan lesznek betöltve magába az illesztőprogramba egy alaposztályként. Az illesztőprogramból az összes meghatározott objektum és tulajdonság elérhető lesz a kiterjesztésben.
zh_cn: 驱动程序扩展将作为基类透明地加载到驱动程序本身中。驱动程序中定义的所有对象和属性都可以在扩展中访问。

source: All new functions implemented in the driver extension should be defined in a back end extension, as every function is called from the back end object.
hu: Az illesztőprogram kiterjesztésben megvalósított összes új függvényt meg kell határozni egy háttérprogram kiterjesztésben, mivel minden függvény a háttérprogram objektumból kerül meghívásra.
zh_cn: 驱动程序扩展中实现的所有新函数都应该在后端扩展中定义，因为每个函数都是从后端对象调用的。

source: In this section the ``Foo`` extension for text field driver is shown and explained. The extension only implements the function ``Foo()``.
hu: Ebben a szakaszban a szövegmező illesztőprogramhoz készített ``Foo`` kiterjesztés van megjelenítve és elmagyarázva. A kiterjesztés csak a ``Foo()`` függvényt valósítja meg.
zh_cn: 在本节中，将显示并解释文本字段驱动程序的 ``Foo`` 扩展。扩展仅实现 ``foo()`` 函数。

source: The function ``Foo()`` has no special logic. It is only for testing and it always returns 1.
hu: A ``Foo()`` függvénynek nincs különleges logikája. Csak tesztelésre van, és mindig 1-et ad vissza.
zh_cn: ``foo()`` 函数没有特殊的逻辑。它只用于测试，并且总是返回1。

source: How To Extend The Dynamic Fields
hu: Hogyan lehet kiterjeszteni a dinamikus mezőket
zh_cn: 如何扩展动态字段

source: There are many ways to extend the dynamic fields. The following sections will try to cover the most common scenarios.
hu: Számos módszer létezik a dinamikus mezők kiterjesztésére. A következő szakaszok meg fogják próbálni a leggyakoribb forgatókönyveket bemutatni.
zh_cn: 有很多方法可以扩展动态字段。以下部分将尝试介绍最常见的场景。

source: Create a New Dynamic Field Type (for ticket or article objects)
hu: Egy új dinamikus mező típus létrehozása (a jegy vagy bejegyzés objektumokhoz)
zh_cn: 创建新的动态字段类型（用于工单或信件对象）

source: To create a new dynamic field type is necessary to:
hu: Egy új dinamikus mező típus létrehozásához a következők szükségesek:
zh_cn: 要创建新的动态字段类型，必须：

source: Create a dynamic field driver. This is the main module of the new field.
hu: Hozzon létre egy dinamikus mező illesztőprogramot. Ez az új mező fő modulja.
zh_cn: 创建一个动态字段驱动程序。这是新字段的主要模块。

source: Create or use an existing admin dialog to have a management interface and set its configuration options.
hu: Hozzon létre vagy használjon egy meglévő adminisztrátori párbeszédablakot egy kezelőfelület megszerzéséhez, és a konfigurációs beállításainak megadásához.
zh_cn: 创建或使用现有的管理对话框以具有管理界面并设置其配置选项。

source: Create a configuration file to register the new field in the back end (or new admin dialogs in the framework if needed) and be able to create instances or it.
hu: Hozzon létre egy beállítófájlt az új mező regisztrálásához a háttérprogramban (vagy a keretrendszerben lévő új adminisztrátori párbeszédablakokban, ha szükséges), valamint hogy képes legyen példányokat vagy azt létrehozni.
zh_cn: 创建一个配置文件来注册后端中的新字段（如果需要，也可以在框架中创建新的管理对话框），并能创建其实例。

source: Create a New Dynamic Field Type (for other objects)
hu: Egy új dinamikus mező típus létrehozása (egyéb objektumokhoz)
zh_cn: 创建新的动态字段类型（用于其它对象）

source: To create a new dynamic field type for other objects is necessary to:
hu: Egy új dinamikus mező típus létrehozásához más objektumoknál a következők szükségesek:
zh_cn: 要为其它对象创建新的动态字段类型，必须：

source: Create an object type delegate. This is necessary, even if the other object does not require any specific data handling in its functions (e.g. after a value is set). All object type delegates must implement the functions that the back end requires.
hu: Hozzon létre egy objektumtípus delegáltat. Ez akkor is szükséges, ha a másik objektum nem igényel semmilyen különleges adatkezelést a függvényeiben (például egy érték beállítása után). Az összes objektumtípus delegáltnak meg kell valósítania azokat a függvényeket, amelyeket a háttérprogram igényel.
zh_cn: 创建对象类型委托。这是必要的，即使另一个对象在其函数中不需要任何特定的数据处理（例如，在设置了一个值之后）。所有对象类型委托都必须实现后端所需的功能。

source: Take a look in the current object type delegates to implement the same functions, even if they just return a successful value for the other object.
hu: Vessen egy pillantást a jelenlegi objektumtípus delegáltakra ugyanazon függvények megvalósításához még akkor is, ha azok csak egy sikeres értéket adnak vissza a másik objektumnál.
zh_cn: 查看当前对象类型委托以实现相同的函数，即使它们只是为其它对象返回一个成功的值。

source: Implement dynamic fields in the front end modules to be able to use the dynamic fields.
hu: Valósítsa meg a dinamikus mezőket az előtétprogram-modulokban, hogy képes legyen használni a dinamikus mezőket.
zh_cn: 在前端模块中实现动态字段，以便能够使用动态字段。

source: And make the needed settings to show, hide or show the dynamic fields as mandatory in the new screens.
hu: És végezze el a szükséges beállításokat az új képernyőkön történő megjelenítéshez, elrejtéshez vagy a dinamikus mezők kötelezőként való megjelenítéséhez.
zh_cn: 并进行必要的设置以在新屏幕中强制显示、隐藏或显示动态字段。

source: Create a New package to Use Dynamic Fields
hu: Egy új csomag létrehozása a dinamikus mezők használatához
zh_cn: 创建新包以使用动态字段

source: To create a package to use existing dynamic fields is necessary to:
hu: Egy csomag létrehozásához a meglévő dinamikus mezők használata érdekében a következők szükségesek:
zh_cn: 要创建使用现有动态字段的包，必须：

source: Create a configuration file to give the end user the possibility to show, hide or show the dynamic fields as mandatory in the new screens.
hu: Hozzon létre egy beállítófájlt, hogy lehetőséget adjon a végfelhasználónak az új képernyőkön történő megjelenítéshez, elrejtéshez vagy a dinamikus mezők kötelezőként való megjelenítéséhez.
zh_cn: 创建一个配置文件，使最终用户能够在新屏幕中显示、隐藏或强制显示动态字段。

source: Extend Back End and Drivers Functionalities
hu: A háttérprogram és az illesztőprogramok funkcionalitásainak kiterjesztése
zh_cn: 扩展后端和驱动程序功能

source: It might be possible that the back end object does not have a needed function for custom developments, or could also be possible that it has the function needed, but the return format does not match the needs of the custom development, or that a new behavior is needed to execute the new or the old functions.
hu: Lehetséges lehet, hogy a háttérprogram objektum nem rendelkezik egy szükséges függvénnyel az egyéni fejlesztésekhez, vagy az is előfordulhat, hogy megvan ugyan a szükséges függvénye, de a visszatérési formátum nem felel meg az egyéni fejlesztés szükségleteinek, vagy hogy egy új viselkedés az új vagy a régi függvények végrehajtását igényli.
zh_cn: 后端对象可能没有自定义开发所需的函数，或者也可能具有所需的函数，但是返回格式不符合自定义开发的需要，或者执行新的或旧的函数需要新的行为。

source: The easiest way to do this, is to extend the current field files. For this it is necessary to create a new back end extension file that defines the new functions and create also drivers extensions that implement these new functions for each field. These new drivers will only need to implement the new functions since the original drivers takes care of the standard functions. All these new files do not need a constructor as they will be loaded as a base for the back end object and the drivers.
hu: A legegyszerűbb mód ennek elvégzéséhez a jelenlegi mezőfájlok kiterjesztése. Ehhez egy olyan új háttérprogram kiterjesztésfájlt szükséges létrehozni, amely meghatározza az új függvényeket, és olyan illesztőprogram kiterjesztéseket is létre kell hozni, amelyek megvalósítják ezeket az új függvényeket minden egyes mezőnél. Ezeknek az új illesztőprogramoknak csak az új függvényeket kell majd megvalósítaniuk, mivel az eredeti illesztőprogramok törődnek a szabványos függvényekkel. Ezen új fájlok egyikének sincs szüksége konstruktorra, mivel ezek egy alapként lesznek betöltve a háttérprogram objektumhoz és az illesztőprogramokhoz.
zh_cn: 最简单的方法是扩展当前字段文件。为此，有必要创建一个新的后端扩展文件来定义新的函数，并创建驱动程序扩展来为每个字段实现这些新函数。这些新的驱动程序只需要实现新的功能，因为原始驱动程序负责标准功能。所有这些新文件都不需要构造函数，因为它们将作为后端对象和驱动程序的基础进行加载。

source: The only restrictions are that the functions should be named different than the ones on the back end and drivers, otherwise they will be overwritten with current objects.
hu: Az egyetlen korlátozás, hogy a függvényeket eltérően kell elnevezni a háttérprogramnál és az illesztőprogramnál lévőknél, különben felül fognak íródni a jelenlegi objektumokkal.
zh_cn: 唯一的限制是函数的命名应该与后端和驱动程序上的不同，否则它们将被当前对象覆盖。

source: Put the new back end extension into the ``DynamicField`` directory (e.g. ``/$OTRS_HOME/Kernel/System/DynamicField/NewPackageBackend.pm`` and its drivers in ``/$OTRS_HOME/Kernel/System/DynamicField/Driver/NewPackage*.pm``).
hu: Tegye az új háttérprogram kiterjesztést a ``DynamicField`` könyvtárba (például ``/$OTRS_HOME/Kernel/System/DynamicField/NewPackageBackend.pm`` és az illesztőprogramjait a ``/$OTRS_HOME/Kernel/System/DynamicField/Driver/NewPackage*.pm`` fájlokba).
zh_cn: 将新的后端扩展放入 ``DynamicField`` 目录（例如 ``/$OTRS_HOME/Kernel/System/DynamicField/NewPackageBackend.pm`` 及其驱动程序位于 ``/$OTRS_HOME/Kernel/System/DynamicField/Driver/NewPackage*.pm``）。

source: New behaviors only need a small setting in the extensions configuration file.
hu: Az új viselkedéseknek csak egy kis beállítás szükséges a kiterjesztések beállítófájljában.
zh_cn: 新行为只需要扩展配置文件中的一个小型设置。

source: To create new back end functions is needed to:
hu: Az új háttérprogram függvények létrehozásához a következők szükségesek:
zh_cn: 要创建新的后端函数，需要：

source: Create a new back end extension module to define only the new functions.
hu: Hozzon létre egy új háttérprogram kiterjesztés modult csak az új függvények meghatározásához.
zh_cn: 创建一个新的后端扩展模块以仅定义新函数。

source: Create the dynamic fields driver extensions to implement only the new functions.
hu: Hozza létre a dinamikus mezők illesztőprogram kiterjesztéseit csak az új függvények megvalósításához.
zh_cn: 创建动态字段驱动程序扩展以仅实现新函数。

source: Implement new dynamic fields functions in the front end modules to be able to use the new dynamic fields functions.
hu: Valósítsa meg az új dinamikus mezők függvényeit az előtétprogram-modulokban, hogy képes legyen használni az új dinamikus mezők függvényeit.
zh_cn: 在前端模块中实现新的动态字段功能，以便能够使用新的动态字段功能。
