Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: ``ImportWrapper`` works the other way around - it converts the name to the ID in the instance the configuration is imported to.
hu: Az ``ImportWrapper`` fordítva működik - átalakítja a nevet az azonosítóra abban a példányban, ahova a beállítások importálásra kerülnek.
zh_cn: ``ImportWrapper`` 以相反的方式工作 - 它将名称转换为导入配置的实例中的ID。

source: This is a sample export:
hu: Ez egy minta exportálás:
zh_cn: 这是一个示例导出：

source: Now, that all subroutines are explained, this is the complete sample stats module.
hu: Most, hogy az összes szubrutin elmagyarázásra került, itt a teljes minta statisztikák modul.
zh_cn: 现在，解释了所有子程序，这是完整的样本统计模块。

source: Stats Configuration Example
hu: Statisztikák beállítási példa
zh_cn: 统计配置示例

source: If you have a lot of cells in the result table and the ``GetStatElement`` is quite complex, the request can take a long time.
hu: Ha nagyon sok cellája van az eredménytáblázatban és a ``GetStatElement`` meglehetősen összetett, akkor a kérés eltarthat egy ideig.
zh_cn: 如果结果表中有很多单元格并且 ``GetStatElement`` 非常复杂，那么请求可能需要很长时间。

source: Static Stats
hu: Statikus statisztikák
zh_cn: 静态统计

source: The subsequent paragraphs describe the static stats. Static stats are very easy to create as these modules have to implement only three subroutines.
hu: A következő bekezdések a statikus statisztikákat írják le. A statikus statisztikákat nagyon könnyű létrehozni, mivel ezeknek a moduloknak csak három szubrutint kell megvalósítaniuk.
zh_cn: 后续段落描述了静态统计数据。 静态统计信息很容易创建，因为这些模块只需要实现三个子程序。

source: Static Stats Code Example
hu: Statikus statisztikák kódpélda
zh_cn: 静态统计代码示例

source: The following paragraphs describe the subroutines needed in a static stats.
hu: A következő bekezdések a statikus statisztikákban szükséges szubrutinokat mutatják be.
zh_cn: 以下段落描述了静态统计信息中所需的子程序。

source: The ``new`` creates a new instance of the static stats class. First it creates a new object and then it checks for the needed objects.
hu: A ``new`` hozza létre a statikus statisztikák osztályának egy új példányát. Először létrehoz egy új objektumot, és azután ellenőrzi a szükséges objektumokat.
zh_cn: ``new`` 创建静态统计类的新实例。 首先，它创建一个新对象，然后检查所需的对象。

source: The ``Param`` method provides the list of all parameters/attributes that can be selected to create a static stat. It gets some parameters passed: The values for the stats attributes provided in a request, the format of the stats and the name of the object (name of the module).
hu: A ``Param`` metódus biztosítja az összes olyan paraméter és attribútum listáját, amelyek kiválaszthatók egy statikus statisztika létrehozásához. Megkap néhány átadott paramétert: az értékeket egy kérésben szolgáltatott statisztikák attribútumaihoz, a statisztikák formátumát és az objektum nevét (a modul nevét).
zh_cn: ``Param`` 方法提供了可以选择创建静态统计的所有参数/属性的列表。 它传递了一些参数：请求中提供的统计属性的值，统计的格式和对象的名称（模块的名称）。

source: The parameters/attributes have to be hash references with these key-value pairs:
hu: A paramétereknek és az attribútumoknak kivonathivatkozásoknak kell lenniük ezekkel a kulcs-érték párokkal:
zh_cn: 参数/属性必须是具有这些键值对的哈希引用：

source: Other parameter for the ``BuildSelection`` method of the ``LayoutObject`` can be used, as it is done with ``Size`` and ``Multiple`` in this sample module.
hu: Egyéb paraméterek is használhatók a ``LayoutObject`` ``BuildSelection`` metódusánál, ahogy az a ``Size`` és ``Multiple`` paraméterekkel történik ebben a minta modulban.
zh_cn: 可以使用 ``LayoutObject`` 的 ``BuildSelection`` 方法的其他参数，比如在此示例模块中使用了 ``Size`` 和 ``Multiple``。

source: The ``Run`` method actually generates the table data for the stats. It gets the attributes for this stats passed. In this sample in ``%Param`` a key ``TypeIDs`` and a key ``QueueIDs`` exist (see attributes in ``Param`` method) and their values are array references. The returned data consists of three parts: Two array references and an array. In the first array reference the title for the statistic is stored, the second array reference contains the headlines for the columns in the table. And then the data for the table body follow.
hu: Tulajdonképpen a ``Run`` metódus állítja elő a táblázat adatait a statisztikákhoz. Megkapja az ennél a statisztikánál átadott attribútumokat. Ebben a mintában a ``%Param`` paraméterben egy ``TypeIDs`` kulcs és egy ``QueueIDs`` kulcs létezik (lásd a ``Param`` metódusban lévő attribútumokat), és ezek értékei tömbhivatkozások. A visszaadott adatok három részből állnak: két tömbhivatkozásból és egy tömbből. Az első tömbhivatkozásban a statisztika címe van eltárolva, a második tömbhivatkozás tartalmazza a táblázatban lévő oszlopok címsorait. És ezután a táblázattörzs adatai következnek.
zh_cn: ``Run`` 方法实际上生成了统计数据的表数据。 它获取传递此统计数据的属性。 在这个示例中的 ``％Param`` 存在一个 ``TypeIDs`` 键和一个 ``QueueIDs`` 键（参见 ``Param`` 方法中的属性），它们的值是数组引用。 返回的数据由三部分组成：两个数组引用和一个数组。 在第一个数组引用中存储统计信息的标题，第二个数组引用包含表中列的标题。 然后表体的数据如下。

source: Static Stats Configuration Example
hu: Statikus statisztikák beállítási példa
zh_cn: 静态统计配置示例

source: There is no configuration needed. Right after installation, the module is available to create a statistic for this module.
hu: Nincs szükség beállításokra. Közvetlenül telepítés után a modul elérhető egy statisztika létrehozásához ennél a modulnál.
zh_cn: 无需配置。 安装后，该模块可用于为此模块创建统计信息。

source: Ticket Menu Module
hu: Jegymenü modul
zh_cn: 工单菜单模块

source: Ticket menu modules are used to display an additional link in the menu above a ticket. You can write and register your own ticket menu module. There are 4 ticket menus (*Generic*, *Lock*, *Responsible* and *TicketWatcher*) which come with the OTRS framework. For more information please have a look at the OTRS admin manual.
hu: A jegymenü modulokat egy további hivatkozás megjelenítéséhez használják a jegy fölött lévő menüben. Megírhatja és regisztrálhatja a saját jegymenü moduljait. Négy jegymenü létezik (*Általános*, *Zárolás*, *Felelős* és *Jegymegfigyelő*), amely az OTRS keretrendszerrel érkezik. További információkért nézzen bele az OTRS adminisztrációs kézikönyvébe.
zh_cn: 工单菜单模块用于在工单上方的菜单中显示其他链接。 您可以编写并注册自己的工单菜单模块。 OTRS框架附带4个工单菜单（*通用*， *锁定*， *负责人* 和 *关注人*）。 有关更多信息，请查看OTRS管理手册。

source: Ticket Menu Module Code Example
hu: Jegymenü modul kódpélda
zh_cn: 工单菜单模块代码示例

source: The ticket menu modules are located under ``Kernel/Output/HTML/TicketMenu*.pm``. Following, there is an example of a ticket menu module. Save it under ``Kernel/Output/HTML/TicketMenuCustom.pm``. You just need 2 functions: ``new()`` and ``Run()``.
hu: A jegymenü modulok a ``Kernel/Output/HTML/TicketMenu*.pm`` fájlokban találhatók. A következőkben egy jegymenü modul példája található. Mentse el a ``Kernel/Output/HTML/TicketMenuCustom.pm`` helyre. Mindössze két függvényre van szüksége: ``new()`` és ``Run()``.
zh_cn: 工单菜单模块位于 ``Kernel/Output/HTML/TicketMenu*.pm`` 下。 下面是一个工单菜单模块的示例。 将它保存在 ``Kernel/Output/HTML/TicketMenuCustom.pm`` 下。 你只需要2个函数：``new()`` 和 ``Run()``。

source: Ticket Menu Module Configuration Example
hu: Jegymenü modul beállítási példa
zh_cn: 工单菜单模块配置示例

source: There is the need to activate your custom ticket menu module. This can be done using the XML configuration below. There may be additional parameters in the config hash for your ticket menu module.
hu: Szükség van az egyéni jegymenü modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni. Lehetnek további paraméterek is a beállítás kivonatában a jegymenü moduljánál.
zh_cn: 需要激活自定义的工单菜单模块。 这可以使用下面的XML配置来完成。 您的工单菜单模块的配置哈希中可能还有其他参数。

source: Ticket Menu Module Use Case Example
hu: Jegymenü modul használati eset példa
zh_cn: 工单菜单模块用例示例

source: The ticket menu directs to an URL that can be handled. If you want to handle that request via the OTRS framework, you have to write your own front end module.
hu: A jegymenü egy olyan URL-re irányít, amely kezelhető. Ha ezt a kérést az OTRS keretrendszeren keresztül szeretné kezelni, akkor meg kell írnia a saját előtétprogram modulját.
zh_cn: 工单菜单指向可以处理的URL。 如果要通过OTRS框架处理该请求，则必须编写自己的前端模块。

source: Ticket Postmaster Module
hu: Jegy levelezési modul
zh_cn: 工单邮箱管理员模块

source: Postmaster modules are used during the postmaster process. There are two kinds of postmaster modules:
hu: A levelezési modulokat a levelezési folyamat során használják. Kétféle levelezési modul létezik:
zh_cn: 邮箱管理员模块在邮箱管理员流程中使用。 邮箱管理员模块有两种：

source: ``PostMasterPre``: used after parsing an email.
hu: ``PostMasterPre``: egy e-mail feldolgozása után használják.
zh_cn: ``PostMasterPre``：解析邮件后使用。

source: ``PostMasterPost``: used after an email is processed and is in the database.
hu: ``PostMasterPost``: azután használják, amikor egy e-mail feldolgozásra került, és az adatbázisban van.
zh_cn: ``PostMasterPost``：在处理完电子邮件并保存到数据库后使用。

source: If you want to create your own postmaster filter, just create your own module. These modules are located under ``Kernel/System/PostMaster/Filter/*.pm``. For default modules see the admin manual. You just need two functions: ``new()`` and ``Run()``.
hu: Ha saját levelezési szűrőket szeretne létrehozni, akkor egyszerűen hozza létre a saját modulját. Ezek a modulok a ``Kernel/System/PostMaster/Filter/*.pm`` fájlokban találhatók. Az alapértelmezett modulokért nézze meg az adminisztrátori kézikönyvet. Mindössze két függvényre van szüksége: ``new()`` és ``Run()``.
zh_cn: 如果您想创建自己的邮箱管理员过滤器，只需创建自己的模块。 这些模块位于 ``Kernel/System/PostMaster/Filter/*.pm`` 下。 有关默认模块，请参阅管理员手册。 你只需要两个函数：``new()`` 和 ``Run()``。

source: The following is an exemplary module to match emails and set X-OTRS-Headers (see ``doc/X-OTRS-Headers.txt`` for more info).
hu: A következőkben egy példaszerű modul található az e-mailek egyeztetéséhez és az X-OTRS fejlécek beállításához (további információkért nézze meg a ``doc/X-OTRS-Headers.txt`` fájlt).
zh_cn: 以下是匹配电子邮件和设置X-OTRS-Headers的示例模块（有关详细信息，请参阅 ``doc/X-OTRS-Headers.txt``）。

source: And the actual filter code in ``Kernel/System/PostMaster/Filter/Example.pm``:
hu: És a tényleges szűrőkód a ``Kernel/System/PostMaster/Filter/Example.pm`` fájlban:
zh_cn: 以及 ``Kernel/System/PostMaster/Filter/Example.pm`` 中的实际过滤器代码：

source: The following image shows you the email processing flow.
hu: A következő kép az e-mail feldolgozási folyamatát mutatja be.
zh_cn: 下图显示了电子邮件处理流程。

source: Email Processing Flow
hu: E-mail feldolgozási folyamat
zh_cn: 电子邮件处理流程

source: Ticket Event Module
hu: Jegyesemény modul
zh_cn: 工单事件模块

source: Ticket event modules are running right after a ticket action takes place. Per convention these modules are located in the directory ``Kernel/System/Ticket/Event``. A ticket event module needs only two functions: ``new()`` and ``Run()``. The method ``Run()`` receives at least the parameters ``Event``, ``UserID`` and ``Data``. ``Data`` is a hash ref containing data of the ticket, and in case of article related events also containing article data.
hu: A jegyesemény modulok közvetlenül azután futnak le, amikor egy jegyművelet megtörténik. Megegyezés szerint ezek a modulok a ``Kernel/System/Ticket/Event`` könyvtárban találhatók. Egy jegyesemény modulnak mindössze két függvényre van szüksége: ``new()`` és ``Run()``. A ``Run()`` metódus legalább az ``Event``, a `UserID`` és a ``Data`` paramétereket fogadja. A ``Data`` a jegy adatait tartalmazó kivonathivatkozás, és a bejegyzésre vonatkozó események esetében a bejegyzés adatait is tartalmazza.
zh_cn: 工单事件模块在工单操作发生后立即运行。 按照惯例，这些模块位于 ``Kernel/System/Ticket/Event`` 目录中。 工单事件模块只需要两个函数：``new()`` 和 ``Run()``。 ``Run()`` 方法至少接收参数 ``Event``、``UserID`` 和 ``Data``。 ``Data`` 是包含工单数据的哈希引用，如果事件有相关的信件也包含信件数据。

source: Ticket Event Module Code Example
hu: Jegyesemény modul kódpélda
zh_cn: 工单事件模块代码示例

source: See files in ``Kernel/System/Ticket/Event`` folder of the source code.
hu: Nézze meg a forráskód ``Kernel/System/Ticket/Event`` mappájában lévő fájlokat.
zh_cn: 请参见源代码的 ``Kernel/System/Ticket/Event`` 目录中的文件。

source: Ticket Event Module Configuration Example
hu: Jegyesemény modul beállítási példa
zh_cn: 工单事件模块配置示例

source: See settings in ``Kernel/Config/Files/XML/Ticket.xml`` started with the name ``Ticket::EventModulePost###``.
hu: Nézze meg a ``Kernel/Config/Files/XML/Ticket.xml`` fájlban azokat a beállításokat, amelyek neve ``Ticket::EventModulePost###`` előtaggal kezdődik.
zh_cn: 请参见 ``Kernel/Config/Files/XML/Ticket.xml`` 中以名称 ``Ticket::EventModulePost###`` 开头的设置。

source: Ticket Event Module Use Case Example
hu: Jegyesemény modul használati eset példa
zh_cn: 工单事件模块用例示例

source: A ticket should be unlocked after a move action
hu: Egy jegyet fel kell oldani egy áthelyezés művelet után
zh_cn: 移动操作后解锁工单

source: This standard feature has been implemented with the ticket event module ``Kernel::System::Ticket::Event::ForceUnlock``. When this feature is not wanted, then it can be turned off by unsetting the system configuration entry ``Ticket::EventModulePost###910-ForceUnlockOnMove``.
hu: Ez a szabványos funkció a ``Kernel::System::Ticket::Event::ForceUnlock`` jegyesemény modullal lett megvalósítva. Amikor erre a funkcióra nincs szükség, akkor az kikapcsolható a ``Ticket::EventModulePost###910-ForceUnlockOnMove`` rendszerbeállítási bejegyzés beállításának törlésével.
zh_cn: 这个标准功能已经使用工单事件模块 ``Kernel::System::Ticket::Event::ForceUnlock`` 实现。 当不需要此功能时，可以通过取消系统配置条目 ``Ticket::EventModulePost###910-ForceUnlockOnMove`` 设置来关闭它。

source: Perform extra cleanup action when a ticket is deleted
hu: További tisztítóművelet végrehajtása egy jegy törlésekor
zh_cn: 删除工单时执行额外的清理操作

source: A customized OTRS might hold non-standard data in additional database tables. When a ticket is deleted then this additional data needs to be deleted. This functionality can be achieved with a ticket event module listening to ``TicketDelete`` events.
hu: Egy személyre szabott OTRS tarthat nem szabványos adatokat további adatbázistáblákban. Amikor egy jegyet törölnek, akkor ezeket a további adatokat is törölni kell. Ez a funkcionalitás elérhető egy olyan jegyesemény modullal, amely a ``TicketDelete`` eseményekre figyel.
zh_cn: 自定义OTRS可能会在其他数据库表中保存非标准数据。 删除工单后，需要删除此附加数据。 使用工单事件模块监听 ``TicketDelete`` 事件可以实现此功能。

source: New tickets should be twittered
hu: Az új jegyeket közzé kell tenni a Twitteren
zh_cn: 新的工单通过twitter发布

source: A ticket event module listening to ``TicketCreate`` can send out tweets.
hu: Egy ``TicketCreate`` eseményre figyelő jegyesemény modul képes üzeneteket kiküldeni a Twitterre.
zh_cn: 监听 ``TicketCreate`` 的工单事件模块可以发送推文。

source: Ticket and Article Events
hu: Jegy- és bejegyzésesemények
zh_cn: 工单和信件事件

source: Available ticket events:
hu: Elérhető jegyesemények:
zh_cn: 可用的工单事件：

source: Available article events:
hu: Elérhető bejegyzésesemények:
zh_cn: 可用的信件事件：

source: Ticket Number Generator Modules
hu: Jegyszám előállító modulok
zh_cn: 工单编号生成器模块

source: Ticket number generators are used to create distinct identifiers aka ticket number for new tickets. Any method of creating a string of numbers is possible, you should use common sense about the length of the resulting string (guideline: 5-10).
hu: A jegyszám előállítókat elkülönülő azonosítók létrehozásához használják az új jegyekhez, amelyeket jegyszámnak neveznek. Bármilyen metódus lehetséges a számok karakterláncainak létrehozásához, de a józan ész határain belül kell maradnia az eredményül kapott szöveg hosszával kapcsolatban (irányelv: 5-10).
zh_cn: 票号生成器用于创建不同的标识符，即新票证的票号。 任何创建数字串的方法都是可能的，你应该使用关于结果字符串长度的常识（参考：5-10）。

source: When creating a ticket number, make sure the result is prefixed by the system configuration variable ``SystemID`` in order to enable the detection of ticket numbers on inbound email responses. A ticket number generator module needs the two functions ``TicketCreateNumber()`` and ``GetTNByString()``.
hu: Egy jegyszám létrehozásakor győződjön meg arról, hogy az eredmény megkapta-e a ``SystemID`` rendszerbeállítási változót előtagként annak érdekében, hogy engedélyezze a jegyszámok felismerését a bejövő e-mail válaszoknál. Egy jegyszám előállító modulnak a következő két függvényre van szüksége: ``TicketCreateNumber()`` és ``GetTNByString()``.
zh_cn: 创建工单编号时，请确保结果以系统配置变量 ``SystemID`` 为前缀，以便检测入站电子邮件响应中的工单编号。 工单编号生成器模块需要两个函数 ``TicketCreateNumber()`` 和 ``GetTNByString()``。

source: The method ``TicketCreateNumber()`` is called without parameters and returns the new ticket number.
hu: A ``TicketCreateNumber()`` metódus paraméterek nélkül kerül meghívásra, és az új jegyszámot adja vissza.
zh_cn: 不带参数调用 ``TicketCreateNumber()`` 方法，并返回新的工单编号。

source: The method ``GetTNByString()`` is called with the param ``String`` which contains the string to be parsed for a ticket number and returns the ticket number if found.
hu: A ``GetTNByString()`` metódus egy olyan ``String`` paraméterrel kerül meghívásra, amely a feldolgozandó szöveget tartalmazza a jegyszámnál, és visszaadja a jegyszámot, ha megtalálta.
zh_cn: 使用 ``String`` 参数调用 ``GetTNByString()`` 方法，其中包含要为工单编号解析的字符串，如果找到则返回工单编号。

source: Ticket Number Generator Code Example
hu: Jegyszám előállító kódpélda
zh_cn: 工单编号生成器代码示例

source: See files in ``Kernel/System/Ticket/Number`` folder of the source code.
hu: Nézze meg a forráskód ``Kernel/System/Ticket/Number`` mappájában lévő fájlokat.
zh_cn: 请参见源代码的 ``Kernel/System/Ticket/Number`` 目录中的文件。

source: Ticket Number Generator Configuration Example
hu: Jegyszám előállító beállítási példa
zh_cn: 工单编号生成器配置示例

source: See settings in ``Kernel/Config/Files/XML/Ticket.xml`` started with the name ``Ticket::NumberGenerator``.
hu: Nézze meg a ``Kernel/Config/Files/XML/Ticket.xml`` fájlban azokat a beállításokat, amelyek neve ``Ticket::NumberGenerator`` előtaggal kezdődik.
zh_cn: 请参见 ``Kernel/Config/Files/XML/Ticket.xml`` 中以名称 ``Ticket::NumberGenerator`` 开头的设置。

source: Ticket Number Generator Use Case Example
hu: Jegyszám előállító használati eset példa
zh_cn: 工单编号生成器用例示例

source: Ticket numbers should follow a specific scheme
hu: A jegyszámoknak egy bizonyos sémát kell követniük
zh_cn: 工单编号应遵循特定方案

source: You will need to create a new ticket number generator if the default modules don't provide the ticket number scheme you'd like to use.
hu: Akkor kell majd egy új jegyszám előállítót létrehoznia, ha az alapértelmezett modulok nem biztosítják azt a jegyszám sémát, amelyet használni szeretne.
zh_cn: 如果默认模块未提供您要使用的工单编号方案，则需要创建新的工单编号生成器。

source: You should stick to the code of ``GetTNByString()`` as used in existing ticket number generators to prevent problems with ticket number parsing. Also the routine to detect a loop in ``TicketCreateNumber()`` should be kept intact to prevent duplicate ticket numbers.
hu: Ragaszkodnia kell a meglévő jegyszám előállítókban használt ``GetTNByString()`` kódjához, hogy megelőzze a jegyszám feldolgozással kapcsolatos problémákat. A ``TicketCreateNumber()`` metódusban lévő hurok felismeréséhez használt rutint is érintetlenül kell hagynia a kettőzött jegyszámok megelőzéséhez.
zh_cn: 你应该坚持现有工单编号生成器中使用的 ``GetTNByString()`` 代码，以防止工单编号解析出现问题。 此外，检测 ``TicketCreateNumber()`` 中循环的程序应保持不变，以防止重复的工单编号。

source: Writing A New OTRS Front End Component
hu: Egy új OTRS előtétprogram összetevő írása
zh_cn: 编写新的OTRS前端组件

source: In this example, we will try to write a new OTRS front end component. Starting with OTRS 7, the framework supports single page application front ends written in Vue.js and based on a new JavaScript toolchain. First iteration contains the new external interface, for which we will try to write a custom component. You will need to have a running OTRS :doc:`../get-started/development-environment` as specified in the chapter of the same name.
hu: Ebben a példában megpróbálunk megírni egy új OTRS előtétprogram összetevőt. Az OTRS 7-tel kezdve a keretrendszer támogatja a Vue.js-ben írt és egy új JavaScript eszközláncon alapuló egyoldalas alkalmazás előtétprogramokat. Az első megközelítés az új külső felületet tartalmazza, amelyhez megpróbálunk egy egyéni összetevőt írni. Szüksége lesz egy futó OTRS :doc:`../get-started/development-environment` meglétére, amint az a hasonló nevű fejezetben meg van határozva.
zh_cn: 在这个例子中，我们将尝试编写一个新的OTRS前端组件。 从OTRS 7开始，OTRS框架支持用Vue.js编写的单页面应用程序前端，并基于新的JavaScript工具链。 第一次迭代包含新的外部接口，我们将尝试编写自定义组件。 您需要有一个正在运行的OTRS :doc:`../get-started/development-environment`，如开发环境部分所述。

source: The Goal
hu: A cél
zh_cn: 目标

source: We want to write a small front end component that displays the text *Hello World* when called up. This will be a route component, meaning it will be available in the external interface when called with a carefully crafted URL.
hu: Szeretnénk írni egy kis előtétprogram összetevőt, amely a *Helló, Világ!* szöveget jeleníti meg, amikor meghívják. Ez egy útvonal összetevő lesz, amely azt jelenti, hogy elérhető lesz a külső felületen, amikor meghívják egy gondosan kialakított URL-lel.
zh_cn: 我们想要编写一个小的前端组件，在调用时显示文本 *Hello World*。 这将是一个路由组件，这意味着当使用精心设计的URL调用时，它将在外部人员界面中可用。

source: Using The Skeleton Command
hu: A csontváz parancs használata
zh_cn: 使用Skeleton命令

source: To speed up the development, we should use a skeleton command to get a boilerplate template file which we can build upon.
hu: A fejlesztés gyorsításához egy csontváz parancsot kell használnunk egy gyakran használt sablonfájl beszerzéséhez, amelyre építkezhetünk.
zh_cn: 为了加快开发速度，我们应该使用skeleton命令来获取我们可以构建的样板模板文件。

source: On a running OTRS instance, call the following command to generate the template. We will use ``HelloWorld`` as the name of our new component:
hu: Egy futó OTRS példányon hívja meg a következő parancsot a sablon előállításához. A ``HelloWorld`` értéket fogjuk használni az új összetevőnk neveként:
zh_cn: 在正在运行的OTRS实例上，调用以下命令以生成模板。 我们将使用 ``HelloWorld`` 作为新组件的名称：

source: In the command ``--component-directory`` is the directory of your module, ``--component-subdirectory`` path under ``Frontend/`` folder that will house the component file. For now, use ``--no-docs`` switch to skip creation of the documentation component for the design system.
hu: A parancsban a ``--component-directory`` a modul könyvtára, a ``--component-subdirectory`` a ``Frontend/`` mappa alatti útvonal, amely otthont ad az összetevőfájlnak. Most használja a ``--no-docs`` kapcsolót, hogy kihagyja a dokumentációs összetevő létrehozását a megjelenítési rendszernél.
zh_cn: 在命令中 ``--component-directory`` 是你的模块的目录，在 ``Frontend/`` 文件夹下的 ``--component-subdirectory`` 路径，将容纳组件文件。 现在，使用 ``--no-docs`` 开关跳过设计系统的文档组件的创建。

source: This command will generate two files with following paths:
hu: Ez a parancs két fájlt fog előállítani a következő útvonalakkal:
zh_cn: 此命令将生成具有以下路径的两个文件：

source: The Route Configuration
hu: Az útvonal beállítása
zh_cn: 路由配置

source: In order to allow the route in the external interface application, we need to add a correct route configuration that points to our component. Therefore we create a file ``Kernel/Config/Files/XML/HelloWorld.xml`` with following definition:
hu: Ahhoz, hogy lehetővé tegye az útvonalat a külső felület alkalmazásának, hozzá kell adnunk egy helyes útvonal-beállítást, amely az összetevőnkre mutat. Emiatt létrehozunk egy ``Kernel/Config/Files/XML/HelloWorld.xml`` fájlt a következő meghatározásokkal:
zh_cn: 为了允许外部人员界面应用程序路由，我们需要添加指向组件的正确路由配置。 因此，我们使用以下定义创建文件 ``Kernel/Config/Files/XML/HelloWorld.xml``：

source: ``Group`` and ``GroupRo`` can be used to limit the route screen to users with certain groups. Please note that this only concerns the authenticated customer users.
hu: A ``Group`` és ``GroupRo`` használható az útvonal képernyő korlátozásához azokra a felhasználókra, akik bizonyos csoportba tartoznak. Ne feledje, hogy ez csak a hitelesített ügyfél-felhasználókra vonatkozik.
zh_cn: ``Group`` 和 ``GroupRo`` 可用于限制具有特定组的用户的路由屏幕。 请注意，这仅涉及经过身份验证的客户用户。
