Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: After you finished your changes and committed them, push your branch to GitHub.
hu: A változtatások befejezése és a véglegesítésük után küldje be az ágat a GitHubra.
zh_cn: 完成更改并提交更改后，将分支推送到GitHub。

source: Create a pull request. The OTRS dev team will be notified about this, check your pull request and either merge it or give you some feedback about possible improvements.
hu: Hozzon létre egy beolvasztási kérést. Az OTRS fejlesztőcsapata értesülni fog erről, ellenőrizni fogják a beolvasztási kérését, és beolvasszák azt, vagy valamilyen visszajelzést adnak a lehetséges továbbfejlesztésekről.
zh_cn: 创建一个"pull request"， OTRS开发团队将会收到通知，并检查您的"pull request"，要么合并更改，要么给您一些关于可能的改进的反馈。

source: It might sound complicated, but once you have this workflow set up you'll see that making contributions is extremely easy.
hu: Ez esetleg bonyolultan hangzik, de miután beállította ezt a munkafolyamatot, látni fogja, hogy a hozzájárulások elvégzése hihetetlenül egyszerű.
zh_cn: 这可能听起来很复杂，但一旦你设置了这个工作流程，你会看到做出贡献非常简单。

source: Translating
hu: Fordítás
zh_cn: 翻译

source: The translations are contributed and maintained mainly by OTRS users, so *your* help is needed.
hu: A fordításokat többnyire az OTRS felhasználói készítik el és tartják karban, ezért az *Ön* segítsége is szükséges.
zh_cn: 翻译主要由OTRS用户提供和维护，因此需要 *您的* 帮助。

source: All translations of the OTRS GUI, the public extension modules and the documentations are managed using `Weblate <https://translate.otrs.com/>`__.
hu: Az OTRS grafikus felhasználói felületének, a nyilvános kiterjesztőmoduloknak és a dokumentációknak az összes fordítását `Weblate <https://translate.otrs.com/>`__ használatával kezelik.
zh_cn: OTRS 图形界面、公共扩展模块和文档的所有翻译都通过 `Weblate <https://translate.otrs.com/>`__ 进行管理。

source: To contribute to translations:
hu: A fordításban való közreműködéshez:
zh_cn: 为翻译做出贡献：

source: Sign up for a free translator account on `Weblate <https://translate.otrs.com/>`__.
hu: Regisztráljon egy ingyenes fordítói fiókot a `Weblate-en <https://translate.otrs.com/>`__.
zh_cn: 在 `Weblate <https://translate.otrs.com/>`__ 注册一个免费的翻译帐户。

source: Select a translation component and your language for translation.
hu: Válasszon egy fordítási összetevőt és egy nyelvet a fordításhoz.
zh_cn: 选择翻译组件和要翻译的语言。

source: Start updating your translation. No additional software or files required.
hu: Kezdje el frissíteni a fordítást. Nincs szükség további szoftverekre vagy fájlokra.
zh_cn: 开始更新您的翻译。 无需其它软件或文件。

source: If your language is not listed in the dashboard, you can request a language. After it is approved, you can start translating.
hu: Ha a nyelve nincs felsorolva a vezérlőpulton, akkor kérelmezhet egy nyelvet. Az elfogadása után el is kezdheti a fordítást.
zh_cn: 如果仪表板中未列出您的语言，则可以请求一门语言。经批准后，您就可以开始翻译。

source: From OTRS 7 the documentations are available in *reStructuredText* format, that replaced the old *DocBook* format. Be careful not to break the structure while translating the documentation.
hu: Az OTRS 7-től kezdve a dokumentációk *reStructuredText* formátumban érhetők el, amely a régi *DocBook* formátumot cseréli le. Legyen óvatos, nehogy elrontsa a szerkezetet a dokumentum fordítása során.
zh_cn: 从OTRS 7开始，文档以 *reStructuredText* 格式提供，取代了旧的 *DocBook* 格式。 翻译文档时请注意不要破坏结构。

source: You can find some examples in the :doc:`../documentation` chapter.
hu: A :doc:`../documentation` fejezetben találhat néhány példát.
zh_cn: 您可以在 :doc:`../documentation` 一章中找到一些示例。

source: The OTRS developers will download the translations from time to time into the OTRS source code repositories, you don't have to submit them anywhere.
hu: Az OTRS fejlesztői időről időre le fogják tölteni a fordításokat az OTRS forráskód tárolóiba, így nem kell semmit sem elküldenie sehova.
zh_cn: OTRS开发人员会不时将翻译下载到OTRS源代码库中，您无需在任何地方提交。

source: User Interface Design
hu: Felhasználó felület tervezése
zh_cn: 用户界面设计

source: Capitalization
hu: Nagybetűs írás
zh_cn: 字母大写样式

source: This section talks about how the different parts of the English user interface should be capitalized. For further information, you may want to review `this helpful page <https://msdn.microsoft.com/en-us/library/dn742478.aspx>`__.
hu: Ez a szakasz azt mutatja be, hogy az angol felhasználói felület különböző részeit hogyan kell nagybetűsen írni. További információkért érdemes átnézni `ezt a hasznos oldalt <https://msdn.microsoft.com/en-us/library/dn742478.aspx>`__.
zh_cn: 本节讨论如何将英语用户界面的不同部分大写。 有关详细信息，您可能需要查看 `这个有用的页面 <https://msdn.microsoft.com/en-us/library/dn742478.aspx>`__。

source: Headings (h1-h6) and titles (names, such as *Queue View*) are set in *title style* capitalization, that means all first letters will be capitalized (with a few exceptions such as *this*, *and*, *or* etc.).
hu: A címsorok (h1-h6) és a címek (nevek, mint például *Queue View*) *címstílusú* nagy kezdőbetűs írásmódban vannak, amely azt jelenti, hogy az összes első betű nagybetűvel lesz írva (néhány kivétellel, mint például *this*, *and*, *or*, stb.).
zh_cn: 标题（h1-h6）和标题（名称，如 *队列视图*）设置为 *标题样式* 大小写，这意味着所有首字母都将大写（少数例外情况，如 *this* 、*and*、*or* 等）。

source: Examples:
hu: Példák:
zh_cn: 例子：

source: *Action List*
hu: *Műveletlista*

source: *Manage Customer-Group Relations*
hu: *Ügyfél–Csoport kapcsolatok kezelése*
zh_cn: *管理客户-组的关联*

source: Other structural elements such as buttons, labels, tabs, menu items are set in *sentence style* capitalization (only the first letter of a phrase is capitalized), but no final dot is added to complete the phrase as a sentence.
hu: Az egyéb szerkezeti elemek (mint például gombok, címkék, lapok, menüpontok) *mondatstílusú* nagy kezdőbetűs írásmódban vannak (csak a kifejezés első betűje van nagybetűvel írva), de nincs lezáró pont hozzáadva a kifejezés mondatként való befejezéséhez.
zh_cn: 按钮、标签、选项卡、菜单项等其它结构元素以 *句子样式* 大写形式设置（只有短语的第一个字母大写），但不添加最后一个点以完成句子形式的短语。

source: *First name*
hu: *Utónév*
zh_cn: *名*

source: *Select queue refresh time*
hu: *Várólista frissítési idejének kiválasztása*
zh_cn: *选择队列刷新时间*

source: *Print this ticket*
hu: *Jegy nyomtatása*
zh_cn: *打印此工单*

source: Descriptive texts and tooltip contents are written as complete sentences.
hu: A leíró szövegek és a buboréksúgó tartalmak teljes mondatként vannak írva.
zh_cn: 描述性文本和提示内容被写为完整句子。

source: Example:
hu: Példa:
zh_cn: 例如：

source: *This value is required.*
hu: *Ez a mező kötelező.*
zh_cn: *此值为必填项。*

source: For translations, it has to be checked if the title style capitalization is also appropriate in the target language. It might have to be changed to sentence style capitalization or something else.
hu: A fordításoknál ellenőrizni kell, hogy címstílusú nagybetűs írás megfelelő-e a célnyelven is. Lehet, hogy meg kell változtatni mondatstílusú nagybetűs írásra vagy valami másra.
zh_cn: 翻译时必须检查标题大写样式是否也适合目标语言， 它可能需要改为句子大写样式或别的。

source: Unit Tests
hu: Egységtesztek
zh_cn: 单元测试

source: OTRS provides a test suite which can be used to develop and run unit tests for all system related code.
hu: Az OTRS biztosít egy tesztelési alkalmazáscsomagot, amely egységtesztek fejlesztéséhez és futtatásához használható az összes rendszerrel kapcsolatos kódnál.
zh_cn: OTRS提供了一个测试套件，可用于开发和运行所有系统相关代码的单元测试。

source: Creating a Test File
hu: Egy tesztfájl létrehozása
zh_cn: 创建一个测试文件

source: The test files are stored in ``.t`` files under ``scripts/test/*.t``. For example, let's take a look at the file ``scripts/test/Calendar.t`` for the *Calendar* class.
hu: A tesztfájlok ``.t`` fájlokban vannak tárolva a ``scripts/test/*.t`` helyen. Például vessünk egy pillantást a ``scripts/test/Calendar.t`` fájlra a naptár osztálynál.
zh_cn: 测试文件存储在 ``scripts/test/*.t`` 下的 ``.t`` 文件中。例如，让我们看一下 *calendar（日历）* 类的文件 ``scripts/test/calendar.t`` 。

source: Every test file should ideally instantiate unit test helper object at the start, so it can benefit from some built-in methods provided by it:
hu: Minden tesztfájlnak ideális esetben példányosítania kell az egységteszt segítő objektumot az elején, így részesülhet néhány beépített metódusból, amelyet az biztosít:
zh_cn: 每个测试文件都应该在开始时实例化单元测试helper对象，以便它可以从它提供的一些内置方法中受益：

source: By providing ``RestoreDatabase`` parameter to helper constructor, any database statement executed during the unit test will be rolled back at the end, making sure no permanent change has been done.
hu: A ``RestoreDatabase`` paraméternek a segítő konstruktor számára történő átadásával az egységteszt közben végrehajtott bármely adatbázis-utasítás vissza lesz állítva a végén, ezáltal azt biztosítva, hogy ne történjen végleges változtatás.
zh_cn: 通过向helper构造函数提供 ``RestoreDatabase`` 参数，在单元测试期间执行的任何数据库语句都将在结束时回滚，确保没有进行永久性更改。

source: Like any other test suite, OTRS provides assertion methods which can be used to test conditions. For example, this is how we create a test user and test that it has been indeed created:
hu: Mint bármely egyéb tesztelési alkalmazáscsomag, az OTRS is biztosít állítás metódusokat, amelyek a feltételek teszteléséhez használhatók. Például it az látható, hogy hogyan hozunk létre egy teszt felhasználót, és hogyan teszteljük le, hogy valóban létrejött:
zh_cn: 像任何其它测试套件一样，OTRS提供了可用于测试条件的断言方法。 例如，下面就是我们如何创建测试用户并测试它确实已经创建的：

source: Please consult API section below for complete list of assertion methods.
hu: Nézze meg a lenti API szakaszt az állítás metódusok teljes listájáért.
zh_cn: 有关断言方法的完整列表，请参阅下面的API部分。

source: It's always good practice to create random data in unit tests, which can help distinguish it from previously added data. Use random methods from API to get the strings and include them in your parameters:
hu: Mindig jó gyakorlat véletlenszerű adatokat létrehozni az egységtesztekben, ami segíthet megkülönböztetni az előzőleg hozzáadott adatoktól. Használja a véletlen metódusokat az API-ból, hogy megkapja a karakterláncokat, és beágyazza azokat a paraméterekbe:
zh_cn: 在单元测试中创建随机数据总是一个很好的做法，这可以帮助将它与以前添加的数据区分开来。 使用API中的随机方法获取字符串并将其包含在你的参数中：

source: Good developers make their unit test easy to maintain. Consider putting all test cases in an array and then iterate over them with some code. This will provide an easy way to extend the test later:
hu: A jó fejlesztők az egységtesztjeiket könnyen karbantarthatóvá teszik. Fontolja meg az összes teszteset egy tömbbe történő elhelyezését, majd lépkedjen végig azokon valamilyen kóddal. Ez egyszerű módot fog biztosítani a teszt későbbi bővítéséhez:
zh_cn: 优秀的开发人员使他们的单元测试易于维护。 考虑将所有的测试用例放在一个数组中，然后用一些代码对它们进行迭代。 这将为以后扩展测试提供一个简单的方法：

source: Prerequisites for Testing
hu: Előfeltételek a teszteléshez
zh_cn: 测试的先决条件

source: To be able to run the unit tests, you need to have all optional environment dependencies (Perl modules and other modules) installed, except those for different database back ends than what you are using. Run ``bin/otrs.CheckEnvironment.pl`` to verify your module installation.
hu: Hogy képes legyen lefuttatni az egységteszteket, arra van szüksége, hogy az összes választható környezeti függőség (Perl-modulok és egyéb modulok) telepítve legyen, kivéve azokat, amelyek az Ön által használt adatbázis háttérprogramoktól eltérőkhöz valók. Futtassa a ``bin/otrs.CheckEnvironment.pl`` parancsfájlt a modultelepítés ellenőrzéséhez.
zh_cn: 为了能够运行单元测试，您需要安装所有可选的环境依赖项（Perl模块和其它模块），除了那些用于不同数据库后端的依赖项以外。运行 ``bin/otrs.checkenvironment.pl`` 验证模块安装。

source: You also need to have an instance of the OTRS web front end running on the FQDN that is configured in your local OTRS's ``Config.pm`` file. This OTRS instance must use the same database that is configured for the unit tests.
hu: Szüksége van egy teljes képzésű tartományneven (FQDN) futó OTRS webes előtétprogram egy példányára, amely az OTRS helyi ``Config.pm`` fájljában be van állítva. Ennek az OTRS példánynak ugyanazt az adatbázist kell használnia, amelyek az egységtesztekhez vannak beállítva.
zh_cn: 您还需要在本地OTRS的 ``Config.pm`` 文件中配置的FQDN上运行OTRS Web前端的实例。此OTRS实例必须使用为单元测试配置的相同数据库。

source: Testing
hu: Tesztelés
zh_cn: 测试

source: To run your tests, just use ``bin/otrs.Console.pl Dev::UnitTest::Run --test Calendar`` to use ``scripts/test/Calendar.t``.
hu: A tesztek futtatásához egyszerűen használja a ``bin/otrs.Console.pl Dev::UnitTest::Run --test Calendar`` parancsot a ``scripts/test/Calendar.t`` fájl használatához.
zh_cn: 若要运行你的测试，只需执行 ``bin/otrs.Console.pl Dev::UnitTest::Run --test Calendar`` 即可使用 ``scripts/test/Calendar.t``。

source: You can even run several tests at once, just supply additional ``--test`` arguments to the command:
hu: Akár több tesztet is lefuttathat egyszerre, csak adjon meg további ``--test`` argumentumokat a parancsnak:
zh_cn: 您甚至可以一次运行多个测试，只需为命令提供额外的 ``--test`` 参数：

source: If you execute ``bin/otrs.Console.pl Dev::UnitTest::Run`` without any argument, it will run all tests found in the system. Please note that this can take some time to finish.
hu: Ha argumentumok nélkül hajtja végre a ``bin/otrs.Console.pl Dev::UnitTest::Run`` parancsot, akkor le fogja futtatni a rendszeren található összes tesztet. Ne feledje, hogy ez eltarthat egy ideig, amíg befejeződik.
zh_cn: 如果你不带任何参数执行 ``bin/otrs.Console.pl Dev::UnitTest::Run`` ，它将运行系统中找到的所有测试。请注意，这可能需要一些时间才能完成。

source: Provide ``--verbose`` argument in order to see messages about successful tests too. Any errors encountered during testing will be displayed regardless of this switch, provided they are actually raised in the test.
hu: Adja meg a ``--verbose`` argumentumot annak érdekében, hogy láthassa a sikeres tesztekkel kapcsolatos üzeneteket is. A teszt során előforduló bármilyen hiba megjelenítésre kerül függetlenül ettől a kapcsolótól, és biztosítva lesz, hogy azok ténylegesen felvételre kerülnek a tesztbe.
zh_cn: 还提供 ``--verbose`` 参数，以便查看有关成功测试的消息。测试过程中遇到的任何错误都将显示出来，只要它们在测试中被实际引发，而不管是否有这个开关。

source: Unit Test API
hu: Egységteszt API
zh_cn: 单元测试API

source: OTRS provides API for unit testing that was used in the previous example. Here we'll list the most important functions, please also see the online API reference of ```Kernel::System::UnitTest`` <https://otrs.github.io/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest.pm.html>`__.
hu: Az OTRS API-t biztosít az egységteszteléshez, amely az előző példában volt használva. Itt fel fogjuk sorolni a legfontosabb függvényeket, de nézze meg a ```Kernel::System::UnitTest`` <https://otrs.github.io/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest.pm.html>`__ internetes API hivatkozását is.
zh_cn: OTRS为上一个示例中使用的单元测试提供API。在这里，我们将列出最重要的函数，请参阅 `Kernel::System::UnitTest <https://otrs.github.io/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest.pm.html>`__ 的在线API参考。

source: This function tests whether given scalar value is a true value in Perl.
hu: Ez a függvény azt teszteli, hogy a megadott skalár érték igaz érték-e a Perlben.
zh_cn: 这个函数测试给定的标量值在Perl中是否为真值。

source: This function tests whether given scalar value is a false value in Perl.
hu: Ez a függvény azt teszteli, hogy a megadott skalár érték hamis érték-e a Perlben.
zh_cn: 这个函数测试给定的标量值在Perl中是否为假值。

source: This function tests whether the given scalar variables are equal.
hu: Ez a függvény azt teszteli, hogy a megadott skalár változók egyenlők-e.
zh_cn: 这个函数测试给定的标量变量是否相等。

source: This function tests whether the given scalar variables are unequal.
hu: Ez a függvény azt teszteli, hogy a megadott skalár változók nem egyenlők-e.
zh_cn: 这个函数测试给定的标量变量是否不相等。

source: This function compares complex data structures for equality. ``$A`` and ``$B`` have to be references.
hu: Ez a függvény összetett adatszerkezeteket hasonlít össze az egyenlőséghez. ``$A`` és ``$B`` hivatkozás kell legyen.
zh_cn: 这个函数比较复杂的数据结构是否相等。``$A`` 和 ``$B`` 必须是引用。

source: This function compares complex data structures for inequality. ``$A`` and ``$B`` have to be references.
hu: Ez a függvény összetett adatszerkezeteket hasonlít össze a nem egyenlőséghez. ``$A`` és ``$B`` hivatkozás kell legyen.
zh_cn: 这个函数比较复杂的数据结构是否不相等。 ``$A`` 和 ``$B`` 必须是引用。

source: Besides this, unit test helper object also provides some helpful methods for common test conditions. For full reference, please see the online API reference of ```Kernel::System::UnitTest::Helper`` <https://doc.otrs.com/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest/Helper.pm.html>`__.
hu: Emellett az egységteszt segítő objektum biztosít néhány hasznos metódust is a gyakori tesztelési feltételekhez. A teljes hivatkozásért nézze meg a ```Kernel::System::UnitTest::Helper`` <https://doc.otrs.com/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest/Helper.pm.html>`__ internetes API hivatkozását.
zh_cn: 除此之外，单元测试helper对象还为常见的测试条件提供了一些有用的方法。 如需完整参考，请参阅 `Kernel::System::UnitTest::Helper <https://doc.otrs.com/doc/api/otrs/7.0/Perl/Kernel/System/UnitTest/Helper.pm.html>`__ 的在线API参考。

source: This function creates a random ID that can be used in tests as a unique identifier. It is guaranteed that within a test this function will never return a duplicate.
hu: Ez a függvény előállít egy véletlenszerű azonosítót, amely egyedi azonosítóként használható a tesztekben. Garantált, hogy egy teszten belül ez a függvény soha nem ad vissza kettőzött értéket.
zh_cn: 这个函数创建一个随机ID，可以在测试中用作唯一标识符。 这可以保证在一个测试内，这个函数永远不会返回一个重复。

source: Please note that these numbers are not really random and should only be used to create test data.
hu: Ne feledje, hogy ezek a számok nem valódi véletlen számok, és csak tesztadatok előállításához szabad használni.
zh_cn: 请注意，这些数字并不是真正的随机数，只能用于创建测试数据。

source: This function creates a test user that can be used in tests. It will be set to invalid automatically during the destructor. It returns the login name of the new user, the password is the same.
hu: Ez a függvény létrehoz egy teszt felhasználót, amely használható a tesztekben. Automatikusan érvénytelenre lesz állítva a destruktor közben. Visszaadja az új felhasználó bejelentkezési nevét, a jelszó pedig ugyanaz lesz.
zh_cn: 这个函数创建一个可以在测试中使用的测试用户。 它将在析构函数中自动设置为无效。 它返回新用户的登录名，密码与用户名相同。

source: This functions makes it possible to override the system time as long as this object lives. You can pass an optional time parameter that should be used, if not, the current system time will be used.
hu: Ez a függvény lehetővé teszi a rendszeridő felülbírálását egészen addig, amíg az objektum él. Átadhat egy elhagyható időparamétert, amelyet használni kell. Ha nincs átadva, akkor az aktuális rendszeridő lesz használva.
zh_cn: 只要此对象存在，这个函数就可以覆盖系统时间。 你可以传递要使用的可选时间参数，如果没有参数，则会使用当前系统时间。

source: All calls to methods of ``Kernel::System::Time`` and ``Kernel::System::DateTime`` will use the given time afterwards.
hu: A ``Kernel::System::Time`` és a ``Kernel::System::DateTime`` metódusainak összes meghívása a megadott időt fogja használni ezután.
zh_cn: 对 ``Kernel::System::Time`` 和 ``Kernel::System::DateTime`` 方法的所有调用都将使用给定的时间。

source: This functions restores the regular system time behavior.
hu: Ez a függvény visszaállítja a rendes rendszeridő viselkedést.
zh_cn: 这个函数恢复常规的系统时间行为。

source: This functions adds a number of seconds to the fixed system time which was previously set by ``FixedTimeSet()``. You can pass a negative value to go back in time.
hu: Ez a függvény valamennyi másodpercet ad ahhoz a rögzített rendszeridőhöz, amelyet a ``FixedTimeSet()`` korábban beállított. Átadhat negatív értéket, hogy visszamenjen az időben.
zh_cn: 这个函数为固定时间增加几秒钟，这个时间先前由 ``FixedTimeSet()`` 设置。 您可以通过一个负值返回之前的时间。

source: This functions temporarily changes a configuration setting system wide to another value, both in the current instance of the ``ConfigObject`` and also in the system configuration on disk. This will be reset when the ``Helper`` object is destroyed.
hu: Ez a függvény átmenetileg rendszerszinten megváltoztat egy rendszerbeállítást egy másik értékre mind a ``ConfigObject`` aktuális példányában, mind a rendszerbeállításokban is a lemezen. Akkor lesz visszaállítva, amikor a ``Helper`` objektum megsemmisül.
zh_cn: 这个函数临时将系统范围内的配置设置更改为另一个值，既在 ``ConfigObject`` 的当前实例中，也在磁盘上的系统配置中。当 ``Helper`` 对象被销毁时，这将被重置。

source: Please note that this will not work correctly in clustered environments.
hu: Ne feledje, hogy ez jelenleg nem működik fürtözött környezetekben.
zh_cn: 请注意，这个函数在集群环境中无法正常工作。

source: This function will temporarily include custom code in the system. For example, you may use this to redefine a subroutine from another class. This change will persist for remainder of the test. All code will be removed when the ``Helper`` object is destroyed.
hu: Ez a függvény átmenetileg egyéni kódot fog felvenni a rendszerbe. Például ezt használhatja egy másik osztályból származó szubrutin felüldefiniálásához. Ez a változtatás megmarad a teszt emlékeztetőjénél is. Az összes kód eltávolításra kerül, amikor a ``Helper`` objektum megsemmisül.
zh_cn: 这个函数将在系统中临时包含自定义代码。例如，可以使用它从另一个类重新定义子程序。此更改将在测试的其余部分持续。当 ``Helper`` 对象被销毁时，所有代码都将被删除。

source: This function will provide a temporary database for the test. Please first define test database settings in ``Kernel/Config.pm``, i.e:
hu: Ez a függvény egy átmeneti adatbázist fog biztosítani a teszthez. Először határozza meg a teszt adatbázis beállításait a ``Kernel/Config.pm`` fájlban, azaz:
zh_cn: 这个函数将为测试提供临时数据库。请首先在 ``Kernel/Config.pm`` 中定义测试数据库设置，如：

source: The method call will override global database configuration for duration of the test, i.e. temporary database will receive all calls sent over system ``DBObject``.
hu: A metódushívás felül fogja bírálni a globális adatbázis-beállítást a teszt időtartama alatt, azaz az átmeneti adatbázis fogja fogadni az összes olyan hívást, amelyet a ``DBObject`` rendszer küldött át.
zh_cn: 方法调用将在测试期间覆盖全局数据库配置，即临时数据库将接收通过系统 ``DBObject`` 发送的所有调用。

source: All database contents will be automatically dropped when the ``Helper`` object is destroyed.
hu: Az összes adatbázis-tartalom automatikusan eldobásra kerül, amikor a ``Helper`` objektum megsemmisül.
zh_cn: 当 ``Helper`` 对象被销毁时，所有数据库内容都将自动删除。

source: This method returns ``undef`` in case the test database is not configured. If it is configured, but the supplied XML cannot be read or executed, this method will ``die()`` to interrupt the test with an error.
hu: Ez a metódus ``undef`` értéket ad vissza abban az esetben, ha a teszt adatbázis nincs beállítva. Ha be van állítva, de a mellékelt XML nem olvasható vagy nem hajtható végre, akkor a metódus ``die()`` függvénye lesz meghívva a teszt hibával történő megszakításához.
zh_cn: 如果未配置测试数据库，此方法将返回 ``undef`` 。 如果它已配置，但无法读取或执行提供的XML，则此方法将调用 ``die()`` 以中断测试并显示错误。

source: Documentation
hu: Dokumentáció
zh_cn: 文档

source: From OTRS 7 the documentations are available in *reStructuredText* format, that replaced the old *DocBook* format. Various outputs are available on the `OTRS documentation page <https://doc.otrs.com/doc/index.html>`__, like HTML, EPUB and PDF.
hu: Az OTRS 7-től kezdve a dokumentációk *reStructuredText* formátumban érhetők el, amely a régi *DocBook* formátumot cseréli le. Különféle kimenetek érhetők el az `OTRS dokumentációs oldalán <https://doc.otrs.com/doc/index.html>`__, mint például HTML, EPUB és PDF.
zh_cn: 从OTRS 7开始，文档以 *reStructuredText* 格式提供，取代了旧的 *DocBook* 格式。 在 `OTRS文档页面 <https://doc.otrs.com/doc/index.html>`__ 上可以获得各种输出格式，如HTML、EPUB和PDF。

source: The documentation is written in English and translated into many languages.
hu: A dokumentációt angol nyelven írták, és több nyelvre is le van fordítva.
zh_cn: 文档是用英语编写的，并翻译成多种语言。

source: Documentation Infrastructure
hu: Dokumentációs infrastruktúra
zh_cn: 文档基础架构

source: OTRS uses `Sphinx <http://www.sphinx-doc.org/>`__ to generate the outputs. The HTML output is generated using the `Read the Docs <https://readthedocs.org/>`__ theme.
hu: Az OTRS a `Sphinx <http://www.sphinx-doc.org/>`__ programot használja a kimenetek előállításához. A HTML kimenet a `Read the Docs <https://readthedocs.org/>`__ téma használatával kerül előállításra.
zh_cn: OTRS使用 `Sphinx <http://www.sphinx-doc.org/>`__ 生成输出。 HTML输出是使用 `Read the Docs <https://readthedocs.org/>`__ 主题生成的。
