Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: A special area of accessibility problems are dynamic changes in the user interface, either by JavaScript or also by AJAX calls. The screen reader will not tell the user about changes without special precautions. This is a difficult topic and cannot yet be completely explained here.
hu: Az akadálymentesítési problémák egy különleges területe a dinamikus változtatások a felhasználói felületen, amelyeket JavaScript vagy AJAX hívások okoznak. A képernyőolvasó nem fog beszélni a felhasználónak a változtatásokról különleges óvintézkedések nélkül. Ez egy bonyolult téma, és még nem lehet itt teljesen elmagyarázni.
zh_cn: 无障碍环境问题的一个特殊领域是用户界面中的动态更改，可以是JavaScript，也可以是AJAX调用。 如果没有特殊的预防措施，屏幕阅读器不会告诉用户有关变化。 这是一个困难的话题，这里还不能完全解释。

source: *Rule*: Always use the validation framework ``OTRS.Validate`` for form validation.
hu: *Szabály*: Mindig használja az ``OTRS.Validate`` érvényesítő keretrendszert az űrlap érvényesítéséhez.
zh_cn: *规则*：始终使用验证框架 ``OTRS.Validate`` 进行表单验证。

source: This will make sure that the error tooltips are being read by the screen reader. That way the blind user a) knows the item which has an error and b) get a text describing the error.
hu: Ez biztosítani fogja, hogy a hiba buboréksúgókat felolvassa a képernyőolvasó. Ily módon a vak felhasználó a) megtudja azt az elemet, amelynek hibája van, és b) kap egy szöveget, amely leírja a hibát.
zh_cn: 这将确保屏幕阅读器读取错误提醒。这样，盲人用户 a）知道有错误的项目，b）得到描述错误的文本。

source: *Rule*: Use the function ``OTRS.UI.Accessibility.AudibleAlert()`` to notify the user about other important UI changes.
hu: *Szabály*: Használja az ``OTRS.UI.Accessibility.AudibleAlert()`` függvényt, hogy értesítse a felhasználót az egyéb fontos felhasználói felületet érintő változtatásokról.
zh_cn: *规则*：使用函数 ``OTRS.UI.Accessibility.AudibleAlert()`` 通知用户其它重要的用户界面变化。

source: *Rule*: Use the ``OTRS.UI.Dialog`` framework to create modal dialogs. These are already optimized for accessibility.
hu: *Szabály*: Használja az ``OTRS.UI.Dialog`` keretrendszert a kizárólagos párbeszédablakok létrehozásához. Ezek már optimalizálva vannak az akadálymentesítéshez.
zh_cn: *规则*：使用 ``OTRS.UI.Dialog`` 框架创建模态对话框。这些已经针对无障碍环境进行了优化。

source: General screen reader optimizations
hu: Általános képernyőolvasó optimalizálások
zh_cn: 通用屏幕阅读软件优化

source: Goal: *Help screen readers with their work.*
hu: Cél: *segíteni a képernyőolvasókat a munkájukban.*
zh_cn: 目标：*帮助屏幕阅读器完成工作。*

source: *Rule*: Each page must identify its own main language so that the screen reader can choose the right speech synthesis engine.
hu: *Szabály*: Minden egyes oldalnak azonosítania kell a saját fő nyelvét azért, hogy a képernyőolvasók ki tudják választani a megfelelő beszédszintetizátor motort.
zh_cn: *规则*：每个页面必须标识自己的主语言，以便屏幕阅读器可以选择正确的语音合成引擎。

source: Example: ``<html lang="fr">...</html>``
hu: Példa: ``<html lang="hu">...</html>``
zh_cn: 例如： ``<html lang="fr">...</html>``

source: Code Style Guide
hu: Kódolási stílus irányelvek
zh_cn: 代码样式指南

source: In order to preserve the consistent development of the OTRS project, we have set up guidelines regarding style for the different programming languages.
hu: Az OTRS projekt következetes fejlesztésének megtartása érdekében irányelveket fektettünk le a stílusra vonatkozóan a különböző programnyelvekhez.
zh_cn: 为了保持OTRS项目的一致发展，我们为不同的编程语言制定了样式指南。

source: Whitespace
hu: Üres karakterek
zh_cn: 空格

source: TAB: We use 4 spaces. Examples for braces:
hu: TABULÁTOR: 4 szóközt használunk. Példa a zárójelekre:
zh_cn: TAB：我们用4个空格。大括号示例：

source: Length of Lines
hu: A sorok hossza
zh_cn: 每行宽度

source: Lines should generally not be longer than 120 characters, unless it is necessary for special reasons.
hu: A sorok általában nem lehetnek hosszabbak 120 karakternél, hacsak ez különleges okok miatt nem szükséges.
zh_cn: 除非出于特殊原因，否则每行通常不应超过120个字符。

source: Spaces and Parentheses
hu: Szóközök és zárójelek
zh_cn: 空格和圆括号

source: To gain more readability, we use spaces between keywords and opening parenthesis.
hu: A jobb olvashatóság érdekében szóközöket használunk a kulcsszavak és a nyitó zárójelek között.
zh_cn: 为了获得更多可读性，我们在关键字和左括号之间使用空格。

source: If there is just one single variable, the parenthesis enclose the variable with no spaces inside.
hu: Ha csak egy egyedülálló változó van, akkor a zárójelek belül szóközök nélkül veszik körbe a változót.
zh_cn: 如果只有一个变量，则括号内不用空格包含变量。

source: If the condition is not just one single variable, we use spaces between the parenthesis and the condition. And there is still the space between the keyword (e.g. ``if``) and the opening parenthesis.
hu: Ha a feltétel nem csak egy egyedülálló változó, akkor szóközöket használunk a zárójelek és a feltétel között. És továbbra is szóköz van a kulcsszó (például ``if``) és a nyitó zárójel között.
zh_cn: 如果条件不只是一个变量，我们在括号和条件之间使用空格。 关键字（例如 ``if``）和左括号之间仍然存在空格。

source: Note that for Perl builtin functions, we do not use parentheses:
hu: Ne feledje, hogy a Perl beépített függvényeinél nem használunk zárójeleket:
zh_cn: 请注意，对于Perl内置函数，我们不使用括号：

source: Source Code Header and Charset
hu: Forráskód fejléc és karakterkódolás
zh_cn: 源码文件头和字符集

source: Attach the following header to every source file. Source files are saved in UTF-8 charset.
hu: Csatolja hozzá a következő fejlécet minden egyes forrásfájlhoz. A forrásfájlok UTF-8 karakterkódolással vannak elmentve.
zh_cn: 将以下头部信息附加到每个源文件。 源文件以UTF-8字符集保存。

source: Executable files (``*.pl``) have a special header.
hu: A végrehajtható fájloknak (``*.pl``) különleges fejlécük van.
zh_cn: 可执行文件（ ``*.pl`` ）有一个特殊的文件头。

source: Conditions
hu: Feltételek
zh_cn: 条件

source: Conditions can be quite complex and there can be *chained* conditions (linked with logical *or* or *and* operations). When coding for OTRS, you have to be aware of several situations.
hu: A feltételek meglehetősen összetettek lehetnek, és lehetnek *láncolt* feltételek is (logikai *vagy* vagy *és* operátorral összekapcsolva). Az OTRS kódolásakor tisztában kell lennie számos helyzettel.
zh_cn: 条件可能非常复杂，可能存在 *链式* 条件（与逻辑 *or* 或 *and* 操作链接）。 在编写OTRS时，您必须了解几种情况。

source: Perl best practices says, that high precedence operators (``&&`` and ``||``) shouldn't mixed up with low precedence operators (``and`` and ``or``). To avoid confusion, we always use the high precedence operators.
hu: A bevált Perl gyakorlatok azt mondják, hogy a magas precedenciájú operátorokat (``&&`` és ``||``) nem kellene keverni az alacsony precedenciájú operátorokkal (``and`` és ``or``). A zűrzavar elkerülése érdekében mindig a magas precedenciájú operátorokat használjuk.
zh_cn: Perl最佳实践说，高优先级运算符（ ``&&`` 和 ``||``）不应与低优先级运算符（ ``and``和 ``or``）混淆。 为避免混淆，我们总是使用高优先级运算符。

source: This means that you have to be aware of traps. Sometimes you need to use parenthesis to make clear what you want.
hu: Ez azt jelenti, hogy tisztában kell lennie a buktatókkal. Néha zárójeleket kell használnia, hogy világossá tegye, mit szeretne.
zh_cn: 这意味着您必须了解陷阱。 有时您需要使用括号来明确您想要的内容。

source: If you have long conditions (line is longer than 120 characters over all), you have to break it in several lines. And the start of the conditions is in a new line (not in the line of the ``if``).
hu: Ha hosszú feltételei vannak (a sor 120 karakternél hosszabb), akkor több sorra kell tördelnie azt. Továbbá a feltételek kezdete egy új sorban van (nem az ``if`` sorában).
zh_cn: 如果条件很长（行总长度超过120个字符），则必须将它分成几行。 条件的开始是一个新的行（不在 ``if`` 的行中）。

source: Also note, that the right parenthesis is in a line on its own and the left curly bracket is also in a new line and with the same indentation as the ``if``. The operators are at the beginning of a new line! The subsequent examples show how to do it.
hu: Jegyezze meg azt is, hogy a jobb oldali zárójel egyedül áll a sorban, valamint a bal oldali kapcsos zárójel szintén új sorban van, és ugyanolyan behúzással rendelkezik mint az ``if``. Az operátorok egy új sor elején vannak! A következő példák bemutatják, hogyan kell ezt csinálni.
zh_cn: 另请注意，右括号本身在一行中，左括号也在一个新行中，并且与 ``if`` 具有相同的缩进。 运算符处于新行的开头！ 随后的示例显示了如何执行此操作。

source: Postfix ``if``
hu: Hátul álló ``if``
zh_cn: 后缀 ``if``

source: Generally we use *postfix ``if``* statements to reduce the number of levels. But we don't use it for multiline statements and is only allowed when involves return statements in functions or to end a loop or to go next iteration.
hu: Általánosan azért használunk *hátul álló ``if``* utasításokat, hogy csökkentsük a szintek számát. De ne használjuk többsoros utasításoknál, és csak akkor megengedett, amikor visszatérési utasításokat hoz magával a függvény, vagy egy ciklus befejezéséhez, illetve a következő iterációra való ugráshoz.
zh_cn: 通常我们使用 *后缀 ``if``* 语句来减少级别数。 但我们不将它用于多行语句，只有在函数中包含return语句或结束循环或进行下一次迭代时才允许使用它。

source: This is correct:
hu: Ez helyes:
zh_cn: 这样是对的：

source: This is wrong:
hu: Ez hibás:
zh_cn: 这样是错的：

source: This is less maintainable than this:
hu: Ez kevésbé karbantartható ennél:
zh_cn: 这样更容易维护：

source: Restrictions for the Use of Some Perl Builtins
hu: Néhány beépített Perl szubrutin használatának korlátozása
zh_cn: 使用某些Perl内置函数的限制

source: Some builtin subroutines of Perl may not be used in every place:
hu: A Perl néhány beépített szubrutinját nem lehet használni semmilyen helyen:
zh_cn: Perl的一些内置子程序不适合在每个地方使用：

source: Don't use ``die`` and ``exit`` in ``.pm`` files.
hu: Ne használja a ``die`` és ``exit`` szubrutinokat a ``.pm`` fájlokban.
zh_cn: 不要在 ``.pm`` 文件中使用 ``die`` 和 ``exit``。

source: Don't use the ``Dumper`` function in released files.
hu: Ne használja a ``Dumper`` függvényt a kiadott fájlokban.
zh_cn: 不要在已发布的文件中使用 ``Dumper`` 函数。

source: Don't use ``print`` in ``.pm`` files.
hu: Ne használja a ``print`` utasítást a ``.pm`` fájlokban.
zh_cn: 不要在 ``.pm`` 文件中使用 ``print``。

source: Don't use ``require``, use ``Main::Require()`` instead.
hu: Ne használja a ``require`` kulcsszót, inkább használja a ``Main::Require()`` metódust.
zh_cn: 不要使用 ``require`` ，而是使用 ``Main::Require()``。

source: Use the functions of the ``DateTimeObject`` instead of the builtin functions like ``time()``, ``localtime()``, etc.
hu: Használja a ``DateTimeObject`` függvényeit az olyan beépített függvények helyett, mint például a ``time()``, ``localtime()``, stb.
zh_cn: 使用 ``DateTimeObject`` 的函数代替 ``time()`` 、 ``localtime()`` 等内置函数。

source: Regular Expressions
hu: Reguláris kifejezések
zh_cn: 正则表达式

source: For regular expressions *in the source code*, we always use the ``m//`` operator with curly braces as delimiters. We also use the modifiers ``x``, ``m`` and ``s`` by default. The ``x`` modifier allows you to comment your regex and use spaces to visually separate logical groups.
hu: A reguláris kifejezéseknél *a forráskódban* mindig kapcsos zárójelekkel használjuk az ``m//`` operátort elválasztóként. Használjuk az ``x``, ``m`` és ``s`` módosítókat is alapértelmezetten. Az ``x`` módosító lehetővé teszi a reguláris kifejezések megjegyzéssel történő ellátását, és szóközök használatát a logikai csoportok megjelenésbeli elkülönítéséhez.
zh_cn: 对于 *源代码* 中的正则表达式，我们总是使用带有花括号的 ``m//`` 运算符作为分隔符。 我们默认使用修饰符 ``x``、 ``m`` 和 ``s``。 ``x`` 修饰符允许您注释正则表达式并使用空格来可视地分隔逻辑组。

source: As the space no longer has a special meaning, you have to use a single character class to match a single space (``[ ]``). If you want to match any whitespace you can use ``\s``.
hu: Mivel a szóköznek többé nincs különleges jelentése, ezért egy egyedüli karakterosztályt kell használnia egy egyedülálló szóköz illesztéséhez (``[ ]``). Ha akármennyi szóközre szeretne illeszteni, akkor azt a ``\s`` használatával teheti meg.
zh_cn: 由于空格不再具有特殊含义，您必须使用单个字符类来匹配单个空格（ ``[ ]``）。 如果你想匹配任何空格，你可以使用 ``\s``。

source: In the regex, the dot (``.``) includes the newline (whereas in regex without ``s`` modifier the dot means 'everything but newline'). If you want to match anything but newline, you have to use the negated single character class (``[^\n]``).
hu: A reguláris kifejezésben a pont (``.``) tartalmazza az új sort (minthogy az ``s`` módosító nélküli reguláris kifejezésben a pont azt jelenti, hogy „minden, kivéve az új sor”). Ha bármire szeretne illeszteni az új sort kivéve, akkor a tagadott egyedüli karakterosztályt kell használnia (``[^\n]``).
zh_cn: 在正则表达式中，点（ ``.``）包括换行符（而在没有 ``s`` 修饰符的正则表达式中，点表示“除了换行符之外的所有内容”）。 如果你想匹配除换行之外的任何东西，你必须使用否定的单个字符类（ ``[^\n]``）。

source: An exception to the convention above applies to all cases where regular expressions are not written statically in the code but instead are *supplied by users* in one form or another (for example via system configuration or in a Postmaster filter configuration). Any evaluation of such a regular expression has to be done without any modifiers (e.g. ``$Variable =~ m{$Regex}``) in order to match the expectation of (mostly inexperienced) users and also to be backwards compatible.
hu: A fenti megegyezésre vonatkozó kivétel minden olyan esetre vonatkozik, amikor a reguláris kifejezéseket nem írják statikusan a kódba, hanem a *felhasználók adják meg* egy űrlapon vagy máshol (például a rendszerbeállításokon vagy egy levelezési szűrő beállításán keresztül). Egy ilyen reguláris kifejezés bármely kiértékelését mindenféle módosító nélkül kell elvégezni (például ``$Variable =~ m{$Regex}``) annak érdekében, hogy megfeleljen a (többnyire tapasztalatlan) felhasználók elvárásainak és visszafelé kompatibilis legyen.
zh_cn: 上述约定的适用于所有情况，一个例外是正则表达式不是在代码中静态写入，而是由用户 *以一种或另一种形式提供* （例如通过系统配置或邮箱管理员过滤器配置）。 任何对这种正则表达式的评估都必须在没有任何修饰符的情况下完成（例如 ``$Variable =~ m{$Regex}``），以匹配（大部分是没有经验的）用户的期望，并且也是向后兼容的。

source: If modifiers are strictly necessary for user supplied regular expressions, it is always possible to use embedded modifiers (e.g. ``(?:(?i)SmAlL oR lArGe)``). For details, please see `perlretut <http://perldoc.perl.org/perlretut.html#Embedding-comments-and-modifiers-in-a-regular-expression>`__.
hu: Ha a módosítók pontosan szükségesek a felhasználó által megadott reguláris kifejezésekhez, akkor mindig lehetséges beágyazott módosítók használata (például ``(?:(?i)KiCsI vAgY nAgY)``). A részletekért nézze meg a `perlretut <http://perldoc.perl.org/perlretut.html#Embedding-comments-and-modifiers-in-a-regular-expression>`__ dokumentációját.
zh_cn: 如果修饰符对于用户提供的正则表达式是严格必需的，则始终可以使用嵌入式修饰符（例如 ``(?:(?i)SmAlL oR lArGe)``）。 有关详细信息，请参阅 `perlretut <http://perldoc.perl.org/perlretut.html#Embedding-comments-and-modifiers-in-a-regular-expression>`__。

source: Usage of the ``r`` modifier is encouraged, e.g. if you need to extract part of a string into another variable. This modifier keeps the matched variable intact and instead provides the substitution result as a return value.
hu: Az ``r`` módosító használata erősen javasolt, például ha ki kell nyernie egy szöveg egy részét egy másik változóba. Ez a módosító érintetlenül hagyja az illesztett változót, ahelyett hogy a helyettesítés eredményt nyújtaná visszatérési értékként.
zh_cn: 鼓励使用 ``r`` 修饰符，例如 如果您需要将字符串的一部分提取到另一个变量中。 此修饰符使匹配的变量保持不变，而是将替换结果作为返回值提供。

source: Use this:
hu: Használja ezt:
zh_cn: 这样使用：

source: Instead of this:
hu: Ehelyett:
zh_cn: 而不是这样使用：

source: If you want to match for start and end of a **string**, you should generally use ``\A`` and ``\z`` instead of the more generic ``^`` and ``$`` unless you really need to match start or end of **lines** within a multiline string.
hu: Ha egy **szöveg** elejénél vagy végénél szeretne illeszteni, akkor általában az ``\A`` és a ``\z`` módosítót kell használnia az általánosabb ``^`` és ``$`` helyett, kivéve hogyha valóban a **sorok** elejére vagy végére szeretne illeszteni egy többsoros szövegen belül.
zh_cn: 如果你想匹配 **字符串** 的开头和结尾，你通常应该使用 ``\A`` 和 ``\z`` 而不是更通用的 ``^`` 和 ``$``，除非你真的需要在多行字符串中匹配 **行** 的开头或结尾。

source: Usage of named capture groups is also encouraged, particularly for multi-matches. Named capture groups are easier to read/understand, prevent mix-ups when matching more than one capture group and allow extension without accidentally introducing bugs.
hu: Az elnevezett elfogási csoportok használata szintén erősen javasolt, különösen többszörös illesztéseknél. Az elnevezett elfogási csoportokat egyszerűbb olvasni és megérteni, megakadályozzák az összekeverést, amikor egynél több elfogási csoportot illeszt, és lehetővé teszik a kiterjesztést, anélkül hogy véletlenül programhibákat vinne a rendszerbe.
zh_cn: 还鼓励使用命名捕获组，尤其是对于多个匹配。 命名捕获组更易于阅读/理解，在匹配多个捕获组时防止混淆，并允许扩展而不会意外地引入错误。

source: Naming
hu: Elnevezés
zh_cn: 命名

source: Names and comments are written in English. Variables, objects and methods must be descriptive nouns or noun phrases with the first letter set upper case (`CamelCase <https://en.wikipedia.org/wiki/CamelCase>`__).
hu: A neveket és a megjegyzéseket angolul kell írni. A változókat, objektumokat és metódusokat leíró főnevekkel vagy főnévi igenevekkel írjuk úgy, hogy az első betű nagybetűs legyen (`CamelCase <https://hu.wikipedia.org/wiki/CamelCase>`__).
zh_cn: 名称和注释都用英语。 变量、对象和方法必须是描述性名词或名词短语，第一个字母设置为大写（ `驼峰式命名法 <https://en.wikipedia.org/wiki/CamelCase>`__ ）。

source: Names should be as descriptive as possible. A reader should be able to say what is meant by a name without digging too deep into the code. E.g. use ``$ConfigItemID`` instead of ``$ID``. Examples: ``@TicketIDs``, ``$Output``, ``StateSet()``, etc.
hu: A neveknek annyira leírónak kell lenniük, amennyire csak lehetséges. Az olvasónak egy név alapján meg kell tudni mondania, hogy az mit jelent anélkül, hogy túl mélyre ásná magát a kódban. Például használja a ``$ConfigItemID`` nevet az ``$ID`` helyett. Példák: ``@TicketIDs``, ``$Output``, ``StateSet()``, stb.
zh_cn: 名称应尽可能具有描述性。 读者应该能够在不深入挖掘代码的情况下说出名称的含义。 例如。 使用 ``$ConfigItemID`` 而不是 ``$ID`` 。 例如： ``@TicketIDs`` 、 ``$Output`` 、 ``StateSet()`` 等。

source: Variable Declaration
hu: Változódeklaráció
zh_cn: 变量声明

source: If you have several variables, you can declare them in one line if they *belong together*:
hu: Ha több változója van, akkor deklarálhatja azokat egyetlen sorban, ha azok *összetartoznak*:
zh_cn: 如果有多个变量且 *属于一起*，则可以在一行中声明它们：

source: Otherwise break it into separate lines:
hu: Egyébként tördelje azokat külön sorokba:
zh_cn: 否则，将其分成几行：

source: Do not set to ``undef`` or ``''`` in the declaration as this might hide mistakes in code.
hu: Ne állítson be ``undef`` vagy ``''`` kezdeti értéket a deklarációban, ugyanis ez elrejtheti a hibákat a kódban.
zh_cn: 不要在声明中设置为 ``undef`` 或 ``''`` ，因为这可能会隐藏代码中的错误。

source: You can set a variable to ``''`` if you want to concatenate strings:
hu: Akkor állíthat be egy változót ``''`` értékre, ha szövegeket szeretne összefűzni:
zh_cn: 如果要连接字符串，可以将变量设置为 ``''``：

source: Otherwise you would get an *uninitialized* warning.
hu: Egyébként *előkészítetlen* figyelmeztetést kaphat.
zh_cn: 否则你会收到 *uninitialized（未初始化）* 警告。

source: Handling of Parameters
hu: Paraméterek kezelése
zh_cn: 处理参数

source: To fetch the parameters passed to subroutines, OTRS normally uses the hash ``%Param`` (not ``%Params``). This leads to more readable code as every time we use ``%Param`` in the subroutine code we know it is the parameter hash passed to the subroutine.
hu: A szubrutinoknak átadott paraméterek lekéréséhez az OTRS normális esetben a ``%Param`` kivonatot használja (nem a ``%Params`` kivonatot). Ez jobban olvasható kódot eredményez, mivel minden esetben tudjuk, hogy amikor ``%Param`` kivonatot használjuk a szubrutin kódokban, akkor paraméterkivonat került átadásra a szubrutinnak.
zh_cn: 为了获取传递给子程序的参数，OTRS通常使用散列 ``％Param`` （不是 ``％Params`` ）。 这导致代码更易读，因为每次在子程序代码中使用 ``％Param`` 时我们都知道它是传递给子程序的参数哈希。

source: Just in some exceptions a regular list of parameters should be used. So we want to avoid something like this:
hu: Csak néhány kivételnél kell a paraméterek szabályos listáját használni. Így el szeretnénk kerülni az ehhez hasonlókat:
zh_cn: 除了某些例外情况，应使用常规参数列表。 所以我们想避免这样的事情：

source: We want to use this instead:
hu: Inkább ezt szeretnénk használni:
zh_cn: 我们想要这样使用：

source: This has several advantages:
hu: Ennek számos előnye van:
zh_cn: 这有几个好处：

source: We do not have to change the code in the subroutine when a new parameter should be passed.
hu: Nem kell megváltoztatnunk a kódot a szubrutinban, amikor egy új paramétert kell átadni.
zh_cn: 当要传递新参数时，我们不必更改子程序中的代码。

source: Calling a function with named parameters is much more readable.
hu: Elnevezett paraméterekkel rendelkező függvény hívása sokkal olvashatóbb.
zh_cn: 使用命名参数调用函数更具可读性。

source: Multiple Named Parameters
hu: Több elnevezett paraméter
zh_cn: 多个命名参数

source: If a function call requires more than one named parameter, split them into multiple lines.
hu: Ha egy függvényhívás egynél több elnevezett paramétert igényel, akkor tördelje azokat több sorba.
zh_cn: 如果函数调用需要多个命名参数，请将它们拆分为多行。

source: ``return`` Statements
hu: ``return`` utasítások
zh_cn: ``return`` 语句

source: Subroutines have to have a ``return`` statement. The explicit ``return`` statement is preferred over the implicit way (result of last statement in subroutine) as this clarifies what the subroutine returns.
hu: A szubrutinoknak rendelkezniük kell egy ``return`` utasítással. Az explicit ``return`` utasítás előnyben részesített az implicit módszernél (az utolsó utasítás eredménye a szubrutinban), mivel ez tisztázza, hogy mit ad vissza a szubrutin.
zh_cn: 子程序必须有一个 ``return`` 语句。 显式的 ``return`` 语句优于隐式方式（子程序中最后一个语句的结果），因为这澄清了子程序返回的内容。

source: Explicit Return Values
hu: Explicit visszatérési értékek
zh_cn: 显式返回值

source: Explicit return values means that you should not have a ``return`` statement followed by a subroutine call.
hu: Az explicit visszatérési értékek azt jelentik, hogy nem kell egy ``return`` utasítást tenni egy szubrutinhívást követően.
zh_cn: 显式返回值意味着您不应该有一个 ``return`` 语句，后面跟一个子程序调用。

source: The following example is better as this says explicitly what is returned. With the example above the reader doesn't know what the return value is as he might not know what ``Do()`` returns.
hu: A következő példa jobb, mivel ez explicit módon megmondja, hogy mi kerül visszaadásra. A fenti példával az olvasó nem tudja, hogy mi a visszatérési érték, mivel nem tudhatja, hogy a ``Do()`` mit ad vissza.
zh_cn: 以下示例更好，因为它明确说明了返回的内容。 上面的例子，读者不知道返回值是什么，因为他可能不知道 ``Do()`` 返回什么。

source: If you assign the result of a subroutine to a variable, a *good* variable name indicates what was returned:
hu: Ha egy szubrutin eredményét hozzárendeli egy változóhoz, akkor egy *jó* változónév jelzi, hogy mi lett visszaadva:
zh_cn: 如果将子程序的结果分配给变量，则一个 *良好的* 变量名称可以表明返回的内容：

source: ``use`` Statements
hu: ``use`` utasítások
zh_cn: ``use`` 语句

source: ``use strict`` and ``use warnings`` have to be the first two *uses* in a module.
hu: A ``use strict`` és ``use warnings`` utasításoknak kell az első két *use*-nak lennie egy modulban.
zh_cn: ``use strict`` 和 ``use warnings`` 必须是模块中前两个 *use语句*。

source: Objects and Their Allocation
hu: Objektumok és azok lefoglalása
zh_cn: 对象及其分配

source: In OTRS many objects are available. But you should not use every object in every file to keep the front end/back end separation.
hu: Az OTRS-ben sok objektum érhető el. De nem kell minden egyes objektumot használnia minden fájlban az előtétprogram/háttérprogram elválasztásának megtartásához.
zh_cn: 在OTRS中有许多对象可用。 但是你不应该使用每个文件中的每个对象来保持前端/后端的分离。

source: Don't use the ``LayoutObject`` in core modules (``Kernel/System``).
hu: Ne használja a ``LayoutObject`` objektumot az alapmodulokban (``Kernel/System``).
zh_cn: 不要在核心模块( ``Kernel/System``)中使用 ``LayoutObject`` 。

source: Don't use the ``ParamObject`` in core modules (``Kernel/System``).
hu: Ne használja a ``ParamObject`` objektumot az alapmodulokban (``Kernel/System``).
zh_cn: 不要在核心模块( ``Kernel/System``)中使用 ``ParamObject`` 。

source: Don't use the ``DBObject`` in front end modules (``Kernel/Modules``).
hu: Ne használja a ``DBObject`` objektumot az előtétprogram-modulokban (``Kernel/Modules``).
zh_cn: 不要在核心模块( ``Kernel/System``)中使用 ``DBObject`` 。

source: Documenting Back End Modules
hu: Háttérprogram-modulok dokumentálása
zh_cn: 后端模块文档记录

source: ``NAME`` section
hu: A ``NAME`` szakasz
zh_cn: ``NAME`` 部分
