Repository: bschmalhofer/doc-developer
Catalog: locale/*/LC_MESSAGES/content.po
Languages: hu, zh_cn

source: The following is an example of how to create a process management module configuration field. This field can be used by any process management module after its configuration.
hu: A következő egy példa arra, hogy hogyan kell létrehozni egy folyamatkezelés modul beállítási mezőt. Ezt a mezőt használhatja bármely folyamatkezelés modul a beállítása után.
zh_cn: 以下是如何创建流程管理模块配置字段的示例。 任何流程管理模块在配置后都可以使用该字段。

source: Process Management Module Configuration Field Code Example
hu: Folyamatkezelés modul beállítási mező kódpélda
zh_cn: 流程管理模块配置字段代码示例

source: The following code implements a simple input process management module configuration field (test). The name of the field and its default value can be set trough a process management module ``ConfigSets``.
hu: A következő kód egy egyszerű beviteli folyamatkezelés modul beállítási mezőt (teszt) valósít meg. A mező neve és alapértelmezett értéke egy ``ConfigSets`` folyamatkezelés modulon keresztül állítható be.
zh_cn: 以下代码实现了一个简单的输入流程管理模块配置字段（test）。 可以通过流程管理模块 ``ConfigSets`` 设置字段的名称及其默认值。

source: Every configuration field requires to implement at least 2 main methods: ``Render`` and ``GetParams``.
hu: Minden egyes beállítási mező legalább két fő metódus megvalósítását igényli: ``Render`` és ``GetParams``.
zh_cn: 每个配置字段都需要实现至少2个主要方法：``Render`` 和 ``GetParams``。

source: ``Render`` method is responsible to create the required HTML for the field.
hu: A ``Render`` metódus felelős a szükséges HTML létrehozásáért a mezőnél.
zh_cn: ``Render`` 方法负责为字段创建所需的HTML。

source: In this example it first localize some parameters for more easy read and maintain.
hu: Ebben a példában ez először behatárol néhány paramétert az egyszerűbb olvasásért és karbantartásért.
zh_cn: 在此示例中，它首先本地化一些参数，以便更容易地读取和维护。

source: The following lines set the data to display. The field widget title ``Description`` is gather from the ``ConfigSet`` if defined, otherwise it uses a default text. Similar to the field ``Name``, for the ``Value`` it first checks if the activity or sequence flow action already have a stored value, if not it tries to use the default value from the ``ConfigSet``, or use empty otherwise.
hu: A következő sorok állítják be a megjelenítendő adatokat. A mező felületi elem ``Description`` címe a ``ConfigSet`` változóból lesz kinyerve, ha meg van határozva, egyébként egy alapértelmezett szöveget használ. A ``Name`` mezőhöz hasonlóan a ``Value`` értékénél először ellenőrzi, hogy a tevékenység vagy a szekvenciafolyam-művelet rendelkezik-e már egy eltárolt értékkel, és ha nem, akkor megpróbálja az alapértelmezett értéket használni a ``ConfigSet`` változóból, vagy üres értéket egyébként.
zh_cn: 以下行设置要显示的数据。 如果定义了字段小部件标题 ``Description`` 则从 ``ConfigSet`` 收集，否则它使用默认文本。 类似于字段 ``Name``，对于 ``Value``，它首先检查活动或序列流操作是否已经存储了值，如果没有，它会尝试使用 ``ConfigSet`` 中的默认值， 否则使用空。

source: At the end it returns a structure with the HTML code from a template filled with the gathered data.
hu: A végén visszaad egy szerkezetet a HTML-kóddal, amely a sablonból lett feltöltve a kinyert adatokkal.
zh_cn: 最后，它返回一个结构，其中包含填充了所收集数据的模板中的HTML代码。

source: For this example the ``GetParams`` method is very straight forward. It gets the name of the field from the ``ConfigSet`` or use a default, and gets the value from the web request.
hu: Ennél a példánál a ``GetParams`` metódus nagyon egyértelmű. Lekéri a mező nevét a ``ConfigSet`` változóból vagy egy alapértelmezettet használ, és lekéri az értéket a webkérésből.
zh_cn: 对于这个例子，``GetParams`` 方法非常简单。 它从 ``ConfigSet`` 获取字段的名称或使用默认值，并从Web请求中获取值。

source: Process Management Module Configuration Field Template Example
hu: Folyamatkezelés modul beállítási mező sablon példa
zh_cn: 流程管理模块配置字段模板示例

source: The following code implements a basic HTML template for the test process management module configuration field.
hu: A következő kód egy alap HTML sablont valósít meg a teszt folyamatkezelés modul beállítási mezőhöz.
zh_cn: 以下代码实现了测试流程管理模块配置字段的基本HTML模板。

source: The template shows a simple text input element with its associated label.
hu: A sablon egy egyszerű szöveges beviteli elemet jelenít meg a hozzárendelt címkével.
zh_cn: 模板显示一个简单的文本输入元素及其关联的标签。

source: Queue Preferences Module
hu: Várólista beállítások modul
zh_cn: 队列首选项模块

source: There is a DB queue preferences module which come with the OTRS framework. It is also possible to develop your own queue preferences modules. The queue preferences modules are located under ``Kernel/System/Queue/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of a queue preferences module. Save it under ``Kernel/System/Queue/PreferencesCustom.pm``. You just need 3 functions: ``new()``, ``QueuePreferencesSet()`` and ``QueuePreferencesGet()``. Return 1, then the synchronization is ok.
hu: Létezik egy DB várólista beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját várólista beállítási modulok fejlesztésére is. A várólista beállítási modulok a ``Kernel/System/Queue/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy várólista beállítások modul példája található. Mentse el a ``Kernel/System/Queue/PreferencesCustom.pm`` helyre. Mindössze három függvényre van szüksége: ``new()``, ``QueuePreferencesSet()`` és ``QueuePreferencesGet()``. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.
zh_cn: 有一个与OTRS框架一起提供的DB队列首选项模块。还可以开发自己的队列首选项模块。队列首选项模块位于 ``kernel/system/queue/*.pm`` 下。有关其配置的更多信息，请参阅管理手册。下面是队列首选项模块的示例。将其保存在 ``kernel/system/queue/preferrencescustom.pm`` 下。您只需要3个函数：``new()``、``queuePreferrencesSet()`` 和 ``queuePreferrencesGet()``。返回1，则同步正常。

source: Queue Preferences Code Example
hu: Várólista beállítások kódpélda
zh_cn: 队列首选项代码示例

source: The interface class is called ``Kernel::System::Queue``. The example queue preferences may be called ``Kernel::System::Queue::PreferencesCustom``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::Queue``. A példa várólista beállítások hívhatók ``Kernel::System::Queue::PreferencesCustom`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::Queue``。示例队列首选项可以叫做 ``Kernel::System::Queue::PreferencesCustom``。您可以在下面找到一个示例。

source: Queue Preferences Configuration Example
hu: Várólista beállítások beállítási példa
zh_cn: 队列首选项配置示例

source: There is the need to activate your custom queue preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni várólista beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要激活自定义的队列首选项模块。这可以使用下面的XML配置来完成。

source: Queue Preferences Use Case Example
hu: Várólista beállítások használati eset példa
zh_cn: 队列首选项用例示例

source: Useful preferences implementation could be a SOAP or RADIUS back end.
hu: Hasznos beállítások megvalósítás lehet egy SOAP vagy egy RADIUS háttérprogram.
zh_cn: 有用的首选项实现可以是SOAP或RADIUS后端。

source: Service Preferences Module
hu: Szolgáltatás beállítások modul
zh_cn: 服务首选项模块

source: There is a DB service preferences module which come with the OTRS framework. It is also possible to develop your own service preferences modules. The service preferences modules are located under ``Kernel/System/Service/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of a service preferences module. Save it under ``Kernel/System/Service/PreferencesCustom.pm``. You just need 3 functions: ``new()``, ``ServicePreferencesSet()`` and ``ServicePreferencesGet()``. Return 1, then the synchronization is ok.
hu: Létezik egy DB szolgáltatás beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját szolgáltatás beállítási modulok fejlesztésére is. A szolgáltatás beállítási modulok a ``Kernel/System/Service/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy szolgáltatás beállítások modul példája található. Mentse el a ``Kernel/System/Service/PreferencesCustom.pm`` helyre. Mindössze három függvényre van szüksége: ``new()``, ``ServicePreferencesSet()`` és ``ServicePreferencesGet()``. Adjon vissza 1-et, és ezután a szinkronizáció rendben van.
zh_cn: 有一个与OTRS框架一起提供的DB服务首选项模块。还可以开发自己的服务首选项模块。服务首选项模块位于 ``kernel/system/service/*.pm`` 下。有关其配置的更多信息，请参阅管理手册。下面是服务首选项模块的示例。保存在 ``kernel/system/service/preferrencescustom.pm`` 下。您只需要3个函数：``new()``、``ServicePreferrencesSet()`` 和 ``ServicePreferrencesGet()``。返回1，则同步正常。

source: Service Preferences Code Example
hu: Szolgáltatás beállítások kódpélda
zh_cn: 服务首选项代码示例

source: The interface class is called ``Kernel::System::Service``. The example service preferences may be called ``Kernel::System::Service::PreferencesCustom``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::Service``. A példa szolgáltatás beállítások hívhatók ``Kernel::System::Service::PreferencesCustom`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::Service``。示例服务首选项可以叫做 ``Kernel::System::Service::PreferencesCustom``。您可以在下面找到一个示例。

source: Service Preferences Configuration Example
hu: Szolgáltatás beállítások beállítási példa
zh_cn: 服务首选项配置示例

source: There is the need to activate your custom service preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni szolgáltatás beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要激活自定义的服务首选项模块。这可以使用下面的XML配置来完成。

source: Service Preferences Use Case Example
hu: Szolgáltatás beállítások használati eset példa
zh_cn: 服务首选项用例示例

source: SLA Preferences Module
hu: SLA beállítások modul
zh_cn: SLA首选项模块

source: There is a DB SLA preferences module which come with the OTRS framework. It is also possible to develop your own SLA preferences modules. The SLA preferences modules are located under ``Kernel/System/SLA/*.pm``. For more information about their configuration see the admin manual. Following, there is an example of an SLA preferences module. Save it under ``Kernel/System/SLA/PreferencesCustom.pm``. You just need 3 functions: ``new()``, ``SLAPreferencesSet()`` and ``SLAPreferencesGet()``. Make sure the function returns 1.
hu: Létezik egy DB SLA beállítások modul, amely az OTRS keretrendszerrel érkezik. Lehetőség van saját SLA beállítási modulok fejlesztésére is. Az SLA beállítási modulok a ``Kernel/System/SLA/*.pm`` alatt találhatók. Ezek beállításáról további információkért nézze meg az adminisztrátori kézikönyvet. A következőkben egy SLA beállítások modul példája található. Mentse el a ``Kernel/System/SLA/PreferencesCustom.pm`` helyre. Mindössze három függvényre van szüksége: ``new()``, ``SLAPreferencesSet()`` és ``SLAPreferencesGet()``. Győződjön meg arról, hogy a függvény 1-et adjon vissza.
zh_cn: 有一个与OTRS框架一起提供的DB SLA首选项模块。还可以开发自己的SLA首选项模块。SLA首选项模块位于 ``kernel/system/sla/*.pm`` 下。有关其配置的更多信息，请参阅管理手册。下面是一个SLA首选项模块的示例。将其保存在 ``kernel/system/sla/preferrencescustom.pm`` 下。您只需要3个函数：``new()``、``SLAPreferencesSet()`` 和 ``SLAPreferencesGet()``。确保函数返回1。

source: SLA Preferences Code Example
hu: SLA beállítások kódpélda
zh_cn: SLA首选项代码示例

source: The interface class is called ``Kernel::System::SLA``. The example SLA preferences may be called ``Kernel::System::SLA::PreferencesCustom``. You can find an example below.
hu: A felületosztály neve ``Kernel::System::SLA``. A példa SLA beállítások hívhatók ``Kernel::System::SLA::PreferencesCustom`` néven. Lent találhat egy példát.
zh_cn: 接口类称为 ``Kernel::System::SLA``。示例SLA首选项可以叫做 ``Kernel::System::SLA::PreferencesCustom``。您可以在下面找到一个示例。

source: SLA Preferences Configuration Example
hu: SLA beállítások beállítási példa
zh_cn: SLA首选项配置示例

source: There is the need to activate your custom SLA preferences module. This can be done using the XML configuration below.
hu: Szükség van az egyéni SLA beállítások modul bekapcsolására. Ezt a lenti XML beállítás használatával lehet megtenni.
zh_cn: 需要激活自定义的SLA首选项模块。这可以使用下面的XML配置来完成。

source: SLA Preferences Use Case Example
hu: SLA beállítások használati eset példa
zh_cn: SLA首选项用例示例

source: Useful preferences implementation could be to store additional values on SLAs.
hu: Hasznos beállítások megvalósítás lehet további értékek tárolása az SLA-khoz.
zh_cn: 有用的首选项实现可以在SLA上存储额外的值。

source: Stats Module
hu: Statisztikák modul
zh_cn: 统计模块

source: There are two different types of internal stats modules - dynamic and static. This section describes how such stats modules can be developed.
hu: A belső statisztikamoduloknak két különböző típusa létezik - dinamikus és statikus. Ez a szakasz azt írja le, hogy az ilyen statisztikamodulok hogyan fejleszthetők.
zh_cn: 有两种不同类型的内部统计模块-动态和静态。本节描述如何开发这些统计模块。

source: Dynamic Stats
hu: Dinamikus statisztikák
zh_cn: 动态统计

source: In contrast to static stats modules, dynamic statistics can be configured via the OTRS web interface. In this section a simple statistic module is developed. Each dynamic stats module has to implement these subroutines:
hu: A statikus statisztikamodulokkal ellentétben a dinamikus statisztikák beállíthatók az OTRS webes felületén keresztül. Ebben a szakaszban egy egyszerű statisztikamodul kerül fejlesztésre. Minden egyes dinamikus statisztikamodulnak meg kell valósítania ezeket a szubrutinokat:
zh_cn: 与静态统计模块不同，动态统计可以通过OTRS Web界面进行配置。本节开发了一个简单的统计模块。每个动态统计模块都必须实现这些子程序：

source: Furthermore the module has to implement either ``GetStatElement`` or ``GetStatTable``. And if the header line of the result table should be changed, a sub called ``GetHeaderLine`` has to be developed.
hu: Továbbá a modulnak meg kell valósítania vagy a ``GetStatElement``, vagy a ``GetStatTable`` rutint. És ha az eredménytábla fejlécsorát is meg kell változtatni, akkor egy úgynevezett ``GetHeaderLine`` szubrutint is fejleszteni kell.
zh_cn: 此外，模块必须实现 `GetStatElement`` 或 ``GetStatTable``。如果结果表的标题行应该更改，则必须开发名为 ``GetHeaderLine`` 的子程序。

source: Stats Code Example
hu: Statisztikák kódpélda
zh_cn: 统计代码示例

source: In this section a sample stats module is shown and each subroutine is explained.
hu: Ebben a szakaszban egy minta statisztikamodul lesz megjelenítve, és minden szubrutin elmagyarázásra kerül.
zh_cn: 在本节中，将显示一个统计模块的样本，并解释每个子程序。

source: This is a common boilerplate that can be found in common OTRS modules. The class/package name is declared via the ``package`` keyword. Then the needed modules are used via the ``use`` keyword.
hu: Ez egy gyakori sabloncsomag, amely megtalálható a szokásos OTRS modulokban. Az osztály/csomag neve a ``package`` kulcsszón keresztül van deklarálva. Ezután a szükséges modulok használatának megadása következik a ``use`` kulcsszóval.
zh_cn: 这是一个常见的样板文件，可以在常见的OTRS模块中找到。类/包名称通过 ``package`` 关键字声明。然后通过关键字 ``use`` 使用所需的模块。

source: The ``new`` is the constructor for this statistic module. It creates a new instance of the class. According to the coding guidelines objects of other classes that are needed in this module have to be created in ``new``. In lines 27 to 29 the object of the stats module is created. Lines 31 to 37 check if objects that are needed in this code - either for creating other objects or in this module - are passed. After that the other objects are created.
hu: A ``new`` a statisztikamodul konstruktora. Ez hozza létre az osztály új példányát. A kódolási irányelveknek megfelelően az ebben a modulban szükséges más osztályok objektumait is a ``new`` konstruktorban kell létrehozni. A 27-29. sorban van létrehozva a statisztikák modul objektuma. A 31-37. sorban azt ellenőrzik, hogy az ebben a kódban szükséges objektumok - vagy más objektumok létrehozásánál, vagy ebben a modulban - át vannak-e adva. Ezután a többi objektum kerül létrehozásra.
zh_cn: ``new`` 是这个统计模块的构造函数。 它创建了一个新的类实例。 根据编码指南，必须在 ``new`` 中创建此模块中所需的其它类的对象。 在第27至29行中，创建了统计模块的对象。 第31到37行检查是否传递了此代码中所需的对象 - 用于创建其它对象或在此模块中。 之后，创建其它对象。

source: ``GetObjectName`` returns a name for the statistics module. This is the label that is shown in the drop down in the configuration as well as in the list of existing statistics (column *object*).
hu: A ``GetObjectName`` visszaad egy nevet a statisztikák modulhoz. Ez az a címke, amely a lenyíló menüben jelenik meg a beállításokban, valamint a meglévő statisztikák listájában (az *objektum* oszlopban).
zh_cn: ``GetObjectName`` 返回统计模块的名称。 这是在配置的下拉列表中以及现有统计信息列表（ *对象* 列）中显示的标签。

source: In this sample stats module, we want to provide three attributes the user can chose from: a list of queues, a list of states and a time drop down. To get the values shown in the drop down, some operations are needed. In this case ``StateList`` and ``GetAllQueues`` are called.
hu: Ebben a minta statisztikák modulban három olyan attribútumot szeretnénk szolgáltatni, amelyből a felhasználó választhat: a várólisták listáját, az állapotok listáját és egy idő legördülőt. A legördülőben megjelenített értékek lekéréséhez szükséges néhány művelet. Ebben az esetben a ``StateList`` és a ``GetAllQueues`` kerül meghívásra.
zh_cn: 在此示例统计模块中，我们希望提供用户可以选择的三个属性：队列列表、状态列表和时间下拉列表。 要获得下拉列表中显示的值，需要执行一些操作。 在本例中是调用 ``StateList`` 和 ``GetAllQueues``。

source: Then the list of attributes is created. Each attribute is defined via a hash reference. You can use these keys:
hu: Ezután az attribútumok listája kerül létrehozásra. Minden egyes attribútum egy kivonathivatkozáson keresztül van meghatározva. Ezeket a kulcsokat használhatja:
zh_cn: 然后创建属性列表。 每个属性都通过哈希引用定义。 您可以使用以下键：

source: The label in the web interface.
hu: A címke a webes felületen.
zh_cn: Web界面中的标签。

source: This attribute can be used on the x-axis.
hu: Ez az attribútum használható az X-tengelyen.
zh_cn: 该属性可以在X轴上使用。

source: This attribute can be used on the y-axis.
hu: Ez az attribútum használható az Y-tengelyen.
zh_cn: 该属性可以在Y轴上使用。

source: This attribute can be used for restrictions.
hu: Ez az attribútum használható a korlátozásokhoz.
zh_cn: 此属性可用于限制。

source: The HTML field name.
hu: A HTML mező neve.
zh_cn: HTML字段名。

source: The block name in the template file (e.g. ``<OTRS_HOME>/Kernel/Output/HTML/Standard/AgentStatsEditXaxis.tt``).
hu: A blokknév a sablonfájlban (például ``<OTRS_HOME>/Kernel/Output/HTML/Standard/AgentStatsEditXaxis.tt``).
zh_cn: 模板文件中的块名称（例如： ``<OTRS_HOME>/Kernel/Output/HTML/Standard/AgentStatsEditXaxis.tt``）。

source: The values shown in the attribute.
hu: Az attribútumban megjelenített értékek.
zh_cn: 属性中显示的值。

source: Hint: If you install this sample and you configure a statistic with some queues - lets say 'queue A' and 'queue B' - then these queues are the only ones that are shown to the user when he starts the statistic. Sometimes a dynamic drop down or multiselect field is needed. In this case, you can set ``SelectedValues`` in the definition of the attribute:
hu: Tipp: Ha telepíti ezt a mintát, és beállít egy statisztikát néhány várólistával (mondjuk „A várólista” és „B várólista”), akkor ezek a várólisták az egyetlenek, amelyek láthatóak lesznek a felhasználónak, amikor elindítja a statisztikát. Néha egy dinamikus legördülő vagy többválasztós mező szükséges. Ebben az esetben beállíthatja a ``SelectedValues`` kulcsot az attribútum meghatározásában:
zh_cn: 提示：如果您安装此示例并配置带有某些队列的统计信息 - 比如说'队列A'和'队列B' - 那么这些队列是用户在启动统计信息时显示的唯一队列。 有时需要动态下拉或多选字段。 在这种情况下，您可以在属性的定义中设置 ``SelectedValues``：

source: ``GetStatElement`` gets called for each cell in the result table. So it should be a numeric value. In this sample it does a simple ticket search. The hash ``%Param`` contains information about the *current* x-value and the y-value as well as any restrictions. So, for a cell that should count the created tickets for queue *Misc* with state *open* the passed parameter hash looks something like this:
hu: A ``GetStatElement`` kerül meghívásra minden egyes cellánál az eredménytáblában. Így annak számszerű értéknek kell lennie. Ebben a mintában egy egyszerű jegykeresést hajt végre. A ``%Param`` kivonat tartalmaz információkat a *jelenlegi* X-értékről és Y-értékről, valamint bármely korlátozásról. Így egy olyan cellánál, amelynek össze kell számolnia a *nyitott* állapotban lévő létrehozott jegyeket a *Misc* várólistánál, az átadott paraméter kivonat valahogy így néz ki:
zh_cn: 为结果表中的每个单元格调用 ``GetStatElement``。 所以它应该是一个数值。 在此示例中，它执行简单的工单搜索。 哈希 ``%Param`` 包含有关 *当前* x值和y值以及任何限制的信息。 因此，对于一个计算使用状态为 *处理中* 、已创建的 *Misc* 队列的工单的单元格，传递的参数哈希看起来像这样：

source: If the *per cell* calculation should be avoided, ``GetStatTable`` is an alternative. ``GetStatTable`` returns a list of rows, hence an array of array references. This leads to the same result as using ``GetStatElement``.
hu: Ha a *cellánkénti* számítást el kellene kerülni, akkor a ``GetStatTable`` egy alternatíva. A ``GetStatTable`` visszaadja a sorok listáját, amely ezentúl egy tömbhivatkozások tömbje. Ez ugyanahhoz az eredményhez vezet mint a ``GetStatElement`` használata.
zh_cn: 如果应该避免 *按单元格* 的计算，``GetStatTable`` 是另一种选择。 ``GetStatTable`` 返回一个行列表，因此返回一个数组引用数组。 这导致与使用 ``GetStatElement`` 相同的结果。

source: ``GetStatTable`` gets all information about the stats query that is needed. The passed parameters contain information about the attributes (``Restrictions``, attributes that are used for x/y-axis) and the table structure. The table structure is a hash reference where the keys are the values of the y-axis and their values are hash references with the parameters used for ``GetStatElement`` subroutines.
hu: A ``GetStatTable`` az összes olyan információt lekéri a statisztikák lekérdezéssel kapcsolatban, amelyek szükségesek. Az átadott paraméterek információkat tartalmaznak az attribútumokról (``Restrictions``, olyan attribútumok, amelyek az X/Y-tengelynél vannak használva) és a táblaszerkezetről. A táblaszerkezet egy olyan kivonathivatkozás, ahol a kulcsok az Y-tengely értékei, és azok értékei kivonathivatkozások a ``GetStatElement`` szubrutinokhoz használt paraméterekkel.
zh_cn: ``GetStatTable`` 获取有关所需统计信息查询的所有信息。 传递的参数包含有关属性的信息（``Restrictions``，用于x / y轴的属性）和表结构。 表结构是一个哈希引用，其中键是y轴的值，它们的值是哈希引用，其参数用于 ``GetStatElement`` 子程序。

source: Sometimes the headers of the table have to be changed. In that case, a subroutine called ``GetHeaderLine`` has to be implemented. That subroutine has to return an array reference with the column headers as elements. It gets information about the x-values passed.
hu: Néha a táblázat fejléceit meg kell változtatni. Ebben az esetben egy ``GetHeaderLine`` nevű szubrutint kell megvalósítani. Ennek a szubrutinnak egy tömbhivatkozást kell visszaadnia az oszlopfejlécekkel mint elemekkel. Ez információkat kap az átadott X-értékekkel kapcsolatban.
zh_cn: 有时候必须更改表格的标题。 在这种情况下，必须实现一个名为 ``GetHeaderLine`` 的子程序。 该子程序必须返回一个数组引用，并将列标题作为元素。 它获取有关传递的x值的信息。

source: Configured statistics can be exported into XML format. But as queues with the same queue names can have different IDs on different OTRS instances it would be quite painful to export the IDs (the statistics would calculate the wrong numbers then). So an export wrapper should be written to use the names instead of ids. This should be done for each *dimension* of the stats module (x-axis, y-axis and restrictions).
hu: A beállított statisztikák exportálhatók XML-formátumba. De ahogy a várólistáknál, ahol ugyanazok a várólistanevek rendelkezhetnek különböző azonosítókkal a különböző OTRS példányoknál, különösen fájdalmas lehet az azonosítók exportálása (a statisztikák ekkor rossz számokat számítanának ki). Ezért egy exportálási átalakítót kell írni, hogy az azonosítók helyett neveket használjon. Ezt a statisztikák modul minden egyes *dimenziójánál* el kell végezni (X-tengely, Y-tengely és korlátozások).
zh_cn: 配置的统计信息可以导出为XML格式。 但是由于具有相同队列名称的队列在不同的OTRS实例上可以具有不同的ID，因此导出ID将非常痛苦（统计数据将计算错误的数字）。 因此，应编写导出封装器以使用名称而不是ID。 应该对统计模块的每个 *维度* （x轴、y轴和限制）进行此操作。
